{
  "id": "1761411910625-a-report-claims-left-wing-terrorism-is-rising-the-data-paints-a-complicated-picture",
  "category": "left",
  "source": {
    "url": "https://www.npr.org/2025/10/25/nx-s1-5583997/political-violence-left-right-wing",
    "title": "A report claims left-wing terrorism is rising. The data paints a complicated picture",
    "published_at": "Sat, 25 Oct 2025 07:36:09 -0400"
  },
  "facts": [
    "U.S. flags fly at half staff following the assassination of conservative commentator Charlie Kirk.",
    "The report analyzed roughly 30 years of data and found that between Jan. 1 and July 4, far-left terrorist plots outnumbered those from the right by five to one in incidents coded as such during the first half of 2025.",
    "Five instances were coded as left-wing terrorism for the first six months of 2025 according to Byman and McCabe's study at CSIS.",
    "The single act that was counted by CSIS in right-wing terrorism during this period involved the shooting of Minnesota state senator John Hoffman."
  ],
  "neutral": {
    "headline": "CSIS Report Analyzes Domestic Terrorism Trends",
    "body_html": "<p>A report from CSIS analyzing domestic terrorism trends in the U.S., based on roughly three decades of data, found a disproportionate number of far-left plots compared to right-wing ones during the first half of 2025.</p>"
  },
  "conservative": {
    "headline": "Report Suggests Increase in Far-Left Terrorism",
    "body_html": "<p>A recent report from CSIS suggests a significant increase in far-left terrorist activities, with five instances coded as such for the first half of 2025. This comes despite only one act being counted by the study within right-wing extremism during this period.</p>"
  },
  "liberal": {
    "headline": "CSIS Report Finds Disproportionate Left-Wing Terrorist Activity",
    "body_html": "<p>The CSIS report, analyzing data from the past thirty years and focusing on incidents coded as domestic terrorism between Jan. 1 and July 4 of 2025, indicates a concerning rise in far-left plots compared to right-wing ones during this period.</p>"
  }
}