{
  "id": "1761418587484-cnn-anchor-reveals-second-diagnosis-of-fairly-rare-form-of-ovarian-cancer-new-york-post",
  "category": "entertainment",
  "leaning": "center",
  "source": {
    "url": "https://nypost.com/2025/10/24/media/cnns-christiane-amanpour-diagnosed-with-ovarian-cancer-again/",
    "title": "CNN anchor reveals second diagnosis of 'fairly rare' form of ovarian cancer - New York Post",
    "published_at": "2025-10-24T13:13:00Z",
    "image": "https://nypost.com/wp-content/uploads/sites/2/2025/10/114097512.jpg?quality=75&strip=all&w=1200",
    "name": "New York Post"
  },
  "facts": [
    "CNN anchor disclosed a second diagnosis",
    "Disease had returned after being off the air for a month",
    "Doctors described it as 'fairly rare' form of ovarian cancer"
  ],
  "neutral": {
    "headline": "CNN anchor discloses second diagnosis with fairly rare type of recurrent ovarian cancer.",
    "body_html": "<p>After a month off the air, <strong>Christiane Amanpour</strong>, veteran journalist and CNN anchor, has revealed that she was re-diagnosed with an 'ovarian cancer' which doctors have described as being of a fairly rare type. The recurrence comes after her initial diagnosis.</p>"
  },
  "conservative": {
    "headline": "CNN Anchor Reveals Recurrent Ovarian Cancer Diagnosis.",
    "body_html": "<p>Christiane Amanpour, a respected journalist and CNN anchor who took time off the air recently due to health concerns, has disclosed that she was re-diagnosed with ovarian cancer. Doctors have described this as being of a fairly rare type.</p>"
  },
  "liberal": {
    "headline": "<strong>CNN Anchor</strong> Reveals Recurrent Ovarian Cancer Diagnosis, Demands Better Healthcare Access.",
    "body_html": "<p><strong>Christiane Amanpour</strong>, a veteran journalist and CNN anchor who recently took time off the air due to health concerns, has disclosed that she was re-diagnosed with ovarian cancer. Doctors have described this as being of a fairly rare type.</p>"
  }
}