{
  "id": "1761411768736-drone-photo-winners-will-amaze-your-eyeballs-from-a-high-up-horseman-to-a-holy-river",
  "category": "left",
  "source": {
    "url": "https://www.npr.org/sections/goats-and-soda/2025/10/25/g-s1-94482/drone-photo-contest-winners",
    "title": "Drone photo winners will amaze your eyeballs: From a high-up horseman to a holy river",
    "published_at": "Sat, 25 Oct 2025 08:27:08 -0400"
  },
  "facts": [
    "A solitary horseman stands atop a rocky outcropping in Cappadocia, Turkey.",
    "The photo 'The Lone Horseman' by Dennis Schmelz took top honors in the Siena awards for aerial photography captured by drones.",
    "'Silence fills the air and the whole region feels timeless and untouched,' says photographer Dennis Schmelz about his experience at sunset with a drone capturing a horseman on snow-covered rocks in Cappadocia, Turkey.",
    "The image was made possible by carefully calibrated shooting angles for drones as noted by Susanna Scafuri, another judge of the competition.",
    "'From above,' says Cornelia Marchis, 'we can discover new perspectries and reveal patterns that are invisible from ground.'",
    "Fran Arnau's photograph titled 'Dhaka, Urban Panorama' was made in Dhaka City using 12 drone shots merged into a single panorama.",
    "'Traditional Boli Khela,' an annual wrestling tournament held on April 25th by Mohammad Shahriar Foisal during Abdul Jabbar’s reign, is celebrated in Chittagong with thousands of participants and spectators from across the country and abroad.",
    "Sarah Wouters captured a photo titled 'The seaweed road of Fujian' where bamboo poles used for drying seaweed span mudflats near fishing boats in Shajiang village, Xiapu county, China during May when it started to rain.",
    "Mohammad Ataei Mohammadi documented the severe drought at Lake Urmia with a photo titled 'Swallowed — a ship stranded in a dried-out lake,' where he drives 870 miles from Gonbad Kavus, Iran for this environmental documentation.",
    "Thibault Gerbaldi's photograph of the Ganga Aarti ceremony at sunset on Lake Varanasi won first place in People category."
  ],
  "neutral": {
    "headline": "Aerial Drone Photography Winners Unveiled",
    "body_html": "<p>Dennis Schmelz's 'The Lone Horseman,' Fran Arnau's panoramic view of Dhaka, Mohammad Shahriar Foisal's depiction of Boli Khela in Chittagong, Sarah Wouters captures the seaweed road scene at Lake Urmia during rain and Thibault Gerbaldi photographs Ganga Aarti ceremony. Other notable winners include Mohammad Ataei Mohammadi's photo documenting drought conditions of Lake Urmia in Iran, showcasing environmental concerns through the lens.</p>"
  },
  "conservative": {
    "headline": "Aerial Drone Photography Winners Unveiled",
    "body_html": "<p>Dennis Schmelz's 'The Lone Horseman,' Fran Arnau's panoramic view of Dhaka, Mohammad Shahriar Foisal's depiction of Boli Khela in Chittagong are celebrated. Sarah Wouters captures the seaweed road scene at Lake Urmia during rain and Thibault Gerbaldi photographs Ganga Aarti ceremony as part of cultural celebrations.</p>"
  },
  "liberal": {
    "headline": "Celebrating Diversity Through Aerial Drone Photography",
    "body_html": "<p>Dennis Schmelz's 'The Lone Horseman,' Fran Arnau's panoramic view of the vibrant city life in Bangladesh, Mohammad Shahriar Foisal captures Boli Khela wrestling festival representing cultural unity and strength. Sarah Wouters documents environmental impact on Lake Urmia with her rain-affected seaweed road photo while Thibault Gerbaldi's Ganga Aarti ceremony picture celebrates the spiritual connection to nature.</p>"
  }
}