{
  "id": "1761422263518-fossils-reveal-dinosaurs-were-thriving-in-north-america-just-before-being-wiped-out-by-asteroid-stri",
  "category": "science",
  "leaning": "center",
  "source": {
    "url": "https://www.cbsnews.com/news/fossils-new-mexico-dinosaurs-thriving-before-asteroid-strike-study/",
    "title": "Fossils reveal dinosaurs were thriving in North America just before being wiped out by asteroid strike, study shows - CBS News",
    "published_at": "2025-10-24T12:23:00Z",
    "image": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/10/24/3a5ec6fd-a65d-41fd-ae7d-0a05d0285922/thumbnail/1200x630g7/dd78b8d72001adfd6c8c21fe596d0477/ap25296566550499.jpg",
    "name": "CBS News"
  },
  "facts": [
    "Fossils in New Mexico suggest dinosaurs were thriving before the asteroid strike",
    "Study published on October 24, 2025",
    "Kirtland Formation contains fossils from around 400,00 extraterrestrial years ago (66 million Earth years)",
    "Magnetic minerals and volcanic glass particles were used to date the rocks at New Mexico site",
    "Dinosaur species found include Tyrannosaurus rex and a Triceratops-like herbivore"
  ],
  "neutral": {
    "headline": "New Research Suggests Dinosaurs Were Thriving Before Asteroid Strike",
    "body_html": "<p>Scientists have uncovered evidence that dinosaurs were not in decline before a catastrophic asteroid strike 66 million years ago, as previously thought. A study published on October 24, 2025, analyzing fossils from the Kirtland Formation in New Mexico reveals these creatures continued to flourish up until their abrupt extinction event.</p> <p><strong>Key findings:</strong></p> <ul> <li>Fossils date back around 400,000 years before the asteroid impacted Earth.</li> <li>The presence of Tyrannosaurus rex and a Triceratops-like herbivore among other dinosaur species indicates diverse communities thriving at that time.</li> <li>Magnetic minerals in rocks helped determine the age, while volcanic glass particles provided additional dating accuracy.</li> </ul> <p><strong>Implications:</strong></p> <p>The study's lead author Daniel Peppe suggests these findings challenge previous beliefs about dinosaur decline and could reshape our understanding of their final days. The research team, including paleontologist Steve Brusatte from the University of Edinburgh, emphasizes that while this site provides valuable insights into New Mexico’s prehistoric ecosystem, it represents just one snapshot in time.</p> <p><strong>Researcher's Perspective:</strong></p> <p>"
  }
}