{
  "id": "1761417733495-gm-lays-off-hundreds-of-salaried-workers-as-part-of-profit-push-the-detroit-news",
  "category": "business",
  "leaning": "center",
  "source": {
    "url": "https://www.detroitnews.com/story/business/autos/general-motors/2025/10/24/gm-lays-off-hundreds-of-salaried-workers-as-part-of-profit-push/86874419007/",
    "title": "GM lays off hundreds of salaried workers as part of profit push - The Detroit News",
    "published_at": "2025-10-24T14:04:56Z",
    "image": "https://www.detroitnews.com/gcdn/authoring/authoring-images/2025/10/24/PDTN/86874514007-gmbg-co-4-bxqlcujaq-7-a-2-cynsz-7-eqjja.jpg?crop=2996,1687,x0,y153&width=2996&height=1687&format=pjpg&auto=webp",
    "name": "The Detroit News"
  },
  "facts": [
    "GM lays off hundreds of salaried workers",
    "Occurred at the automaker's Warren Technical Center",
    "Cuts were due to 'business conditions'"
  ],
  "neutral": {
    "headline": "GMC Layoffs Happen as Part of Profit Drive - The Detroit News",
    "body_html": "<p>General Motors has initiated layoffs, affecting hundreds of salaried employees. This decision primarily impacts the workforce at GM's Warren Technical Center and is attributed to prevailing business conditions.</p>"
  },
  "conservative": {
    "headline": "GM Cuts Costs by Reducing Salaried Workforce Amid Profit-Driven Business Conditions - The Detroit News",
    "body_html": "<p>In a move to boost profits, General Motors has made the difficult decision to lay off hundreds of salaried employees. This reduction in workforce is primarily seen at GM's Warren Technical Center and stems from current business conditions that necessitate cost-cutting measures.</p>"
  },
  "liberal": {
    "headline": "GM Layoffs Raise Concerns as Profit Drive Leads to Worker Impact - The Detroit News",
    "body_html": "<p>General Motors has announced layoffs that will affect hundreds of salaried workers, with the majority being from GM's Warren Technical Center. These job cuts are a direct result of business conditions aimed at increasing profits.</p>"
  }
}