{
  "id": "1761413954398-parents-urged-to-vaccinate-children-over-half-term-as-flu-cases-rise",
  "category": "center",
  "source": {
    "url": "https://www.bbc.com/news/articles/cpwv7yw4dz9o?at_medium=RSS&at_campaign=rss",
    "title": "Parents urged to vaccinate children over half-term as flu cases rise",
    "published_at": "Sat, 25 Oct 2025 13:06:17 GMT"
  },
  "facts": [
    "Parents are being urged to get their children vaccinated against flu over half-term.",
    "The NHS warned of rising cases of the disease as there is an early flu season, health officials say.",
    "Cases and hospitalisations were increasing in England according to latest data for England.",
    "Many school children will have already received the vaccine at school but options are still available.",
    "GP surgeries can give flu shots to eligible school-aged children with certain health conditions, as well as two and three year olds.",
    "Preschoolers can also be taken to pharmacies for the vaccine.",
    "Most children are offered the vaccine in a nasal spray rather than an injection.",
    "NHS England's weekly flu and Covid surveillance report indicated increased flu activity, particularly among children.",
    "Dr Fari Ahmad observed cases but stated that it might not yet be at its peak."
  ],
  "neutral": {
    "headline": "Parents Urged to Vaccinate Children Against Flu Over Half-term",
    "body_html": "<p>With an early flu season, health officials are urging parents in England to vaccinate their children against the flu over half-term. NHS data shows a rise in cases and hospitalizations.</p>"
  },
  "conservative": {
    "headline": "Parents Urged To Vaccinate Children Against Flu Over Half-term",
    "body_html": "<p>As the flu season arrives early, health officials are urging parents to vaccinate their children. NHS England reports an increase in cases and hospitalizations.</p>"
  },
  "liberal": {
    "headline": "Health Officials Encourage Flu Vaccinations for Children Amid Early Season Rise",
    "body_html": "<p>With the flu season starting earlier than usual, health officials are encouraging parents to vaccinate their children. NHS England has reported a rise in cases and hospitalizations.</p>"
  }
}