{
  "id": "1761405998615-picasso-portrait-of-muse-dora-maar-long-hidden-from-view-sells-for-dollar37-million",
  "source": {
    "url": "https://www.npr.org/2025/10/25/nx-s1-5585904/picasso-dora-maar-painting-auction",
    "title": "Picasso portrait of muse Dora Maar, long hidden from view, sells for $37 million",
    "published_at": "Sat, 25 Oct 2025 09:10:08 -0400"
  },
  "facts": [
    "Painting 'Bust of a Woman with a Flowered Hat (Dora Maar)' sold for 32 million euros.",
    "'Bust of a Woman with a Flowered Hat' was painted in July 1943 by the artist and longtime muse, who had been his partner for about seven years at that time. The relationship ended around this period as he left her for another woman named Francoise Gilot.",
    "The painting 'Bust of a Woman with a Flowered Hat' was part of Picasso's series titled 'Woman in a Hat'.",
    "'Bust of a Woman with a Flowered Hat (Dora Maar)' depicts the muse wearing brightly colored floral hat.",
    "The painting remained hidden from public view for over eight decades after being purchased by Picasso's family post-creation in 1944."
  ],
  "neutral": {
    "headline": "Painting 'Bust of a Woman with Flowered Hat Sells at Auction",
    "body_html": "<p>A painting titled 'Bust of a Woman with a Flowered Hat', created in July 1943, sold for 32 million euros. The artwork was part of Picasso's series and depicted the muse wearing brightly colored floral hat.</p>"
  },
  "conservative": {
    "headline": "'Bust of a Woman with Flowered Hat Sells at Auction",
    "body_html": "<p>A painting titled 'Bust of a Woman with a Flowered Hat', created in July 1943, sold for 32 million euros. The artwork was part of Picasso's series and depicted the muse wearing brightly colored floral hat.</p>"
  },
  "liberal": {
    "headline": "'Bust of a Woman with Flowered Hat Sells for Record Price",
    "body_html": "<p>A painting titled 'Bust of a Woman with a Flowered Hat', created in July 1943, sold for an unprecedented price at auction. The artwork was part of Picasso's series and depicted the muse wearing brightly colored floral hat.</p>"
  }
}