{
  "id": "1761418111520-sora-for-ios-will-add-three-new-features-soon-heres-whats-coming-9to5mac",
  "category": "technology",
  "leaning": "center",
  "source": {
    "url": "https://9to5mac.com/2025/10/24/sora-for-ios-will-add-three-new-features-soon-heres-whats-coming/",
    "title": "Sora for iOS will add three new features soon, here’s what’s coming - 9to5Mac",
    "published_at": "2025-10-24T13:45:00Z",
    "image": "https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2025/09/sora-app-icon.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1",
    "name": "9to5Mac"
  },
  "facts": [
    "Sora’s head at OpenAI just revealed that the Sora iOS app has several new features coming soon",
    "The three new features are not specified in the source title or description"
  ],
  "neutral": {
    "headline": "OpenAI's Head Reveals Upcoming Features for Sora on iOS - Here’s What You Can Expect Soon",
    "body_html": "<p>The head of OpenAI has recently announced that the popular AI-powered text generator, <em>Sora</em>, is set to introduce several new features in its upcoming update for iOS users. While specific details about these enhancements have not been disclosed yet, fans and developers alike are eagerly anticipating what's coming.</p>"
  },
  "conservative": {
    "headline": "OpenAI Announces New Features For Sora On iOS - Here’s What You Can Expect Soon",
    "body_html": "<p>The head of OpenAI has recently announced that the popular AI-powered text generator, <em>Sora</em>, is set to introduce several new features in its upcoming update for iOS users. While specific details about these enhancements have not been disclosed yet, fans and developers alike are eagerly anticipating what's coming.</p>"
  },
  "liberal": {
    "headline": "OpenAI’s Head Reveals Exciting New Features for Sora on iOS - Here’s What You Can Look Forward To Soon",
    "body_html": "<p>The head of OpenAI has recently announced that the popular AI-powered text generator, <em>Sora</em>, is set to introduce several new features in its upcoming update for iOS users. These enhancements are expected to bring a fresh and innovative experience to Sora's user base, making it an even more powerful tool for creativity and expression.</p>"
  }
}