{
  "id": "1761417557424-what-killed-napoleons-army-scientists-find-clues-in-dna-from-fallen-soldiers-teeth-shots-health-news",
  "category": "general",
  "leaning": "center",
  "source": {
    "url": "https://www.npr.org/sections/shots-health-news/2025/10/24/nx-s1-5582719/napoleon-war-russia-pathogens-disease-1812",
    "title": "What killed Napoleon's army? Scientists find clues in DNA from fallen soldiers' teeth : Shots - Health News - NPR",
    "published_at": "2025-10-24T15:00:53Z",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/2048x1152+0+192/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb4%2Ffd%2Fd4174c1d418aa492bba4e2ba20d1%2F013.JPG",
    "name": "NPR"
  },
  "facts": [
    "In 1812, hundreds of thousands of men in Napoleon's army perished during their retreat from Russia.",
    "Researchers now believe a couple of unexpected pathogens may have helped hasten the soldiers' demise."
  ],
  "neutral": {
    "headline": "Scientists Investigate Potential Pathogens That Contributed to Napoleon’s Army Defeat in Russia",
    "body_html": "<p>Researchers are examining evidence that suggests unexpected pathogens may have played a role in the high mortality rate of Napoleon's army during their retreat from Russia. The study, based on DNA extracted from teeth found at battle sites and grave markers dating back to 1812, indicates these microorganisms could be responsible for some deaths.</p>"
  },
  "conservative": {
    "headline": "New Study Suggests Pathogens May Have Contributed to Napoleon's Army Defeat in Russia",
    "body_html": "<p>A new study suggests that unexpected pathogens may have contributed significantly to the high mortality rate of Napoleon’s army during their retreat from Russia. Researchers, using DNA extracted from teeth found at battle sites and grave markers dating back to 1812, believe these microorganisms could be responsible for some deaths.</p>"
  },
  "liberal": {
    "headline": "Revealing the Hidden Culprits: How Pathogens May Have Led To Napoleon's Army Defeat in Russia",
    "body_html": "<p>In a groundbreaking study, researchers have uncovered evidence suggesting that unexpected pathogens may have played an underappreciated role in the high mortality rate of Napoleon’s army during their retreat from Russia. By analyzing DNA extracted from teeth found at battle sites and grave markers dating back to 1812, scientists believe these microorganisms could be responsible for some deaths.</p>"
  }
}