{
  "id": "1761414040515-will-lucy-powells-win-turn-things-around-for-labour",
  "category": "center",
  "source": {
    "url": "https://www.bbc.com/news/articles/cly9g1vnjqjo?at_medium=RSS&at_campaign=rss",
    "title": "Will Lucy Powell's win turn things around for Labour?",
    "published_at": "Sat, 25 Oct 2025 13:54:47 GMT"
  },
  "facts": [
    "Lucy Powell became the deputy leader of the Labour Party.",
    "She was previously sacked from the cabinet by Prime Minister Boris Johnson a month earlier.",
    "The contest for Deputy Leader took place outside the Labour Party's headquarters in south London.",
    "Bridget Phillipson, who had been seen as closer to the prime minister and part of his government resigned before this election.",
    "After her victory, it was announced that she would not be returning to a position within the cabinet but remains influential.",
    "The deputy leader contest followed significant political turmoil for Labour in recent weeks including various controversies involving senior figures such as Angela Rayner and Lord Mandelson.",
    "Lucy Powell's victory was seen by some media outlets with skepticism, but she has expressed her intention to provide private feedback rather than public disloyalty."
  ],
  "neutral": {
    "headline": "Labour Party Elects Lucy Powell as Deputy Leader",
    "body_html": "<p>Lucy Powell was elected deputy leader of the Labour Party, marking her return to a senior role within the party after being sacked from Boris Johnson's cabinet. The contest took place outside London’senew headquarters and saw Phillipson resign beforehand.</p>"
  },
  "conservative": {
    "headline": "Labour Party Stabilizes with Powell as Deputy Leader",
    "body_html": "<p>Lucy Powell has been elected deputy leader of the Labour Party, signaling a return to stability for the party after recent controversies. Her victory comes despite her previous sacking from Boris Johnson's cabinet and Phillipson's resignation.</p>"
  },
  "liberal": {
    "headline": "Labour Moves Forward with Powell as Deputy Leader",
    "body_html": "<p>Lucy Powell has been elected deputy leader of the Labour Party, showing a progressive step forward for the party amidst recent challenges. Her victory follows her sacking from Boris Johnson's cabinet and Phillipson resigning beforehand.</p>"
  }
}