{
  "title": "A Telescope in the Desert Reached Back a Billion Years and Uncovered Something Incredible - Yahoo News Canada",
  "link": "https://www.popularmechanics.com/space/deep-space/a69082728/universe-signal-epoch-of-reionization/",
  "image": "https://s.yimg.com/ny/api/res/1.2/qXo2Y4zI2LGkwE4rlehmlw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU7Y2Y9d2VicA--/https://media.zenfs.com/en/popular_mechanics_642/82b06fcae170cc3c2fd6c75a6aa9a96d",
  "source": "Popular Mechanics",
  "category": "science",
  "pubDate": "2025-10-24T13:00:00Z",
  "api": "NewsAPI",
  "full_text": "Searching for clues in the Epoch of Reionization, scientists discovered that the universe was quite a bit warmer before the ignition of the first stars.\n\nHere’s what you’ll learn when you read this story:\n\nEveryone is familiar with our universe’s explosive beginnings—things got really hot and really dense until there was a Big Bang. However, the sequel to this explosive preamble is decidedly different in tone. After the Big Bang, the universe rapidly cooled and expanded until finally—400,000 years later—protons and electrons merged to form hydrogen atoms.\n\nAs Live Science notes, what followed is known as the “cosmic dark age” when the universe was filled with this neutral hydrogen for about one billion years until the arrival of the first stars and galaxies. Once these primordial stars emitted UV light that stripped hydrogen atoms of their electrons, the cosmos entered the “Epoch of Reionization” and the universe began to resemble what we picture today. This is the universe’s toddler days, so to speak.\n\nHowever, unlike an obsessive parent documenting every milestone of their drooling progeny, astrophysicists don't have such a wealth of evidence—instead, they have to go looking for it. For example, we don’t really know what the conditions of the universe were when it began to transition from the “cosmic dark age.” While some theories suggest reionization developed from a “cold start,” a new study from an international team of scientists provides evidence the universe was actually heating up prior to this major milestone in the universe’s development. The results of the study were published in The Astrophysical Journal.\n\n“As the universe evolved, the gas between galaxies expands and cools, so we would expect it to be very, very cold,” Curtin University’s Cathryn Trott, lead author of the study, said in a press statement. \"Our measurements show that it is at least heated by a certain amount. Not by a lot, but it tells us that very cold reionization is ruled out.”\n\nGlimpsing something that far in the past isn’t easy, and Trott and her team utilized the Murchison Widefield Array telescope located in Western Australia to facilitate the challenging observation. Operating at 70–300 MHz, the telescope is purpose-built to detect that aforementioned neutral hydrogen emission from the “epoch of reionization.” Even so, the authors needed to perform a lot of subtraction in order to isolate what they were looking for from the cosmic noise of nearby stars, galaxies, and even Earth’s atmosphere.\n\nBecause the team was able to create this filtered data—as well as having the benefit of ten years worth of it—they could make a discovery by omission. If the universe was cold at this time, it would emit a certain kind of signal, but the researchers found no evidence of it, suggesting that at least some warming was going on. The theory is that x-rays from early black holes and stellar remnants drove this heating around 800 million years after the Big Bang. They haven’t found the tell-tale signal of that heating yet, but the researchers say that it’s likely only a matter of time.\n\n“All these existing techniques will help us find what’s missing,” Curtin University’s Ridhima Nunhokee, a co-author of the study, said in a press statement. “The signal is definitely buried in there. It's just improving on our data, and getting more data, cleaner data, to reach it.”\n\nGet the Issue\n\nGet the Issue\n\nGet the Issue\n\nGet the Issue\n\nGet the Issue\n\nGet the Issue\n\nGet the Issue\n\nGet the Issue\n\nGet the Issue\n\nGet the Issue\n\nGet the Issue\n\nGet the Issue\n\nGet the Issue\n\nGet the Issue\n\nDarren lives in Portland, has a cat, and writes/edits about sci-fi and how our world works. You can find his previous stuff at Gizmodo and Paste if you look hard enough.\n\nSpaceX’s Satellites Are Falling From the Sky\n\nEngineers Built a Stronger Cosmic Concrete\n\nA Telescope Spotted a Sign From the Early Universe\n\n‘Super-Telescope' Finds Smallest Dark Matter Clump\n\nThere Might Be a Black Hole Inside This Star\n\nIf Aliens Exist, Why Haven’t We Heard From Them?\n\nInterstellar Comet Might Be 7 Billion Years Old\n\nPop Mech Explains the Universe\n\nExperts Say Time Travel Is Possible at Warp Speed\n\nThe Best Star Projectors Turn Your Ceiling Into a Night Sky\n\n25 Space Gifts That Are Out of This World\n\nA Scientist Says This Object May Be an Alien Craft\n\nA Part of Hearst Digital Media\n\nWe may earn commission from links on this page, but we only recommend products we back.\n\n©2025 Hearst Magazine Media, Inc. All Rights Reserved.",
  "images": [
    "https://hips.hearstapps.com/hmg-prod/images/origin-star-royalty-free-image-1718122827.jpg?crop=1.00xw:0.502xh;0,0.237xh&resize=300:*",
    "https://hips.hearstapps.com/hmg-prod/images/pmxan525cov-lo-68cb0b682f7db.jpg?crop=1xw:1xh;center,top&resize=640:*",
    "https://hips.hearstapps.com/hmg-prod/images/amelia-cover-66a9416e2b7f1.jpg?crop=1xw:1xh;center,top&resize=640:*",
    "https://hips.hearstapps.com/hmg-prod/images/pmxan323cov-lo-646f6064440aa.jpg?crop=1xw:1xh;center,top&resize=640:*",
    "https://hips.hearstapps.com/hmg-prod/images/pmxan123cov-lo-1674156737.jpg?crop=1xw:1xh;center,top&resize=640:*"
  ]
}