{
  "title": "Alaska Airlines says recent performance 'is not acceptable,' rebooking passengers",
  "link": "https://komonews.com/news/local/alaska-airlines-seattle-tacoma-international-airport-rebooking-passengers-49000-it-failure-seatac-operations-400-flights-itinerary-system-stability-meal-vouchers",
  "image": "https://komonews.com/resources/media/a53e3c48-87a1-49f2-8952-46b104a49116-large16x9_AlaskaAirlinesHorizonflightFileKATUimage.jpeg",
  "source": "KOMO",
  "category": "business",
  "pubDate": "2025-10-24T23:20:49Z",
  "api": "GNews",
  "full_text": "Now\n\n49\n\nSat\n\n54\n\nSun\n\n50\n\nAn atmospheric river is moving through western Washington and expected to dump 1-3 inches of rain and bring mountain snow to the region.\n\nChris Daniels,KOMONewsSeniorReporter\n\nTOPICS:\n\nSEATTLE — Alaska Airlines acknowledges its recent performance is not acceptable, in the wake of the second massive IT failure in three months.\n\nLate Friday, the carrier reported that 400 flights had now been cancelled due to the failure, which began on Thursday and lasted for 8 hours.\n\nAll flights were grounded. Alaska says 49,000 passengers were impacted.\n\nRELATED: Alaska Airlines IT outage causes nationwide flight ground stop\n\n“We know our guests put their trust in us when they choose to fly with Alaska, and this level of performance is not acceptable,\" said the statement that was not attributed to anyone from the airline and was posted on the company’s website. \"And while safety is our most critical responsibility, the reliability of our operations is an essential expectation of our guests. Following a similar disruption earlier this year, we took action to harden our systems, but this failure underscores the work that remains to be done to ensure system stability. We are immediately bringing in outside technical experts to diagnose our entire IT infrastructure to ensure we are as resilient as we need to be.”\n\nPassengers reported being stuck in lines at SeaTac or on phone queues for hours waiting to be rebooked.\n\n“They've always been, like, amazing and super responsive, but I think because their tech was down, they were really unable to make a lot of changes on their back end too. I feel like everybody was kind of just like at a standstill,” said Bridgette Klakring of Sitka, Alaska. She was attempting to get on a flight on Friday after a flight to her cousin’s wedding was abruptly cancelled. Klakring instead spent the night at a hotel room in Seattle, provided by Alaska, and was attempting to get back to Sitka.\n\n“I'd already waited in the airport for like six hours. The lines were really long and crazy, and so I just got a hotel, and there was an 11-hour wait just to get a phone call back. I canceled my whole itinerary and rebooked it myself,” she said.\n\nDaniela Orozco was making her way back from a work trip in Omaha, which included a connection at SeaTac.\n\n“When we flew into Seattle, we landed, and then the pilot told us, Hey, there are issues. There's nowhere to park. You're gonna have to wait, be patient,” she said. “We get off, and they're like fiasco! Flights are canceled. Everybody's panicking, trying to collect luggage,” said Orozco, who was trying to get back to Fresno. She said she waited hours to get rebooked and was issued a free hotel stay. She was back at the airport on Friday, hoping to find a flight back to the Central Valley, but was also prepared to rent a car.\n\n“I'm prepared for that drive as well. Thirteen hours! Here I come!” said Orozco.\n\nAlaska said it was offering free flight changes, hotel rooms, ground transportation, and meal vouchers for rerouted passengers, noting it would take a while to also redirect planes and flight crews to get back to normal.",
  "images": [
    "https://komonews.com/resources/assets/komo/images/brand-icons/KOMO-160.png"
  ]
}