{
  "title": "Austin Butler In Early Talks To Play Sonny Crockett In ‘Miami Vice’ Movie At Universal - Deadline",
  "link": "http://deadline.com/2025/10/austin-butler-sonny-crockett-miami-vice-movie-1236596196/",
  "image": "https://deadline.com/wp-content/uploads/2025/10/Austin-Butler-and-Don-Johnson.jpg?w=1024",
  "source": "Deadline",
  "category": "entertainment",
  "pubDate": "2025-10-24T17:00:00Z",
  "api": "NewsAPI",
  "full_text": "By Justin Kroll\n\nFilm Editor\n\nAfter Deadline broke the news that Michael B. Jordan was in line for the Ricardo Tubbs role in Universal‘s Miami Vice movie being directed by Joseph Kosinksi, the studio now looks to have zeroed in on his partner. Deadline is hearing Austin Butler is in early talks to star as iconic TV detective James “Sonny” Crockett, the character made famous by Don Johnson in Michael Mann’s 1980s TV series.\n\nSources say it is still early days and no deals are done, but after scheduling was worked out for the  film to shoot later in 2026, Butler is engaging and interested. As for Jordan, his deal to play Tubbs is also early days.\n\nDan Gilroy penned the most recent draft. Eric Warren Singer penned the first draft. Dylan Clark and Kosinski are producing.\n\nUniversal had no comment.\n\nThe film is dated for August 6, 2027, and this incarnation will explore the glamour and corruption of mid-1980s Miami, inspired by the pilot episode and first season of the NBC series that would influence the pop culture from fashion to filmmaking.\n\nMiami Vice is based on characters created by Anthony Yerkovich from the series executive produced by Yerkovich and Mann.The show rocketed Johnson to pin-up-star status in the role of white-suit-wearing Sonny Crockett, while Philip Michael Thomas played his partner Tubbs.\n\nIf a deal is able to close, add the part to another high-profile role for Butler following his Oscar-nominated work in Elvis, followed by films like Dune: Part Two and most recently Caught Stealing.\n\nWe will let you know more as this unfolds.\n\nGet our Breaking News Alerts and Keep your inbox happy.\n\nComments On Deadline Hollywood are monitored. So don't go off topic, don't impersonate anyone, and don't get your facts wrong.\n\nComment\n\nName\n\nEmail\n\nWebsite\n\nΔ\n\nIf this is really set in the 80s it will be epic!  Imagine they cross paths with Tony Montana!\n\nPlease make this a “Die Hard” Christmas movie. Put a Christmas wreath in the background of one or two scenes and a line about “It’s always bikini/beach weather in Miami”.  Kosinski could be the next James Cameron. Give him a release date worthy of Cameron.\n\nYes, Miami is hot, Austin Butler is hot, Joseph Kosinski is hot, now Release this in Winter!\n\nThey should cast Don Johnson’s oldest son Jesse. He is his Dad’s twin and a good actor.\n\nDon’t do it!\n\nWe need a Miami Vice TV show! Not another movie!\n\nSignup for Breaking News Alerts & Newsletters\n\nBy providing your information, you agree to our Terms of Use and our Privacy Policy.\n\t\t\t\tWe use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply.\n\nGet our latest storiesin the feed of your favorite networks\n\nWe want to hear from you! Send us a tip using our annonymous form.\n\nSign up for our breaking news alerts\n\nBy providing your information, you agree to our Terms of Use and our Privacy Policy.\n\t\t\t\tWe use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply.\n\nDeadline is a part of Penske Media Corporation. © 2025 Deadline Hollywood, LLC. All Rights Reserved.\n\nBy providing your information, you agree to our Terms of Use and our Privacy Policy.\n\t\t\t\tWe use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply.",
  "images": [
    "https://deadline.com/wp-content/uploads/2025/10/Austin-Butler-and-Don-Johnson.jpg?w=681&h=383&crop=1",
    "https://deadline.com/wp-content/themes/pmc-deadline-2019/assets/public/lazyload-fallback.jpg",
    "https://deadline.com/wp-content/themes/pmc-deadline-2019/assets/public/lazyload-fallback.jpg",
    "https://deadline.com/wp-content/themes/pmc-deadline-2019/assets/public/lazyload-fallback.jpg",
    "https://deadline.com/wp-content/themes/pmc-deadline-2019/assets/public/lazyload-fallback.jpg"
  ]
}