{
  "title": "Betelgeuse’s Newfound Sidekick Is Weirder Than We Thought - Gizmodo",
  "link": "https://gizmodo.com/betelgeuses-newfound-sidekick-is-weirder-than-we-thought-2000676681",
  "image": "https://gizmodo.com/app/uploads/2025/10/betelgeuse-chandra-betelbuddy-image-1200x675.jpg",
  "source": "Gizmodo.com",
  "category": "science",
  "pubDate": "2025-10-24T16:06:19Z",
  "api": "NewsAPI",
  "full_text": "Reading time: Reading time 3 minutes\n\nA couple months back, astronomers officially confirmed the existence of “Betelbuddy,” Betelgeuse’s long-suspected companion star. Since then, researchers have been toiling away at characterizing Betelbuddy—finding that with each observation, the star drifts further away from initial expectations.\n\nA recent study published in The Astrophysical Journal presents a thorough analysis of Betelbuddy using data gathered by NASA’s Chandra X-ray Observatory and the Hubble Space Telescope. In the “deepest X-ray observations of Betelgeuse to date,” researchers found that Betelbuddy is most likely a young stellar object (YSO) about the size of our Sun.\n\nThis affirms a separate, earlier study that predicted Betelbuddy’s striking youth compared to Betelgeuse, a red supergiant nearing the end of its stellar lifespan. At the same time, the findings usurp several assumptions astronomers have made about the nature of Betelbuddy’s stellar composition.\n\nThe project was a “race against time,” the researchers describe in a statement, as it managed to catch Betelbuddy in the nick of time before it disappeared behind its companion for the next two years.\n\nThe Gemini North Telescope in Hawaii captured a faint image of Betelbuddy, which in itself was a miraculous feat, as the “brightness difference between Betelgeuse and this little companion is absolutely insane,” explained Anna O’Grady, study lead author and a postdoctoral researcher at Carnegie Mellon University, in the statement.\n\nTo put this into perspective, Betelgeuse is about 700 times the size of our Sun and thousands of times brighter. So, the team considered other methods for probing the tiny star: X-ray imaging and UV spectroscopy. That Chandra and Hubble accepted their proposals to view the same event testifies to the astrophysical community’s excitement about Betelbuddy, the researcher said.\n\n“It turns out that there had never been a good observation where Betelbuddy wasn’t behind Betelgeuse,” O’Grady said. “The fact that we can now confirm something is there shows how far our science has come.”\n\nOnce the data supported Betelbuddy’s existence, astronomers began to consider what kind of star it could have been. The most “standard” explanation would be that, given its small size and Betelgeuse’s age, Betelbuddy was a compact neutron star or white dwarf.\n\n“And those are very, very different objects,” O’Grady said. “If it was one of those objects, it would point to a very different evolutionary history for the system.”\n\nAs the universe would have it, Betelbuddy was neither, she added. The little companion showed no evidence of accretion, a “hallmark” of neutron stars or white dwarfs. The X-ray data strongly favors Betelbuddy as a young stellar object. As of now, it is difficult to “place strong constraints on its mass,” the paper noted, although the new findings are still consistent with the mass range predicted by the team that directly imaged Betelbuddy in July.\n\nThe bottom line is that Betelbuddy is a lot smaller than Betelgeuse. This strongly challenges the conventional idea that binary star pairs generally resemble each other in mass. If the observations hold, Betelgeuse is somewhere between 15 and 18 times the mass of Betelbuddy—a “staggering” ratio, the researchers said.\n\n“This opens up a new regime of extreme mass ratio binaries,” O’Grady added, meaning it signals the presence of an entirely new class of binary stars with wildly disparate masses. “It’s an area that hasn’t been explored much because it’s so difficult to find them or to even identify them like we were able to do with Betelgeuse.”\n\nAs the researchers say, Betelbuddy won’t likely appear within detection range for another two years. But when the little star makes its comeback in November 2027, astronomers will be ready to learn more.\n\nExplore more on these topics\n\nShare this story\n\nSubscribe and interact with our community, get up to date with our customised Newsletters and much more.\n\nFor decades, astronomers have been vying to identify a source for a mysterious gamma-ray excess at the center of the Milky Way. Could dark matter be the answer?\n\nFor 50 years, astronomers have been searching for evidence of winds emanating from the black hole Sagittarius A*. Now, they finally think they have an answer.\n\nAstronomers didn't think these kinds of stars still existed—until now.\n\nThe finding suggests phosphine—a potential biosignature—shouldn’t be viewed as evidence of alien life until natural, non-biological sources are ruled out.\n\nAstronomers saw past the blinding light of a quasar, only to find a supermassive black hole that's much smaller than theoretical predictions.\n\nBy studying the chemical composition of an odd, dying star, astronomers discovered that it had been feasting on what used to be an icy, Pluto-like object.\n\n©2025 GIZMODO USA LLC.\n\nAll rights reserved.",
  "images": [
    "https://gizmodo.com/app/uploads/2025/10/betelgeuse-chandra-betelbuddy-image.jpg",
    "https://gizmodo.com/app/uploads/2025/07/betelgeuse-companion-star-1280x800.jpg",
    "https://gizmodo.com/app/uploads/2025/09/Main-1920x1280-1.jpg",
    "https://gizmodo.com/app/uploads/2025/10/fermi-galactic-center-gamma-ray-excess-fermi-data-overlay-1280x853.jpg",
    "https://gizmodo.com/app/uploads/2025/10/Sagittarius-A-winds-1280x853.jpg"
  ]
}