{
  "title": "Blue Jays crush Dodgers for World Series Game 1 win",
  "link": "https://nypost.com/2025/10/24/sports/blue-jays-crush-dodgers-for-world-series-game-1-win/",
  "image": "https://nypost.com/wp-content/uploads/sites/2/2025/10/newspress-collage-y8trahc44-1761362608786.jpg?quality=75&strip=all&1761348229&w=1200",
  "source": "New York Post",
  "category": "general",
  "pubDate": "2025-10-25T06:09:06Z",
  "api": "GNews",
  "full_text": "TORONTO — Some kind of statement, eh?\n\nFor all the talk leading into the World Series about the Dodgers being on the verge of going back-to-back, strengthening their case for a dynasty and relying on their dominant rotation, the Blue Jays brought it to a screeching halt, at least for one glorious night north of the border.\n\nGame 1 entered the bottom of the sixth inning tied up and finished it a blowout, the Blue Jays doing to three Dodgers pitchers what they had done to many Yankees and Mariners before them on the road to the Fall Classic.\n\nFirst against Blake Snell and then two relievers, the relentless Blue Jays lineup sent 12 men to the plate and scored nine of them, nearly blowing the roof off Rogers Centre in the process on the way to a 11-4 win over the Dodgers.\n\n“We’re not easy outs, and [we] proved it,” said outfielder Nathan Lukes, who drew a key pinch-hit walk in the middle of the decisive rally.\n\nAddison Barger delivered the punishing blow, crushing the first pinch-hit grand slam in World Series history, a left-on-left blast off Anthony Banda that cracked open the game with a 9-2 lead.\n\nIn the first World Series game here in 32 years, the Blue Jays put on a show in front of a sellout crowd, proving that they were not just going to let the Dodgers skate to a second straight title.\n\n“I think, overall, we just played our game. We didn’t try to do anything more,” said Daulton Varsho, who tied the game 2-2 in the fourth inning with a two-run blast off Snell. “Honestly, we just showed everybody what we can do as a lineup. Just one of those games where you got to move on to tomorrow because they’re going to come at us pretty hard.”\n\nAcross the month of October — and really, for much of the regular season — the Blue Jays have cared little about the pedigree, salary or name of the starting pitcher on the mound against them. They have frustrated and flummoxed them all the same with their contact-oriented approach, the one that struck out at the lowest rate of any team during the season. Once the postseason began, they bludgeoned Max Fried and Carlos Rodón in the division series, then knocked around George Kirby, Luis Castillo and Logan Gilbert in the ALCS.\n\nSnell came into Friday having thrown three gems in these playoffs, combining to give up just two runs on six hits and strike out 28 across 21 innings. But the Blue Jays would not become his latest victim, even after squandering some early chances, tagging him for five runs on eight hits and three walks while striking out just four times across five-plus innings.\n\nVarsho plugged back in the electricity in the building with his game-tying homer — the first left-on-left home run Snell had given up this year — before exploding in the sixth.\n\nIt began when Bo Bichette — playing his first game since Sept. 6, when he sprained his left knee — drew a walk. Alejandro Kirk followed with a single through the right side and Varsho got drilled by a full-count fastball on Snell’s 100th and final pitch of the night.\n\nEmmet Sheehan entered from the bullpen and poured gasoline on the fire against the bottom of the Blue Jays lineup. Ernie Clement, who singled the Yankees to death in the ALDS, roped a single up the middle for the 3-2 lead. Lukes, who nearly retired while spending eight years in the minor leagues before making his big league debut in 2023, fell behind 0-2 before drawing a nine-pitch walk that made it 4-2. Andrés Giménez, in the lineup mostly for his glove, followed with a single of his own that extended the lead to 5-2.\n\nOne out later, Banda came on to face Barger, the left-handed hitter that Blue Jays manager John Schneider had sent up as a pinch hitter. Barger sent the crowd of 44,353 into a frenzy with his grand slam that broke the game open.\n\n“Just madness,” Barger said.\n\nKirk followed with a two-run shot to cap off the offensive onslaught, making it 11-2 and punctuating a strong night for the catcher, who went 3-for-3 with a walk.\n\nAfter rookie Trey Yesavage lasted just four innings (but limited the damage to only two runs), the Blue Jays bullpen delivered strong work to keep the Dodgers at bay, biding time until their own offense did its thing.\n\n“Every single team that I’ve faced that is like [our lineup] is just a pain in the ass,” Blue Jays right-hander Chris Bassitt said. “It’s not fun to face that team because your pitch count is going to get really high really fast. And then it’s almost like you’re in a big trap where I try to do too much to get Strike 3 and then I end up walking the guy. It’s not fun, because if it’s in the strike zone, usually we’re going to hit it.”\n\nAdvertisement",
  "images": [
    "https://nypost.com/wp-content/uploads/sites/2/2023/02/button_3_bg-2.png?w=206",
    "https://nypost.com/wp-content/uploads/sites/2/2025/10/AP_World_Series_Baseball_93478-c16d8-0.jpg?w=1024",
    "https://nypost.com/wp-content/uploads/sites/2/2025/10/AP_NLCS_Dodgers_Brewers_Baseball_27779-75687-0-1.jpg?quality=75&strip=all&w=171&h=114&crop=1",
    "https://nypost.com/wp-content/uploads/sites/2/2025/10/newspress-collage-tw88btkpc-1761375775931.jpg?quality=75&strip=all&1761361438&w=171&h=114&crop=1",
    "https://nypost.com/wp-content/uploads/sites/2/2025/10/newspress-collage-9p4ouu2gd-1761368554505.jpg?quality=75&strip=all&1761354203&w=171&h=114&crop=1"
  ]
}