{
  "title": "‘Chainsaw Man' Soaring to Surprise No. 1 Finish",
  "link": "https://www.hollywoodreporter.com/movies/movie-news/chainsaw-man-movie-box-office-surprise-win-1236409559/",
  "image": "https://www.hollywoodreporter.com/wp-content/uploads/2025/10/CSMM_Rez_E210A-H-2025.jpg?w=1296&h=730&crop=1",
  "source": "The Hollywood Reporter",
  "category": "entertainment",
  "pubDate": "2025-10-25T01:44:18Z",
  "api": "GNews",
  "full_text": "Subscribe for full access to The Hollywood Reporter\n\nSubscribe for full access to The Hollywood Reporter\n\n'Chainsaw Man — The Movie: Reze Arc' is another major victory for Japanese anime, while 'Regretting You' is edging out 'Black Phone 2' and 'Deliver Me From Nowhere: Springsteen' in a surprise twist.\n\nBy \n\n\tPamela McClintock\n\nSenior Film Writer\n\nJapanese anime feature Chainsaw Man – The Movie: Reze Arc is off to an impressive start at the U.S. box office, where it topped Friday’s chart with $8.5 million from 3,003 theaters. The acclaimed manga pic — now on course to open to a better-than-expected $15 million to $17 million — boasts a 96 percent critics score and a 99 percent audience score on Rotten Tomatoes, a rarely seen combo, in addition to an A CinemaScore.\n\nFriday’s earnings include a stellar $3.4 million in Thursday previews.\n\nSince launching in cinemas last month in Japan, Chainsaw Man — The Movie has already grossed north of $64 million at the global box office. Sony and Crunchyroll are handling the movie domestically and in select overseas markets. Produced by the team at MAPPA, the R-rated pic is based on the hit manga-turned-anime TV series that is available to stream in the U.S. on Disney+, Crunchyroll and other platforms.\n\nChainsaw Man follows the adventures of Denji (Kikunosuke Toya), a teenager and demon hunter who is killed by his overlords, the yakuza. But when his beloved chainsaw-powered, devil-dog Pochita (Shiori Izawa) makes a deal and sacrifices himself, Benji is reborn with the ability to transform parts of his body into chainsaws. Along with violence, the pic doubles as a teenage romance with the arrival of the mysterious Reze. However, Reze is not quite who she seems, and a series of battles ensues that could destroy Tokyo when their love story takes a twisted turn.\n\nDirected by Tatsuya Yoshihara, the film is based on Tatsuki Fujimoto’s original story, with a screenplay by Hiroshi Seko. “It’s safe to say that manga and anime fans won’t be disappointed, even if they’ll inevitably be nitpicking about one narrative aspect or another,” writes THR in its review.\n\nHeading into its U.S. opening, Chainsaw Man was expected to battle Blumhouse and Universal’s holdover hit Black Phone 2 for No. 1 with a debut in the $11 million to $12 million range. But it quickly pulled ahead of the pack thanks to males, who made up 75 percent of all ticket buyers, and younger moviegoers, with more than 50 percent of ticket buyers under the age of 25. It’s also drawing an ethnically diverse audience, including over-indexing among Asian moviegoers (17 percent), according to PostTrak.\n\nIn second surprise twist, Regretting You — the second Colleen Hoover book adaptation to hit the big screen after 2024’s box office blockbuster It Ends With Us — pulled ahead of Black Phone 2 and Disney’s new bio-drama Deliver Me From Nowhere: Springsteen to come in second on Friday with a better-than-expected $5.2 million from 3,593 locations for an estimated opening of $13 million (rival studios aren’t sure it will actually hit that mark).\n\nMany expected Regretting You to be dinged by generally withering reviews, but the female-fueled pic is garnering strong exits on PosTrak and boasts an audience score of 90 percent on Rotten Tomatoes (its CinemaScore, however, was only a B). It’s also clearly benefiting from a glut of male-skewing fare that has dominated the marquee for months, and is also a testament to Hoover’s enduring popularity among younger women and teenagers. (She’s one of many who have been caught up in the ongoing legal battle between It Ends With Us director/producer Justin Baldoni and actress/producer Blake Lively). Females made up nearly 85 percent of Friday’s audience, while 73 percent of all ticket buyers were under the age of 35.\n\nThe new film is described as a romantic drama that speaks to the aspirational theme of living life fully and with no regrets. Constantin Films produced and financed the movie, with Paramount acquiring domestic and certain overseas rights. Internationally, the film opens this week in 40 markets, including the U.K., Australia, Brazil and Mexico.\n\nInstead of holding Thursday previews, Paramount hosted a special Regretting You fan event at AMC Lincoln Square in New York City, which was streamed live into 500 theaters across the country. The screening of the pic was accompanied by a Q&A with director Josh Boone and cast members Allison Williams, Dave Franco and Mason Thames.\n\nSaturday will determine whether Regretting You can hold its lead over Blumhouse and Universal’s holdover hit Black Phone 2, which earned $3.8 million on Friday and is projecting a debut in the $12 million-plus range. The pic is holding in remarkably well for a horror title, and should continue to take advantage of being the only major studio horror film opening nationwide over the Halloween corridor this year.\n\nDisney’s bio-drama Springsteen: Deliver Me from Nowhere is now expected to come in fourth with $9 million to $10 million after earning $3.5 million on Friday, including $850,000 in Thursday previews. The movie is skewing notably older, which is no surprise. More than 60 percent of ticket buyers on Friday were 45 and older, including 40 percent over the age of 55.  Its Rotten Tomatoes critics score presently rests at 66 percent; the RT audience score is far stronger at 83 percent. And it earned a B+ CinemaScore.\n\nSpringsteen, playing in a total of 3,460 cinemas, should see a boost from 250 IMAX runs and an additional 750 in other premium large-format auditoriums. The music-infused pic stars Jeremy Allen White in the titular role, and he is credited in THR‘s review for giving a “raw and internalized performance as The Boss.” Jeremy Strong, Stephen Graham and Odessa Young also star in director Scott Cooper’s examination of a brutal comedown after a blockbuster tour, which yielded the prolific musician’s most personal album.\n\nIt remains to be seen how much of an impact the first two games of this year’s World Series — which pits the Los Angeles Dodgers against the Toronto Blue Jays — have on the weekend box office. Generally speaking, NFL games pose far more competition. At the same time, L.A. is the largest moviegoing market alongside New York City (it is also the biggest market for anime). Friday night’s opening game of the World Series, as well as Saturday’s, are both in Toronto.\n\nAt the specialty box office, Neon is launching Shelby Oaks in 1,823 locations. Marking YouTube movie critic Chris Stuckmann‘s debut feature, the found-footage pic is eyeing an opening in the $2 million to $2.5 million range. So far, its main claim to fame is that it raised $1.4 million via a Kickstarter campaign, the highest amount ever for a horror title, per the crowd-sourcing platform. Neon later provided some additional funds.\n\nFocus Features’ awards contender Bugonia is also making headlines in its limited debut at the specialty box office, and is on course to post an opening per-location average of $32,765 from 17 cinemas, one of the best platform starts of the year to date (it will also be the top location average of the weekend by a long shot). Directed by Yorgos Lanthimos, the acclaimed film stars Emma Stone and Jesse Plemons.\n\nOct. 25, 9:30 a.m.: Updated with Friday grosses.\n\nThis story was originally published Oct. 24 at 6:43 p.m.\n\nSign up for THR news straight to your inbox every day\n\nSubscribe for full access to The Hollywood Reporter\n\nSign up for THR news straight to your inbox every day\n\nSend us a tip using our anonymous form.",
  "images": [
    "https://www.hollywoodreporter.com/wp-content/uploads/2025/10/CSMM_Rez_E210A-H-2025.jpg?w=1296&h=730&crop=1",
    "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg"
  ]
}