{
  "title": "Company recalls 2 million pounds of barbecue pork jerky that may contain metal wire",
  "link": "https://abcnews.go.com/Health/wireStory/company-recalls-2-million-pounds-barbecue-pork-jerky-126850183",
  "image": "https://i.abcnewsfe.com/a/ebc570f6-952e-4ef9-b4da-33248d3ab524/wirestory_464e5845123c61308d0850feb78452f0_16x9.jpg?w=1600",
  "source": "ABC News - Breaking News, Latest News and Videos",
  "category": "business",
  "pubDate": "2025-10-24T23:48:12Z",
  "api": "GNews",
  "full_text": "More than 2.2 million pounds of Korean barbecue pork jerky has been recalled over contamination with pieces of metal\n\nA South Dakota company is recalling more than 2.2 million pounds (998,000 kilograms) of Korean barbecue pork jerky sold at Costco and Sam's Club stores because the product may be contaminated with pieces of metal, federal health officials said Friday.\n\nLSI, Inc., of Alpena, voluntarily pulled the product after customers complained about finding pieces of wiry metal in the jerky, according to the U.S. Agriculture Department. Company officials said the metal came from a conveyor belt used in production. No confirmed injuries have been reported,\n\nThe recall includes 14.-5-ounce (410-gram) and 16-ounce (450-gram) plastic pouches of meat jerky labeled “Golden Island fire-grilled pork jerky Korean barbecue recipe.” Roughly four dozen lots of jerky are affected. The products have a one-year shelf life with best-by dates ranging from Oct. 23, 2025, to Sept. 23, 2026. The packages contain the establishment number M279A inside the USDA mark of inspection.\n\nPeople shouldn't eat the recalled jerky and should throw it away or return it to stores for refund.\n\nContamination with rocks, sticks, insects and other foreign objects occasionally occurs in food produced in the U.S. Consumers who find foreign materials in food should notify manufacturers, food safety experts said.\n\n___\n\nThe Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute’s Department of Science Education and the Robert Wood Johnson Foundation. The AP is solely responsible for all content.\n\n24/7 coverage of breaking news and live events",
  "images": [
    "https://i.abcnewsfe.com/a/ebc570f6-952e-4ef9-b4da-33248d3ab524/wirestory_464e5845123c61308d0850feb78452f0_16x9.jpg?w=992",
    "https://i.abcnewsfe.com/a/e032ba6a-15d9-4f26-877b-97e50a87d86f/trump-hegseth-pay_1761363110868_hpMain_square.jpg?w=208",
    "https://i.abcnewsfe.com/a/7c24e2bd-686b-4d28-8882-f9fb302c36c7/rubio-02-gty-jef-251024_1761307019830_hpMain_square.jpg?w=208",
    "https://i.abcnewsfe.com/a/827b3076-1c52-4c12-8200-325cff96b919/tennessee-explosion-aerial-ht-jt-251010_1760112898674_hpMain_square.jpg?w=208",
    "https://i.abcnewsfe.com/a/e032ba6a-15d9-4f26-877b-97e50a87d86f/trump-hegseth-pay_1761363110868_hpMain_square.jpg?w=208"
  ]
}