{
  "title": "Ex-EMU players refused to aid betting probe - ESPN",
  "link": "https://www.espn.com/mens-college-basketball/story/_/id/46710725/ex-eastern-michigan-players-refused-participate-betting-probe",
  "image": "https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2017%2F1108%2Fr286154_1296x729_16%2D9.jpg",
  "source": "ESPN",
  "category": "sports",
  "pubDate": "2025-10-24T17:10:00Z",
  "api": "NewsAPI",
  "full_text": "Three former men's basketball players at Eastern Michigan refused to participate in an investigation into potential sports betting infractions involving multiple Eagles games from the 2024-25 season, the NCAA announced Friday.\n\nJalin Billingsley, Da'Sean Nelson and Jalen Terry, who are no longer with the program, had their phones imaged Jan. 29, as part of an NCAA investigation triggered by suspicious betting on Eastern Michigan's game Jan. 14 against Central Michigan, according to the findings released Friday. The players declined to be interviewed and later notified the NCAA through legal counsel that they would not participate in the investigation and asked that the phone imaging be destroyed, according to the release.\n\nRefusing to participate in investigations is an NCAA violation and can result in the permanent loss of eligibility. The three players do not have any eligibility remaining.\n\nThe NCAA said that, due to the lack of cooperation, the enforcement staff was unable to determine whether sports betting violations occurred.\n\n\"When individuals choose not to cooperate -- particularly when cases involve potential integrity issues -- those choices can and will be met with serious consequences including prohibitions on athletically related activities, the loss of eligibility and/or being publicly named in an infractions decision,\" the Division I Committee on Infractions said in the release.\n\nBillingsley, Nelson and Terry could not be reached for comment Friday.\n\nSportsbooks detected suspicious betting on the first halves of three Eastern Michigan games last season: vs. Wright State, Dec. 21; at Toledo, Jan. 7, and at Central Michigan, Jan. 14. In each instance, sportsbooks saw unusual betting interest against Eastern Michigan in the first half. The Eagles trailed at the end of the first half in each game.\n\nTerry led the team in scoring last season, averaging 16.6 points per game, while Nelson put up 16.1 points per game and was the Eagles' leading rebounder. Nelson and Terry played together at DePaul before transferring to Eastern Michigan. Nelson signed with Swiss champions Fribourg Olympic in July.\n\nThe NCAA is investigating 13 athletes at six schools for alleged gambling violations, including the three former Eastern Michigan players.",
  "images": [
    "https://a1.espncdn.com/combiner/i?img=%2Fredesign%2Fassets%2Fimg%2Ficons%2FESPN%2Dicon%2Dbasketball.png&w=80&h=80&scale=crop&cquality=40&location=origin",
    "https://a.espncdn.com/combiner/i?img=/i/columnists/purdum_david_m.jpg&h=80&w=80&scale=crop",
    "https://a.espncdn.com/combiner/i?img=/i/content-reactions/check.png&h=80&w=80"
  ]
}