{
  "title": "Ford rallies to 52-week high: Wall Street is optimistic about its EV reset and aluminum plant recovery plan - Sherwood News",
  "link": "https://sherwood.news/business/ford-rallies-to-52-week-high-wall-street-is-optimistic-about-its-ev-reset/",
  "image": "https://sherwoodnews.imgix.net/mwphzyq69oso/en-US/assets/files/2213605331_production-09-may-2025-north-rhine-westphalia-cologne-a-logo-stands-in-front-of-the-ford.jpg?auto=compress%2Cformat&cs=srgb",
  "source": "Sherwood.news",
  "category": "business",
  "pubDate": "2025-10-24T15:27:46Z",
  "api": "NewsAPI",
  "full_text": "Ford shares reached their highest level since July 2024 in Friday morning trading.\n\nOn the first trading session since Ford reported its third-quarter earnings, the automaker is on pace for its best day in the stock market since January 2022.\n\nFord shares are up about 10% on Friday morning, with investors pouring into the company as it tackles EV losses and fallout from a devastating fire that slammed a major aluminum supplier.\n\nThe results are even more notable considering Ford already had one of its best days of the year earlier this week, closing up more than 4% on Tuesday in sympathy with Detroit rival GM, which surged on a big profit guidance hike.\n\nInvestors’ optimism seems to have less to do with Ford’s current performance — the automaker lowered the top range of its full-year EBIT forecast by $1 billion — and more to do with the steps it’s taking to clean things up.\n\nFord lost $1.4 billion on EVs on the quarter, the unit’s deepest loss since 2023. That result came in spite of a sales surge as customers raced to qualify for the expiring $7,500 EV tax credit. On the company’s earnings call Thursday, CEO Jim Farley said he believes EV adoption will be about 5% of the US market, below the 7.5% S&P Global cited earlier this month. But Ford says it has a solution.\n\nThe company is “prioritizing hybrids across our lineup, including the development of extended range hybrid options,” said Farley, who also highlighted Ford’s new production platform, which it says will produce cheaper electric vehicles (including a $30,000 EV truck in 2027). According to Farley, this plan is “right around the corner” and sourcing is 95% complete.\n\nOn Thursday, Ford said it’s going to keep production of its F-150 Lightning paused, focusing instead on gas and hybrid trucks. That move, however, has less to do with its broader EV shift and more to do with aluminum, as electric vehicles use more of the metal.\n\nFord is being more intentional about aluminum usage following the damaging fire at Novelis’ Oswego aluminum plant, which reportedly supplied 40% of the US auto industry’s aluminum sheet. It’s another roadblock Wall Street seems to think Ford is successfully navigating.\n\nThe plant fire will ding Ford’s fourth-quarter earnings by between $1.5 billion and $2 billion, the company said. But per Ford CFO Sherry House, the automaker has “line of sight to mitigate at least $1 billion in 2026” and is working to find further ways to reduce the impact.\n\nThe fire will hinder Ford’s production ability by about 90,000 to 100,000 units in Q4, the company said. By adding third shifts and new jobs, however, Ford says it can “make up” roughly half of those losses next year.\n\n“Our underlying performance has us on track to raise our full year 2025 EBIT guidance if it weren’t for the impact of the Novelis fire,” Farley said.\n\nShares of American Airlines are climbing toward the carrier’s best trading day since August 12, when ultra-budget rival Spirit issued its initial warning about its ability to survive. American’s shares are up more than 7% on Friday afternoon.\n\nInvestors’ optimism comes a day after American posted a better-than-expected full-year earnings forecast. In a call with investors, American said that it’s ramping up its premium cabin offerings.\n\n“Our ability to grow capacity in premium markets will be further supported as we take delivery of new aircraft and reconfigure our existing fleet. These efforts will allow us to grow our premium seats at nearly two times the rate of main cabin seats,” CEO Robert Isom said. American CFO Devin May said that nose-to-tail retrofits of certain wide-body jets will bump the number of premium seats available on those planes by 25%.\n\nExtra legroom has been a boon for major carriers, particularly this quarter. Delta Air Lines said its premium product revenue grew 9% in Q3, compared to a 4% drop in economy seat revenue. Similarly, United Airlines said its premium revenue grew 6%, outpacing economy. Shares of both airlines were up more than 3% on Friday.\n\nCarriers with less exposure to first- and business-class tickets like Southwest Airlines and JetBlue didn’t see the same amount of momentum on the day.\n\nThe “Dungeons & Dragons” maker raised its outlook after a 42% surge in tabletop and digital gaming sales.\n\nThe automaker announced a host of tech initiatives at its GM Forward event on Wednesday morning.\n\nCoverage of GLP-1s is among the drivers for rising premiums.\n\nShares of Warner Bros. Discovery are trading up on Wednesday as a bidding war for the HBO and CNN parent company heats up.\n\nAccording to CNBC, WBD has now rejected three Paramount Skydance offers. The latest was said to be for close to $24 per share (about a 15% premium from the stock’s level as of Wednesday morning and nearly double where it was trading before reports of a potential takeover surfaced in September) with 80% in cash. Yesterday afternoon, Reuters reported that WBD’s board rejected the $24 offer on Tuesday.\n\nWBD, which said on Tuesday it was open to a sale and that there are multiple interested parties, climbed on the latest update. The stock was up more than 4% after the market opened before its gains narrowed.\n\nAccording to reports, Paramount remains the most interested potential buyer, but Comcast, Amazon, and Netflix are also circling.\n\nOn Netflix’s earnings call after the bell Tuesday, the streamer’s co-CEO, Ted Sarandos, reiterated that the company has “no interest in owning legacy media networks.” Still, industry experts have speculated that a sale of WBD’s streaming and film studios business — which it previously intended to spin off — could be on the table, leaving Netflix in the hunt.\n\nWBD, which said on Tuesday it was open to a sale and that there are multiple interested parties, climbed on the latest update. The stock was up more than 4% after the market opened before its gains narrowed.\n\nAccording to reports, Paramount remains the most interested potential buyer, but Comcast, Amazon, and Netflix are also circling.\n\nOn Netflix’s earnings call after the bell Tuesday, the streamer’s co-CEO, Ted Sarandos, reiterated that the company has “no interest in owning legacy media networks.” Still, industry experts have speculated that a sale of WBD’s streaming and film studios business — which it previously intended to spin off — could be on the table, leaving Netflix in the hunt.",
  "images": [
    "https://sherwoodnews.imgix.net/mwphzyq69oso/en-US/assets/files/2213605331_production-09-may-2025-north-rhine-westphalia-cologne-a-logo-stands-in-front-of-the-ford.jpg?auto=compress%2Cformat&cs=srgb&fit=max&w=3840"
  ]
}