{
  "title": "Fossils reveal dinosaurs were thriving in North America just before being wiped out by asteroid strike, study shows - CBS News",
  "link": "https://www.cbsnews.com/news/fossils-new-mexico-dinosaurs-thriving-before-asteroid-strike-study/",
  "image": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/10/24/3a5ec6fd-a65d-41fd-ae7d-0a05d0285922/thumbnail/1200x630g7/dd78b8d72001adfd6c8c21fe596d0477/ap25296566550499.jpg",
  "source": "CBS News",
  "category": "science",
  "pubDate": "2025-10-24T12:23:00Z",
  "api": "NewsAPI",
  "full_text": "Watch CBS News\n\nUpdated on:  October 24, 2025 / 8:23 AM EDT\n            / CBS/AP\n\nScientists have long debated whether dinosaurs were in decline before an asteroid smacked the Earth 66 million years ago, causing mass extinction.\n\nNew research suggests dinosaur populations were still thriving in North America before the asteroid strike, but it's only one piece of the global picture, independent experts say.\n\n\"Dinosaurs were quite diverse and now we know there were quite distinct communities\" roaming around before being abruptly wiped out, said Daniel Peppe, a study co-author and paleontologist at Baylor University.\n\nThe latest evidence comes from analyzing a portion of the Kirtland Formation in northern New Mexico that's been known for around 100 years to contain several interesting dinosaur fossils.\n\nScientists now say those fossils and the surrounding rocks date from around 400,000 years before the asteroid struck, which is considered a short interval in geologic time. The age was determined by analyzing small particles of volcanic glass within sandstone and by studying the direction of magnetic minerals within the mudstone of the rock formation.\n\nThe results show \"the animals deposited here must have been living close to the end of the Cretaceous,\" the last dinosaur era, said Peppe.\n\nThe findings were published Thursday in the journal Science.\n\nDifferences between the dinosaur species found in New Mexico and those found at a site in Montana that were previously dated to the same time frame \"run counter to the idea that dinosaurs were in decline,\" Peppe said.\n\nThe fossils previously found at the New Mexico site include Tyrannosaurus rex and a Triceratops-like horned herbivore.\n\nThe biggest dinosaur examined in the study was the plant-eating Alamosaurus, which could weigh more than 30 tons and measure about 100 feet long.\n\n\"Nothing illustrates how dinosaurs were thriving up to the very end more than the fact that Alamosaurus, one of the biggest dinosaurs ever - in fact, one of the very biggest animals to ever live on land in the entire history of the Earth - was there to witness the asteroid,\" University of Edinburgh paleontologist and study co-author Steve Brusatte told the Reuters news agency.\n\n\"So not only were sauropods still around when the asteroid hit, they were still thriving, still sublime, still colossal, still glorious,\" Brusatte told Reuters. \"I can imagine the scene: one minute, a jet plane-sized dinosaur was shaking the ground as it walked, the next minute the whole Earth was shaking with the energy unleashed by the asteroid.\"\n\nA research team in 2019 found that the steroid strike ignited a chaotic day of fires, earthquakes, and tsunamis, which led to a prolonged period of global cooling.\n\nScientists who weren't involved in the study cautioned that evidence found at a single location might not point to a broader trend.\n\n\"This new evidence about these very late-surviving dinosaurs in New Mexico is very exciting,\" said University of Bristol paleontologist Mike Benton, who was not involved in the study. But he added, \"This is just one location, not a representation of the complexity of dinosaur faunas at the time all over North America or all over the world.\"\n\nAlthough scientists have found dinosaur fossils on every continent, accurately dating them can be a challenge, said paleontologist and study co-author Andrew Flynn of New Mexico State University. Easily datable material, such as carbon, doesn't survive in fossils, so scientists must look for surrounding rocks with precise characteristics that can be used to determine ages.\n\nFurther research might help complete the picture of what range of dinosaur species was alive globally on the eve of the asteroid crash, said Flynn.\n\n© 2025 CBS Interactive Inc. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed. The Associated Press contributed to this report.\n\n(02:42)\n\nCopyright ©2025 CBS Interactive Inc. All rights reserved.",
  "images": [
    "https://assets2.cbsnewsstatic.com/hub/i/r/2025/10/24/3a5ec6fd-a65d-41fd-ae7d-0a05d0285922/thumbnail/620x413g7/edac0a3896a43a672100293abe645305/ap25296566550499.jpg#"
  ]
}