{
  "title": "Giants, Daboll, Skattebo all fined over Dart exam - ESPN",
  "link": "https://www.espn.com/nfl/story/_/id/46710612/315k-fines-handed-giants-protocol-violations",
  "image": "https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2025%2F0923%2Fr1549845_1296x729_16%2D9.jpg",
  "source": "ESPN",
  "category": "sports",
  "pubDate": "2025-10-24T17:03:00Z",
  "api": "NewsAPI",
  "full_text": "Pat McAfee discusses the NFL's fines against the Giants, coach Brian Daboll and Cam Skattebo for violating concussion protocol. (2:16)\n\nThe New York Giants, coach Brian Daboll and running back Cam Skattebo have all been fined stemming from violations of the concussion protocol surrounding an evaluation of rookie quarterback Jaxson Dart during their Week 6 game, the NFL and NFL Players Association announced Friday.\n\nThe Giants were assessed a $200,000 fine for violating the protocol, while Daboll was fined $100,000 and Skattebo $15,000 for conduct detrimental to the league.\n\nDuring the Oct. 9 game against the Philadelphia Eagles, Dart grabbed at his head on the ground after taking a hit on a third-quarter sack. After Dart was taken to the blue medical tent to be evaluated for a concussion, Daboll approached the tent and poked his head in. Skattebo also went into the tent.\n\nDaboll was later seen talking in an animated fashion to the team physician, Dr. Scott Rodeo, on the sideline while awaiting word on whether Dart would be cleared to return to the game. The coach said he wanted to find out \"if [Dart] was OK\" and decide whether to call timeout and potentially go for it on fourth down, if he was available.\n\nThe league and players' union said in a joint statement that Daboll and Skattebo entering the tent created a \"perception that they were interfering with Dart's exam.\" Even though they concluded neither actually had an impact on the exam, \"their conduct was inconsistent with and demonstrated a disregard for the concussion protocol's requirements and therefore constituted a violation,\" the statement said.\n\nThe league and union added that the Giants have taken steps to avoid any similar violations in the future.\n\n\"I don't really have any comments on it. Just glad Jaxson's healthy. That's it,\" Skattebo said. \"Like I said, no comment. They took action, and it's over with.\"\n\nThe NFL said two weeks ago that it had opened an investigation into the application of the concussion protocol. The league and NFLPA reviewed relevant reports and video and jointly interviewed members of the club's medical staff, independent medical providers, coaches and players.\n\nThe two parties concluded that the Giants' medical staff and unaffiliated medical providers properly followed all the concussion protocol steps required under the collective bargaining agreement.\n\nDaboll said after the game that he had apologized to the team's doctor and addressed his actions further a day later.\n\n\"I'll say this, like I said last night, I went in, didn't actually go in, just stuck my head in to see how our quarterback was doing. Just asked him, 'How you doing?'\" Daboll said Oct. 10. \"In no way would I want a player to come back out there that wasn't ready to play. I think I have great respect for that process.\"\n\nESPN's Jordan Raanan and The Associated Press contributed to this report.",
  "images": [
    "https://a.espncdn.com/combiner/i?img=/i/teamlogos/leagues/500/nfl.png&w=80&h=80&transparent=true",
    "https://a.espncdn.com/combiner/i?img=/i/content-reactions/check.png&h=80&w=80",
    "https://a.espncdn.com/combiner/i?img=/photo/2025/0926/r1551374_1296x1296_1-1.jpg&w=130&h=130&scale=crop&location=center",
    "https://a.espncdn.com/combiner/i?img=/photo/2025/1023/r1564828_1296x1296_1-1.jpg&w=130&h=130&scale=crop&location=center",
    "https://a.espncdn.com/combiner/i?img=/photo/2025/1022/nfl_nfc-east_1296x1296.jpg&w=130&h=130&scale=crop&location=center"
  ]
}