{
  "title": "How a tiny bug spiraled into a massive outage that took down the internet",
  "link": "https://www.cnn.com/2025/10/25/tech/aws-outage-cause",
  "image": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2166701641.jpg?c=16x9&q=w_800,c_fill",
  "source": "CNN",
  "category": "business",
  "pubDate": "2025-10-25T07:00:01Z",
  "api": "GNews",
  "full_text": "Markets\n\nHot Stocks\n\nFear & Greed Index\n\nLatest Market News\n\nHot Stocks\n\nA massive AWS outage Monday that brought down some of the world’s most popular apps and services all started with a glitch.\n\nThe bug – which occurred when two automated systems were trying to update the same data simultaneously – snowballed into something significantly more serious that Amazon’s engineers scrambled to fix, the company said Thursday in a postmortem assessment.\n\nThe massive cloud service’s outage meant people couldn’t order food, communicate with hospital networks, access mobile banking, or connect with their security systems and smart home devices. Major global companies, including Netflix, Starbucks and United Airlines, were temporarily unable to give customers access to their online services.\n\n“We apologize for the impact this event caused our customers,” Amazon said in a statement on the AWS website. “We know this event impacted many customers in significant ways. We will do everything we can to learn from this event and use it to improve our availability even further.”\n\nYou thought Monday’s internet outage was bad? Just wait\n\nAt a high level, the issue stemmed from two programs competing to write the same DNS entry – essentially a record in the internet’s phonebook – at the same time, which resulted in an empty entry. That threw multiple AWS services into disarray.\n\n“The analogy of a telephone book is pretty apt in that the folks on the other line are there, but if you don’t know how to reach them, then you have a problem,” Angelique Medina, head of Cisco’s ThousandEyes Internet Intelligence network monitoring service, told CNN. “And that telephone book effectively went poof.”\n\nIndranil Gupta, a professor of electrical and computing engineering at the University of Illinois, used a classroom analogy to explain Amazon’s technical analysis in an email to CNN. Say two students, one who is a fast worker, the other who is a slower worker, are asked to collaborate on a shared notebook.\n\nThe slower student “pays attention in brief bursts, but their work may conflict or contradict the work of the faster student,” he wrote. At the same time, the quicker student may be “trying to constantly ‘fix’ things quickly” and delete the slower student’s work because it’s outdated.\n\n“The result… an empty page (or crossed out page) in the lab notebook, when the teacher comes and inspects it,” he wrote.\n\nThat “empty page” brought down AWS’ DynamoDB database, creating a cascading effect that impacted other AWS services like EC2, which offers virtual servers for developing and deploying apps, and Network Load Balancer, which manages demands across the network. When DynamoDB came back online, EC2 tried to bring all of its servers back online at once and couldn’t keep up.\n\nAmazon is making a number of changes to its systems following the outage, including fixing the “race condition scenario,” which caused the two systems to overwrite each others’ work in the first place, and adding an additional test suite for its EC2 service.\n\nOutages like Monday’s, while rare, are just a reality, Gupta said. But what matters is how such issues are addressed.\n\n“Large scale outages like this, they just happen. There’s nothing you can do to avoid it, just like (how) people get ill,” Gupta told CNN over the phone. “But I think how the company reacts to the outages and keeps customers informed is really, really key.”\n\nMost stock quote data provided by BATS. US market indices are shown in real time, except for the S&P 500 which is refreshed every two minutes. All times are ET. Factset: FactSet Research Systems Inc. All rights reserved. Chicago Mercantile: Certain market data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Dow Jones: The Dow Jones branded indices are proprietary to and are calculated, distributed and marketed by DJI Opco, a subsidiary of S&P Dow Jones Indices LLC and have been licensed for use to S&P Opco, LLC and CNN. Standard & Poor’s and S&P are registered trademarks of Standard & Poor’s Financial Services LLC and Dow Jones is a registered trademark of Dow Jones Trademark Holdings LLC. All content of the Dow Jones branded indices Copyright S&P Dow Jones Indices LLC and/or its affiliates. Fair value provided by IndexArb.com. Market holidays and trading hours provided by Copp Clark Limited.\n\n© 2025 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.  CNN Sans ™ & © 2016 Cable News Network.",
  "images": [
    "https://media.cnn.com/api/v1/images/stellar/prod/180930003019-david-goldman-byline.jpg?c=16x9&q=h_270,w_480,c_fill/c_thumb,g_face,w_50,h_50",
    "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2166701641.jpg?c=original&q=w_860,c_fill",
    "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2213966204.jpg?c=16x9&q=h_720,w_1280,c_fill/w_256"
  ]
}