{
  "title": "Indie shooter Escape From Duckov overtakes Battlefield 6 on Steam - Dexerto",
  "link": "https://www.dexerto.com/gaming/indie-shooter-escape-from-duckov-overtakes-battlefield-6-on-steam-3273511/",
  "image": "https://www.dexerto.com/cdn-image/wp-content/uploads/2025/10/24/Battlefield-6-Duckov.jpg",
  "source": "Dexerto",
  "category": "technology",
  "pubDate": "2025-10-24T16:36:51Z",
  "api": "NewsAPI",
  "full_text": "Escape From Duckov and Battlefield 6 couldn’t be more different. One’s a small indie chaos shooter, the other a AAA hit. Yet somehow, the underdog has come out on top.\n\nWhen Battlefield 6 launched, it drew a staggering 747,440 concurrent players on Steam. It was a massive success for the series and proof that the Battlefield name can still pull huge numbers.\n\nBut in just a few short weeks, Escape From Duckov has blown past expectations. Built by indie studio Team Soda, the game’s blend of fast extraction gameplay and absurd duck warfare has made it one of the most talked-about releases on PC. What started as a niche indie experiment has become a viral hit that’s drawing more players than Battlefield 6.\n\nAccording to SteamDB, Escape From Duckov recently hit 152,207 concurrent players, overtaking Battlefield 6’s 129,729 during the same period.\n\nThat’s a huge achievement for a small indie release to outperform one of the biggest shooters of the year, and shows how fast a breakout game can take off.\n\nNeither looks like they’re slowing down either, and while Battlefield 6’s peak player count still eclipses that of Duckov, both are proving extremely popular among players, despite the fact that the all-time peaks are worlds apart…for now.\n\nStill, the race isn’t over. Battlefield 6’s first season drops on October 28, and naturally, that likely means that the player count is expected to climb massively once again. Despite this, for now at least, Escape From Duckov holds the lead for most active players, proving once again the power of a popular Indie adventure.\n\nSign up to Dexerto for the latest news, views & reviews",
  "images": [
    "https://www.dexerto.com/cdn-image/wp-content/uploads/2025/02/11/call-of-duty-cod-homepage-icon.jpg?width=1200&quality=75&format=auto",
    "https://www.dexerto.com/cdn-image/wp-content/uploads/2025/02/11/Pokemon-homepage-icon.jpg?width=1200&quality=75&format=auto",
    "https://www.dexerto.com/cdn-image/wp-content/uploads/2025/02/11/overwatch-homepage-icon.jpg?width=1200&quality=75&format=auto",
    "https://www.dexerto.com/cdn-image/wp-content/uploads/2025/02/11/fortnite-homepage-icon.jpg?width=1200&quality=75&format=auto",
    "https://www.dexerto.com/cdn-image/wp-content/uploads/2025/02/11/destiny-2-homepage-icon.jpg?width=1200&quality=75&format=auto"
  ]
}