{
  "title": "‘IT: Welcome to Derry’ Creators Clear Up the Big “Misconception” About Pennywise - The Hollywood Reporter",
  "link": "http://www.hollywoodreporter.com/tv/tv-features/it-welcome-to-derry-pennywise-answer-1236408926/",
  "image": "https://www.hollywoodreporter.com/wp-content/uploads/2025/10/bill-skarsgard_0-H-2025.jpg?w=1296&h=730&crop=1",
  "source": "Hollywood Reporter",
  "category": "entertainment",
  "pubDate": "2025-10-24T14:15:24Z",
  "api": "NewsAPI",
  "full_text": "Subscribe for full access to The Hollywood Reporter\n\nSubscribe for full access to The Hollywood Reporter\n\nFilmmakers Andy Muschietti and Barbara Muschietti on expanding their hit 'IT' films into a new HBO series.\n\nBy \n\n\tJames Hibberd\n\nWriter-at-Large\n\nThe team behind HBO‘s IT: Welcome to Derry is clearing up a misconception about their killer clown, while also answering a few key questions about their IT movie franchise spinoff series ahead of the show’s season premiere on Sunday.\n\nFirst, here’s what you need to know about the show: Welcome to Derry is a prequel to the IT horror films set in the same cursed small Maine town, only back in 1962 — right in the middle of one of the previous “cycles” of violence caused by the shape-shifting killer clown Pennywise. The cast is all new, save for Bill Skarsgard as Pennywise. But filmmakers Andy Muschietti and Barbara Muschietti are back, along with writer Jason Fuchs, who serves as co-showrunner with Brad Caleb Kane.\n\nAlso, while you won’t see them until episode two, the show has what might be the best new series opening credits sequence you’ll see all year. “It took us months to do them, because Andy’s such a stickler and a perfectionist trying to get them to the right place,” Barbara Muschietti said of her brother and creative partner.\n\nBelow, the Argentine producer-directors (whose credits also include Mama and The Flash) discuss the new series (spoiler free) with The Hollywood Reporter ahead of this weekend’s debut.\n\nSpinning off movie properties to TV has had mixed results and doing horror in particular is considered a pretty tricky genre for serialized shows. So, when approaching this, what were you trying to avoid doing? What were the pitfalls?\n\nANDY MUSCHIETTI There was nothing to avoid. All the things that you said, we weren’t even aware of. We made two movies that worked, and our whole approach was to build a story with the same style and tone as the movies. We know that people reacted, emotionally, very well to what we did in the movies. So it was just replicating the tone and the style with this new story.\n\nBARBARA MUSCHIETTI We approached this the same [way] as [the] movies. We didn’t think about how to do it differently in TV. Also, the horror genre is very director-driven. So that was incredibly important. So Andy directed four episodes, and then we had the incredible collaborators.\n\nThere seemed to be a decision made with Pennywise that “less is more,” at least in the first five episodes I watched. I think people are going to be surprised that he’s not in his most famous form for a while, even though his presence is felt from the very first scene.\n\nANDY We did “less is more” for half the show, but then we did “more is more.” The idea behind the delayed appearance is the build up of expectation. The audience doesn’t know that they want it, but I think it creates a very special feeling. When and where the clown is going to appear was a game that I wanted to play with the audience.\n\nBARBARA Being a shape-shifter, Pennywise looms large. If you dissect the movies, Pennywise is not in the movies that much, but people feel It a lot when he is on camera. The last thing we want is to have an audience get comfortable with Pennywise. We don’t want anybody to get used to his image. He’s unpredictable. He strikes whenever he feels like it.\n\nANDY And normally, the misconception is that “It” can only be one thing, one creature at a time. But it’s part of the canon, even in the book, that he creates hallucinations. He creates collective creatures — like when he became the piranha, right? That’s a flock of creatures.\n\nYou had a lot of communication with Stephen King. He’s given the series a glowing review. Was there any specific change he wanted after reading the scripts?\n\nANDY Stephen didn’t approach the show like that. He wasn’t imposing any kind of guidelines on us. I think his desire was to let us play with his toys because from the beginning, we were clear to him. We said, “Your book is a mystery. It’s a puzzle and left unsolved intentionally. And we’re going to create a lot of stuff to bring those enigmas, and also to fill in the gaps in the puzzle. Eventually, this creates a story that’s not in the book. It’s a hidden story.\n\nBARBARA We wanted to do a show that basically went backwards, where each season was a cycle of Pennywise and he loved that concept and gave us all the rope we needed.\n\nFinally, without spoiling anything, the military plays a very large part in this story. It’s not just about kids being terrorized. It seems like quite a big swing because even though some enlisted military men play a role during this “Interlude” in King’s book, you’ve really expanded what’s going on there in some surprising ways.\n\nANDY We basically said, “OK, 1962. What’s the situation in America?” It’s the Cold War. The Cuban Missile Crisis is coming. The Derry base, as it said in the first episode, is the northernmost military base in the country. It makes a lot of sense that there was a lot of tension from that.\n\nMore to come from the Muschiettis following Sunday night’s premiere of IT: Welcome to Derry.\n\nSign up for THR news straight to your inbox every day\n\nInside the business of TV with breaking news, expert analysis and showrunner interviews\n\nSubscribe for full access to The Hollywood Reporter\n\nSend us a tip using our anonymous form.",
  "images": [
    "https://www.hollywoodreporter.com/wp-content/uploads/2025/10/bill-skarsgard_0-H-2025.jpg?w=1296&h=730&crop=1",
    "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg"
  ]
}