{
  "title": "Jets' Glenn refuses to disclose QB1 vs. Bengals - ESPN",
  "link": "https://www.espn.com/nfl/story/_/id/46710793/jets-glenn-declines-name-qb1-declares-wilson-gardner-out",
  "image": "https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2025%2F1024%2Fr1565271_1296x729_16%2D9.jpg",
  "source": "ESPN",
  "category": "sports",
  "pubDate": "2025-10-24T17:16:00Z",
  "api": "NewsAPI",
  "full_text": "Aaron Glenn says Tyrod Taylor is limited but refuses to answer any other questions about Jets' quarterback room. (0:42)\n\nNew York Jets coach Aaron Glenn declined to name a starting quarterback on Friday, shutting down all quarterback-related questions during a testy exchange with reporters.\n\nGlenn, still looking for his first win, won't say if it's incumbent Justin Fields or Tyrod Taylor because he believes withholding his choice will give the Jets a competitive advantage on Sunday against the Cincinnati Bengals.\n\n\"I can't tell you that,\" Glenn said tersely, when asked if he could reveal the starter.\n\nThe coach did say this much: Wide receiver Garrett Wilson (knee) and cornerback Sauce Gardner (concussion) were ruled out -- players with contracts worth a combined $250 million who won't make the trip.\n\nGlenn, who benched Fields at halftime last week, was leaning toward Taylor early in the week, sources said. Since then, Taylor has been limited in practice with a knee injury; he took a helmet to the knee last Sunday. He's listed as questionable for the game.\n\nThe first-year coach refused to say if the injury is a factor in his decision.\n\n\"That's exactly why I'm not telling you because I don't want to,\" Glenn said.\n\nPressed on the injury, Glenn bristled: \"That's exactly why I'm saying it, because I don't want to. I don't know how many times I have to answer that. It's not going to change.\"\n\nHe refused to say if the starter (whoever it is) received the normal number of practice reps. Initially, he refused to say if the team knows the identity of the starter, though he later suggested it does.\n\n\"We had a great week of practice with our guys,\" Glenn said. \"Our guys know, and we're going to keep that between us and that's how it's going to be.\"\n\nTaylor is among at least eight players listed as questionable, with Glenn saying, \"I really like the way these guys are trending\" -- an indication that Taylor should be fine. On Thursday, Taylor said he expects to be well enough to play, though he refused to comment on his potential role.\n\n\"Yes,\" he said. \"I'm listening to the trainers. I've been at practice. Me and Justin have split the reps. I'm still treating [the knee] as well.\"\n\nThe Jets (0-7), who have gone two games without a touchdown, are desperate for a spark. Owner Woody Johnson created unwanted sparks on Tuesday, publicly criticizing Fields. Glenn insisted that he will make the final call, that Johnson's opinion won't influence the final decision.\n\nExplaining his secrecy, Glenn recalled a game last season as the Detroit Lions' defensive coordinator. It was against the Green Bay Packers, and he said it was \"tough\" to prepare because coach Matt LaFleur refused to reveal his starter until late in the week. Love, returning from injury, got the nod over Malik Willis. The Lions won.\n\n\"We had to prepare for both of those guys, so I don't see why we think this [is] something that hasn't been done,\" Glenn said.\n\nMeanwhile, Wilson, their leading receiver, will miss his second straight. Gardner's absence could be huge, especially against the Bengals' dynamic receiving tandem, Ja'Marr Chase and Tee Higgins. Rookie cornerback Azareye'h Thomas will make his first career start, replacing Gardner.\n\n\"Any time you lose a player of that caliber, it's always concerned because he's one of the best in the league,\" Glenn said.",
  "images": [
    "https://a.espncdn.com/combiner/i?img=/i/teamlogos/leagues/500/nfl.png&w=80&h=80&transparent=true",
    "https://a.espncdn.com/combiner/i?img=/i/columnists/full/cimini_rich.png&h=80&w=80&scale=crop",
    "https://a.espncdn.com/combiner/i?img=/i/content-reactions/check.png&h=80&w=80",
    "https://a.espncdn.com/combiner/i?img=/photo/2025/1022/r1564276_1296x1296_1-1.jpg&w=130&h=130&scale=crop&location=center",
    "https://a.espncdn.com/combiner/i?img=/photo/2025/1023/r1564876_1296x1296_1-1.jpg&w=130&h=130&scale=crop&location=center"
  ]
}