{
  "title": "Join Us in Celebrating Leo Messi on Friday with a Special Prematch Presentation of the 2025 MLS Golden Boot presented by Audi - intermiamicf",
  "link": "https://www.intermiamicf.com/news/join-us-in-celebrating-leo-messi-on-friday-with-a-special-prematch-presentation-of-the-2025-mls-golden-boot-presented-by-audi",
  "image": "https://images.mlssoccer.com/image/private/t_editorial_landscape_3_4_desktop/mls-mia/hdonyeh91g7yxzjwrzx1.jpg",
  "source": "Intermiamicf.com",
  "category": "sports",
  "pubDate": "2025-10-24T15:51:19Z",
  "api": "NewsAPI",
  "full_text": "This Friday, Oct. 24, be part of a special night at Chase Stadium as Inter Miami CF plays the Club’s first playoff match of their Audi 2025 MLS Cup Playoffs campaign, hosting Nashville SC for Game 1 in the Round One Best-of-3 series between the sides. The match at Chase Stadium presented by Baptist Health is slated for 8 p.m. ET (8:25 p.m. ET kick off).\n\nPrior to kickoff, Inter Miami and Major League Soccer will celebrate Messi’s historic season, with Major League Soccer’s Commissioner, Don Garber, set to present him with the 2025 MLS Golden Boot presented by Audi. The ceremony will take place right before kickoff, so make sure to be in your seats early to celebrate our captain, who recently extended his contract through the 2028 MLS season!\n\nIn the lead-up to the special presentation, fans can join in and be part of the action! Just look up to the videoboard and scan the QR code with your cell phone to participate in a synchronized light show.\n\nDon’t miss out on the postseason opener at Chase Stadium and our special celebration for Leo! Secure your tickets HERE while supplies last.\n\nWith this accolade, Messi became the first Inter Miami player to win the prestigious honor since the Club’s inception in 2018. Messi finished the 2025 regular season with 29 goals in 28 appearances. Messi is the third player since 2005 to score at least 29 goals in a Golden Boot-winning season, joining Josef Martínez (31 in 2018) and Carlos Vela (34 in 2019), and his 1.03 goals-per-game average is second to only Vela’s 2019 campaign (1.10 goals per game) among Golden Boot winners since 2005. Twenty-eight of Messi’s 29 goals this season came away from the penalty spot, the most in a single season in league history by three goals.",
  "images": [
    "https://images.mlssoccer.com/image/upload/v1620747207/assets/mia/logos/mia_nanfgz.png",
    "https://images.mlssoccer.com/image/private/t_editorial_landscape_8_desktop_mobile/f_auto/mls-mia/hdonyeh91g7yxzjwrzx1.jpg",
    "https://www.intermiamicf.com/assets/images/share.png",
    "https://www.intermiamicf.com/assets/images/share.png",
    "https://images.mlssoccer.com/image/private/t_editorial_landscape_8_desktop_mobile/f_png/mls-mia/nn6vldwteepogzyf34mn.png"
  ]
}