{
  "title": "JPMorgan Disputes Order Forcing It to Pay Charlie Javice's Legal Bill",
  "link": "https://www.businessinsider.com/jpmorgan-forced-pay-charlie-javice-legal-bill-dispute-fraud-trial-2025-10",
  "image": "https://i.insider.com/68fc0b2e599d46a4ccc0d9a5?width=1200&format=jpeg",
  "source": "businessinsider.com",
  "category": "business",
  "pubDate": "2025-10-25T00:04:00Z",
  "api": "GNews",
  "full_text": "Every time Katherine publishes a story, you’ll get an alert straight to your inbox!\n\nEnter your email\n\nBy clicking “Sign up”, you agree to receive emails from Business Insider. In addition, you accept Insider’s\n                                          Terms of Service and\n                                          Privacy Policy.\n\nJPMorgan wants out of paying for Charlie Javice's legal bills.\n\nA clause in JPMorgan's contract with Javice, tied to the original sale of her startup, Frank, has kept the bank liable for her legal fees — even after Javice was convicted in March of conspiracy, wire, and bank fraud for tricking JPMorgan into purchasing the company for $175 million.\n\nWhile Javice continues to appeal the guilty verdict before reporting for her 7-year prison sentence, JPMorgan has been required to pay upward of $115 million in legal fees to Javice and her co-defendant, Olivier Amar. In a Friday filing, lawyers for JPMorgan asked the court to terminate their obligation to continue making payments.\n\n\"The legal fees sought by Charlie Javice and Olivier Amar are patently excessive and egregious,\" Pablo Rodriguez, a JPMorgan spokesperson, told Business Insider in a statement. \"We look forward to sharing details of this abuse with the court in coming weeks.\"\n\nLawyers representing Javice did not immediately respond to a request for comment from Business Insider.\n\nJPMorgan has advanced $60.1 million to Javice for her criminal defense, \"representing an unprecedented and shocking amount that has exceeded any semblance of reasonableness,\" the bank's lawyers argued.\n\nFurther, the filing reads that Javice has \"unreasonably\" hired five different law firms for her defense — including a single firm that JPMorgan says has received advanced fees and expenses totaling $35.6 million — \"even though five law firms working on a single case is necessarily overlapping, duplicative, and excessive.\"\n\nThe bank's lawyers argue JPMorgan will be irreparably injured unless the court puts a stop to the \"abusive billing\" practices in which Javice and her legal team have treated the advancement process like \"a blank check to bill and expense whatever they please.\"\n\nAmong Javice's high-powered legal team in her defense was Quinn Emanuel's Alex Spiro, who has represented clients such as Elon Musk and Kim Kardashian. Business Insider previously reported Spiro's hourly rate has nearly doubled over the last four years, as he now commands $3,000 per hour for his work.\n\nYour daily guide to what's moving markets — straight to your inbox.\n          \n            Sign up \n      chevron down icon\n      An icon in the shape of an angle pointing down.\n\nJump to",
  "images": []
}