{
  "title": "JPMorgan Chase wants out of paying $115M legal tab for convicted fraudsters",
  "link": "https://apnews.com/article/jpmorgan-chase-fraud-charlie-javice-olivier-amar-c62bbc17505ccb02884778a19924e84d",
  "image": "https://dims.apnews.com/dims4/default/136e924/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5c%2Fb8%2F210c7ca854ec6c1f8cf0a5ba811f%2F83b0186ffa4e416bac46533d1711013e",
  "source": "AP News",
  "category": "business",
  "pubDate": "2025-10-24T23:19:00Z",
  "api": "GNews",
  "full_text": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nCharlie Javice, center, exits Manhattan federal court, Monday, Sept. 29, 2025, in New York. (AP Photo/Yuki Iwamura, File)\n\nNEW YORK (AP) — For nearly three years, JPMorgan Chase has picking up the legal tab of Charlie Javice and Olivier Amar, the two convicted fraudsters who sold their financial aid startup Frank to the bank.\n\nBut the two have racked up an astronomical, nine-figure legal bill that far exceeds any reasonable amount the two may have needed for their defense, the bank said in a court filing late Friday. Chase shouldn’t have to pay and its agreement as part of the startup purchase to shoulder the costs should end, the bank argued.\n\nAccording to the filing, Javice’s team of lawyers across five law firms have billed JPMorgan approximately $60.1 million in legal fees and expenses, while Amar’s lawyers have billed the bank roughly $55.2 million in fees.\n\nIn total, the bank alleges Javice and Amar’s lawyers have racked up legal fees of $115 million, with one law firm receiving $35.6 million in reimbursements alone. In comparison, Elizabeth Holmes, who was convicted of defrauding investors in the Theranos case, reportedly ended up with a legal bill of roughly $30 million.\n\nThe bank would be “irreparably injured” if the court does not put an end to “abusive billing,” the bank said. Javice and her lawyers have treated the process “like a blank check,” Chase said.\n\nJavice, 33, was convicted in March of duping the banking giant when it bought her company, called Frank, in the summer of 2021. She made false records that made it seem like Frank had over 4 million customers when it had fewer than 300,000. Amar was convicted of the same charges.\n\nEarly in the case, a Delaware court ruled that the bank was required to advance Javice and Amar for any legal fees, which was part of the bank’s agreement when Frank was acquired in 2021.\n\nPart of Javice’s legal team is Alex Spiro of Quinn Emanuel, who is also the lawyer who has previously represented Elon Musk. Spiro did not immediately respond to an email request for comment.\n\nA law firm representing Amar did not immediately respond to a request for comment.\n\n“The legal fees sought by Charlie Javice and Olivier Amar are patently excessive and egregious. We look forward to sharing details of this abuse with the court in coming weeks,” said Pablo Rodriguez, a spokesman for the bank\n\nCopyright 2025 The Associated Press. All Rights Reserved.",
  "images": [
    "https://dims.apnews.com/dims4/default/94c503b/2147483647/strip/true/crop/640x236+0+0/resize/320x118!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc3%2F4c%2F65482a7b452db66043542c093eaf%2Fpromo-2x.png",
    "https://dims.apnews.com/dims4/default/94c503b/2147483647/strip/true/crop/640x236+0+0/resize/320x118!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc3%2F4c%2F65482a7b452db66043542c093eaf%2Fpromo-2x.png",
    "https://dims.apnews.com/dims4/default/4f4506e/2147483647/strip/true/crop/112x119+0+0/resize/112x119!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8c%2F0d%2F15433a314663a3ae8a349ee0d9fa%2Fveifora-comment-icon.png",
    "https://dims.apnews.com/dims4/default/bc1ddbf/2147483647/strip/true/crop/2851x1534+0+0/resize/240x129!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F22%2F25%2F9576fafb4e768552fed602a60238%2Fap-pri-wordmarktagline-rgb-dbg.png"
  ]
}