{
  "title": "Kevin Federline Says Sons Are 'Terrified' to See Mom Britney Spears After Recent Visits - TooFab",
  "link": "https://toofab.com/2025/10/24/kevin-federline-britney-spears-sons-visit/",
  "image": "https://images.toofab.com/image/ce/16by9/2025/10/24/cefd4577e290446f9ab23d3a62bea6fd_xl.jpg",
  "source": "TooFab",
  "category": "entertainment",
  "pubDate": "2025-10-24T14:45:00Z",
  "api": "NewsAPI",
  "full_text": "Kevin Federline claims his sons he shares with Britney Spears have stopped seeing her.\n\nWhile appearing on Piers Morgan's podcast Uncensored, the former backup dancer alleged there were a few recent instances that caused their 20-year-old son Sean Preston to forgo visiting his mother altogether.\n\n\"[Britney] saw one of my sons one day this year, and he decided not to go back over there because of what he saw,\" Federline told Morgan during Thursday's episode.\n\n\"The other one, Jayden, who's my younger son, is 19 now -- he's been over there quite a few times over the past year, and he's stopped seeing her in the last few months because of the situation,\" he added.\n\nFederline has been on a press tour for his memoir You Thought You Knew, which details his side of his life alongside the pop icon.\n\nAccording to Federline, Jayden and Sean are \"terrified\" and are \"worried about their mom.\"\n\nWhile Federline insists their sons do want to help, they \"don't know how to help because of what all of this has cost.\"\n\nWhen Morgan asked Federline what exactly the boys saw for them to want to stop seeing their mom, he stated that was not his \"story to tell.\"\n\n\"That's my sons' story to tell if they decide to. I mean, the things that they've seen are shocking, right?\" he alleged. \"So shocking that one of my sons came to me and called me and was like, 'I don't know what to do. I'm afraid Mom is going to die.'\"\n\nSince Federline began his press run and the book's release, his stories about Spears' alleged antics have made headlines around the world -- including his claims about her doing cocaine while breast-feeding, watching her sons sleep with a \"knife in her hand,\" and Preston allegedly claiming \"she had punched him in the face.\"\n\nFederline also wrote she showed up to his home once unannounced, with \"one boob hanging out of a ripped shirt,\" with a diaper for Jayden, \"who hadn't worn a diaper in over a year.\"\n\nSpears has hit back at Federline over the release of his book, with her rep telling TMZ, \"With news from Kevin’s book breaking, once again he and others are profiting off her and sadly it comes after child support has ended with Kevin. All she cares about are her kids, Sean Preston and Jayden James, and their well-being during this sensationalism. She detailed her journey in her memoir.\"\n\nSpears also posted a few lengthier statements about Federline to social media, including one saying that the \"constant gaslighting from ex-husband is extremely hurtful and exhausting.\"\n\n\"I have always pleaded and screamed to have a life with my boys. Relationships with teenage boys is complex. I have felt demoralized by this situation and have always asked and almost begged for them to be a part of my life,\" she continued. \"Sadly, they have always witnessed the lack of respect shown by own father for me. They need to take responsibility for themselves.\"\n\n\"With one son only seeing me for 45 min in the past 5 years and the other with only 4 visits in the past 5 years. I have pride too. From now on I will let them know when I am available,\" she added. \"Trust me, those white lies in that book, they are going straight to the bank and I am the only one who genuinely gets hurt here. I will always love them and if you really know me, you won't pay attention to the tabloids of my mental health and drinking. I am actually a pretty intelligent woman who has been trying to live a sacred and private life the past 5 years. I speak on this because I have had enough and any real woman would do the same.\"\n\nSee more of his book claims in the gallery below.",
  "images": [
    "https://images.toofab.com/image/ce/4by3/2025/10/24/cefd4577e290446f9ab23d3a62bea6fd_md.jpg",
    "https://images.toofab.com/image/05/5by4/2025/10/16/05c562970b9e43a18a965cc850e231d5_xs.jpg",
    "https://images.toofab.com/image/af/4by3/2025/10/16/afe81cf4b11e4350802efdfab98ee38b_md.jpg",
    "https://images.toofab.com/image/e7/2by3/2025/10/23/e74a48c24dcd41518929c2ca6e5309d9_xs.jpg",
    "https://images.toofab.com/image/0e/2by3/2025/10/24/0ec8ca869dcc4df2b88f32fe82fc10fe_xs.jpg"
  ]
}