{
  "title": "Listen to The Creepy 'Sounds' From A Black Hole, Captured by NASA - ScienceAlert",
  "link": "https://www.sciencealert.com/listen-to-the-creepy-sounds-from-a-black-hole-captured-by-nasa",
  "image": null,
  "source": "ScienceAlert",
  "category": "science",
  "pubDate": "2025-10-24T12:03:08Z",
  "api": "NewsAPI",
  "full_text": "NASA created a haunting audio clip of sound waves rippling out of a supermassive  black hole, located 250 million light-years away.\n\nThe black hole is at the center of the Perseus cluster of galaxies, and the acoustic waves coming from it have been transposed up 57 and 58 octaves so they're audible to human hearing.\n\nThe result, released by NASA in 2022, is a sort of unearthly (obviously) howling that, if we're honest, sounds not only spooky, but a little bit angry.\n\nListen to the sounds in the clip below:\n\nIt was the first time these sound waves had been extracted and made audible.\n\nSo what's going on here? We might not be able to hear sound in space, but that doesn't mean there isn't any.\n\nRelated: Sound of a Black Hole 'Kicked' Through Space Heard in a Stunning First\n\nIn 2003, astronomers detected something truly astonishing: acoustic waves propagating through the copious amounts of gas surrounding the supermassive black hole at the centre of the Perseus galaxy cluster, which is now renowned for its eerie wails.\n\nWe wouldn't be able to hear them at their current pitch. The waves include the lowest note in the Universe ever detected by humans – well below the limits of human hearing.\n\nBut this recent sonification has not only brought the recording up a whole lot of octaves, they've also added to the notes detected from the black hole, so we can get a sense of what they would sound like, ringing through intergalactic space.\n\nThe lowest note, the one identified back in 2003, is a B-flat, just over 57 octaves below middle C; at that pitch, its frequency is 10 million years. The lowest note detectable by humans has a frequency of one-twentieth of a second.\n\nThe sound waves were extracted radially, or outwards from the supermassive black hole at the center of the Perseus cluster, and played in an anti-clockwise direction from the center, so that we can hear the sounds in all directions from the supermassive black hole at pitches 144 quadrillion and 288 quadrillion times higher than their original frequency.\n\nThe result is an eerie one, like many of the waves recorded from space and transposed into audio frequencies.\n\nThe misconception that there is no sound in space originates because most space is a ~vacuum, providing no way for sound waves to travel. A galaxy cluster has so much gas that we've picked up actual sound. Here it's amplified, and mixed with other data, to hear a black hole! pic.twitter.com/RobcZs7F9e\n\nThe sounds aren't just a scientific curiosity, though. The tenuous gas and plasma that drifts between the galaxies in galaxy clusters – known as the intracluster medium – is denser and much, much hotter than the intergalactic medium outside galaxy clusters.\n\nSound waves propagating through the intracluster medium is one mechanism whereby the intracluster medium can be heated, as they transport energy through the plasma.\n\nBecause temperatures help regulate star formation, sound waves might therefore play a vital role in the evolution of galaxy clusters over long periods of time.\n\nThat heat is what allows us to detect the sound waves, too. Because the intracluster medium is so hot, it glows brightly in X-rays. The Chandra X-ray Observatory allowed not only for the detection of the sound waves initially, but for the sonification project.\n\nAnother famous supermassive black hole also got the sonification treatment. M87*, the first black hole ever to be directly imaged in a colossal effort by the Event Horizon Telescope collaboration, was also imaged by other instruments at the same time.\n\nThose include Chandra for X-rays, Hubble for visible light, and the Atacama Large Millimeter/submillimeter Array for radio wavelengths.\n\nThose images showed a colossal jet of material being launched from the space immediately outside the supermassive black hole, at speeds that appear faster than that of light in a vacuum (it's an illusion, but a cool one). And now, they too have been sonified.\n\nTo be clear, these data were not sound waves to start with, like the Perseus audio, but light in different frequencies. The radio data, at the lowest frequencies, have the lowest pitch in the sonification. Optical data hold the middle range, and X-rays are at the top.\n\nTurning visual data like these into sound can be a cool new way to experience cosmic phenomena, and the method has scientific value, too.\n\nSometimes, transforming a dataset can reveal hidden details, allowing for more detailed discoveries about the mysterious and vast Universe around us.\n\nA version of this article was first published in May 2022.",
  "images": [
    "https://www.sciencealert.com/images/2025/10/perseus_cluster-642x361.jpg",
    "https://img.youtube.com/vi/UdIM0BYxV60/0.jpg",
    "https://img.youtube.com/vi/jiideYPlOYY/0.jpg",
    "https://www.sciencealert.com/images/2025/10/Mid-Article-Promo-Astro-642x272.jpg"
  ]
}