{
  "title": "Luka Doncic sets Lakers record with 92 points in 1st 2 games",
  "link": "https://www.espn.com/nba/story/_/id/46717404/luka-doncic-sets-lakers-record-92-points-1st-2-games",
  "image": "https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2025%2F1025%2Fr1565594_1296x729_16%2D9.jpg",
  "source": "ESPN",
  "category": "general",
  "pubDate": "2025-10-25T07:10:00Z",
  "api": "GNews",
  "full_text": "Luka Doncic 49-point double-double leads Lakers past Wolves (1:57)\n\nLOS ANGELES -- After Luka Doncic scored 49 points in the Lakers' 128-110 win over the Timberwolves on Friday -- shattering Jerry West's 56-year franchise record of 81 points scored through the first two games of a season -- his teammate Austin Reaves was asked a question.\n\nCould Doncic, who has scored 92 points this season, average 40?\n\n\"Yes,\" Reaves told ESPN.\n\nCould Doncic average 40, and would it help the team win?\n\n\"Yes,\" Reaves continued. \"He's so good, it's weird.\"\n\nIt was uncanny to see the effectiveness of the Doncic-led Lakers offense in its second game of the season compared with Tuesday's 119-109 season-opening loss to the Golden State Warriors.\n\nThe Lakers shot better from the field, 59.2% compared with 54.5% on Tuesday, and were much better from 3, shooting 41.4% compared with 25%. They also committed fewer turnovers, 12 compared with 19.\n\nAnd Doncic was the constant, becoming the first player in Lakers history with consecutive 40-point games to start a season and just the fourth in NBA history, joining Anthony Davis, Michael Jordan and Wilt Chamberlain.\n\n\"I wish we won the first game, but obviously it's a good comeback,\" Doncic said after finishing 14-for-23 from the floor, including 5-for-12 from 3, and 16-for-19 from the free throw line. \"I think Minnesota is a great team. We had to do a lot to win today. But myself, I feel great. I want to win every game.\"\n\nDoncic added 11 rebounds and eight assists, joining Reaves (25 points, 11 assists, 7 rebounds) with a double-double. Rui Hachimura scored 23 points on 10-for-13 shooting, and Deandre Ayton had 15 points and eight rebounds.\n\n\"He, of course, dominates the whole game so easily,\" Hachimura said. \"And it's not some random team we played against. They're a Western Conference finals team. So this is crazy.\"\n\nAfter trailing by as many as 11 points in the first quarter, the Lakers cut the Timberwolves' lead to four heading into the second quarter as Doncic tied Kobe Bryant and Kyle Kuzma for the most first-quarter points in team history with 23.\n\nThe Lakers dominated the middle two quarters 72-54 against the Timberwolves, who eliminated them from the playoffs last season.\n\nDoncic said revenge didn't fuel the performance.\n\n\"I just want to forget about last season,\" Doncic said. \"I was trying to move on. I don't really think about that first-round series.\"\n\nThe team was thinking about its poor third-quarter showing against the Warriors, though, when Golden State outscored Los Angeles 35-25 to break the game open.\n\nOn Friday, a few Lakers players left the halftime locker room early to take warmup shots while the halftime show -- a hand-balancing acrobat, Christian, and his dog, Scooby -- was still finishing its act.\n\nAnd Los Angeles won the third 40-31.\n\n\"I think for the first time in Lakers history, the other team called the first timeout in the third quarter,\" Lakers coach JJ Redick said. \"Had a nice 'all right, all right' with the group. 'All right, group, we did it!'\"\n\nAs much as the third quarter was a cause for celebration for Redick, he had one nitpick of Doncic in the fourth.\n\nDuring a late timeout, with Los Angeles up by 23 points and 3:29 remaining, Redick chided Doncic for being stuck at 48 points.\n\n\"I'm trying to get the guy 50, and yeah, I'd already given him three chances,\" Redick said. \"I gave a fourth chance. He gets fouled, and then he blows that too.\"\n\nDoncic went 1-for-2 from the foul line with 3:05 remaining, bringing his total to 49 points, the most he has scored for the Lakers, and Redick subbed him out shortly thereafter.\n\nThe victory was Ayton's first with the Lakers, thanks in large part to the guy who tormented his Phoenix Suns team in the playoffs years ago.\n\n\"Just like the same way I see it when I'm on the other side -- shocked,\" Ayton said when asked what it was like to witness Doncic's night. \"Like, 'Oh my god, I can't believe he's doing this. When is he going to miss?' You know, things like that.\n\n\"I wanted him to get 50 tonight, though.\"",
  "images": [
    "https://a.espncdn.com/combiner/i?img=/i/teamlogos/leagues/500/nba.png&w=80&h=80&transparent=true",
    "https://a.espncdn.com/combiner/i?img=/i/columnists/full/mcmenamin_dave.png&h=80&w=80&scale=crop",
    "https://a.espncdn.com/combiner/i?img=/i/content-reactions/check.png&h=80&w=80",
    "https://a.espncdn.com/combiner/i?img=/photo/2025/1022/r1563918_1296x1296_1-1.jpg&w=130&h=130&scale=crop&location=center",
    "https://a.espncdn.com/combiner/i?img=/photo/2025/1023/r1564827_1296x1296_1-1.jpg&w=130&h=130&scale=crop&location=center"
  ]
}