{
  "title": "Miss USA 2024 Alma Cooper Bows Out of the 2025 Pageant at the Last Moment - Here's Why",
  "link": "https://www.justjared.com/2025/10/25/miss-usa-2024-alma-cooper-bows-out-of-the-2025-pageant-at-the-last-moment-heres-why/",
  "image": "https://cdn01.justjared.com/wp-content/uploads/headlines/2025/10/alma-cooper-social.jpg",
  "source": "Just Jared",
  "category": "entertainment",
  "pubDate": "2025-10-25T04:19:51Z",
  "api": "GNews",
  "full_text": "Camila Mendes & Rudy Mancuso Are Engaged, She Shows Off Her Engagement Ring at Glen Powell's Birthday Party!\n\nLily Allen Seemingly Accuses Ex-Husband David Harbour of Cheating, Gaslighting, Being a Sex Addict, & More on 'West End Girl' Album\n\n'Nobody Wants This' Season 2 Ending Spoilers: 4 Couples Break Up, But 1 Gets Back Together\n\nBilly Porter Reveals His New Boyfriend's Identity on Instagram!\n\nMiss USA 2024 Alma Cooper has made the surprising decision not to attend this year’s pageant—just hours before a new winner was set to be crowned.\n\nThe 23-year-old Stanford student and U.S. Army First Lieutenant announced her choice on Instagram on Friday (October 24), sharing that she will not be in Reno, Nevada for the Miss USA 2025 competition.\n\nKeep reading to find out more…\n\n“After much consideration, I’ve made the extremely difficult decision not to attend this year’s Miss USA pageant and crowning ceremony,” she wrote. “As I close this chapter, I do so with the knowledge that I finished what I started with integrity and my self-worth held high, just like the crown I was honored to wear.”\n\nA post shared by Alma Cooper (@alma.cooper)\n\nIn a longer statement shared with People, Alma reflected on becoming the first Afro-Latina woman to win Miss USA and balancing her reign with her Army duties.\n\n“For the past year, I have done my absolute best to honor the prestigious title while also serving as [First Lieutenant] Cooper in the U.S. Army,” she said, noting that she paused her postgraduate studies to perform her Army recruitment work and her Miss USA 2024 duties.\n\n“Despite the mental, physical and emotional load I was set to carry, like any other full-time job, I was confident that I could push myself to deliver the excellence, wit, poise and intelligence that the title required. I was ready and willing to wear the crown with pride.”\n\n“I worked up until the very last second to give my all because I believe that one’s character is not only built by challenges, but revealed,” read the statement.\n\nBefore the Miss USA preliminaries, on October 22, CEO and President Thom Brodeur shared through Instagram Stories that the organization had invited Alma to participate “in whatever capacity she was most comfortable,” adding, “We honor you, Alma. You are a queen. You are our queen even if we didn’t start this journey with you. And, you are forever our Miss USA 2024.”\n\nFor some additional background, it’s worth mentioning that the 2025 Miss Teen USA and Miss USA competitions are the first held under Brodeur‘s leadership.\n\nThe Miss USA and Miss Teen USA pageants have seen major changes in recent years, “most notably after the 2023 adult and junior winners, Miss USA Noelia Voigt and Miss Teen USA UmaSofia Srivastava, relinquished their titles,” per People.\n\nTheir shocking resignations made history as the first time a reigning titleholder had stepped down in the pageant’s 72 years. According to NBC News, which reviewed Noelia‘s resignation letter at the time, she claimed that Miss USA CEO Laylah Rose fostered a toxic work environment.\n\nLaylah denied the allegations in a statement to the Los Angeles Times.\n\nBrodeur was ultimately named her replacement by the Miss Universe organization.\n\nSpeaking on Noelia and UmaSofia‘s resignations, Brodeur told People in September that he wanted to “reform the pageant” in response to their complaints.\n\n“There was some pretty egregious NDA language that suppressed the voices of those two young women and did not give them the ability to speak about their journey. I want to remove that restriction,” the CEO said.",
  "images": [
    "https://cdn01.justjared.com/wp-content/uploads/headlines/2025/10/camila-rudy-engagement-rumors.jpg",
    "https://cdn01.justjared.com/wp-content/uploads/headlines/2025/10/lily-allen-on-divorce-in-new-album.jpg",
    "https://cdn01.justjared.com/wp-content/uploads/headlines/2025/10/nobody-wants-this-couples-break-up.jpg",
    "https://cdn01.justjared.com/wp-content/uploads/headlines/2025/10/billy-porter-hard-launches-his-new-relationship.jpg",
    "https://cdn01.justjared.com/wp-content/uploads/headlines/2025/10/alma-cooper.jpg"
  ]
}