{
  "title": "MLB World Series Game 1: Toronto Blue Jays beat LA Dodgers 11-4",
  "link": "https://www.bbc.com/sport/baseball/articles/cvgm74045mro",
  "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/26d6/live/98ad58d0-b151-11f0-aa13-0b0479f6f42a.jpg",
  "source": "BBC",
  "category": "general",
  "pubDate": "2025-10-25T05:03:19Z",
  "api": "GNews",
  "full_text": "Addison Barger made his MLB debut in 2024, but began 2025 in the minor leagues before writing his name in World Series history with his pinch-hit grand slam\n\nAddison Barger smashed the first grand slam by a pinch-hitter in World Series history as the Toronto Blue Jays blew away the Los Angeles Dodgers in the first game of the 'Fall Classic'.\n\nWith an expectant crowd packed into Toronto's Rogers Centre for the first World Series game in Canada since 1993, the Blue Jays scored nine runs in the bottom of the sixth inning as they romped to an 11-4 win.\n\nNot even a home run from Japanese superstar Shohei Ohtani could spare the defending champions' blushes as their American League opponents drew first blood in the best-of-seven series.\n\nThe Dodgers took an early lead as Enrique Hernandez drove in Teoscar Hernandez in the second inning, before Will Smith did the same for Mookie Betts in the third.\n\nBut Toronto's Daulton Varsho tied the game at 2-2 with a two-run homer to centre field in the bottom of the fourth.\n\nThe sixth-inning blowout came when Dodgers starting pitcher Blake Snell was taken out after hitting Varsho with a pitch to load the bases with no outs.\n\nErnie Clement singled off reliever Emmet Sheehan to give Toronto the lead for he first time, Sheehan walked in a run, and a line drive from Andres Gimenez made it 5-2.\n\nDodgers manager Dave Roberts then replaced Sheehan with Anthony Banda on the mound, but it backfired spectacularly as Barger's grand slam cleared the bases, before Alejandro Kirk added a two-run homer of his own to make it 11-2.\n\nOhtani served notice of his ability with a two-run shot in the seventh, but it was too little, too late for the National League champions .\n\nToronto had attempted to sign Ohtani, external before he moved across LA from the Angels to the Dodgers, but the home fans chanted \"We don't need him!\" as he came up to bat again in the ninth.\n\nGame two takes place on Saturday evening, also in Toronto, before the series switches to Los Angeles.\n\nDodgers v Blue Jays - five World Series talking points\n\nThe $500m slugger who is taking Canada to the World Series\n\nGame 1: Blue Jays 11-4 Dodgers\n\nGame 2 (in Toronto): Saturday, 25 October\n\nGame 3 (in LA): Monday, 27 October\n\nGame 4 (in LA): Tuesday, 28 October\n\nGame 5* (in LA): Wednesday, 29 October\n\nGame 6* (in Toronto): Friday, 31 October\n\nGame 7* (in Toronto): Saturday, 1 November\n\n*if required. Matches start 20:00 Eastern Time (early next morning UK time), Home team listed first\n\nShohei Ohtani, who joined the Dodgers on a $700m (£558m) contract in 2024, struck out in the first at-bat of the World Series. The game was effecively lost by the time he homered in the seventh inning\n\nCentre fielder Daulton Varsho hit the first home run of the 2025 World Series, and was then hit by a pitch to load the bases as the Blue Jays rallied in the bottom of the sixth inning\n\nThe ceremonial first pitch was thrown out by former Blue Jays manager Cito Gaston, who led them to back-to-back World Series titles in 1992 and 1993\n\nPremier League: Kerkez pulls one back for Liverpool at Brentford\n\nMan Utd claim third win in a row in six-goal thriller\n\nLionesses lose friendly against 10-player Brazil\n\nMark Bonnar can't trust anyone in this twist-filled thriller\n\nExplore Bruce Springsteen's remarkable life story\n\nThe drama continues in the ultimate game of deceit\n\nBeneath the surface of the scratch card's invention\n\nCan Bellingham make El Clasico statement with English sub-plot?\n\nWhy it's time for big-game Gordon to deliver in Premier League\n\nLeeds earn big win to heap more misery on West Ham. VideoLeeds earn big win to heap more misery on West Ham\n\nCan Arsenal's defence lead them to title glory?\n\n'I was celebrating Grand Final when I got England call-up'\n\nHarlequins beat Loughborough in 14-try thriller. VideoHarlequins beat Loughborough in 14-try thriller\n\nWeek of the wonderkids - who shone in Champions League?\n\nWeekly sports quiz: How many UCL goals has Rashford scored for Barca?\n\nKane can't stop scoring - is the Ballon d'Or within reach?\n\n'It can be living nightmare' - how UFC's Wood sought help for OCD\n\nWhy Messi's MLS legacy needs play-off triumph as he signs new deal\n\nDodgers v Blue Jays - five World Series talking points\n\n'Cleary's their general' - Morley's five Australia players to watch\n\nWhy rookies are shining in record start to NFL season\n\n'Being gay didn't feel normal, until I became a footballer'\n\nVote for your BBC Women's Footballer of the Year\n\nThe ultimate Ashes competitor - Broad on walking, Warner and that final wicket\n\nCopyright © 2025 BBC. The BBC is not responsible for the content of external sites. Read about our approach to external linking.",
  "images": [
    "https://ichef.bbci.co.uk/ace/standard/3840/cpsprodpb/abca/live/534164e0-b150-11f0-b1b8-b926ae2a9200.jpg",
    "https://ichef.bbci.co.uk/ace/standard/3840/cpsprodpb/b565/live/a042e770-b14e-11f0-8189-c58d79b20544.jpg",
    "https://ichef.bbci.co.uk/ace/standard/2560/cpsprodpb/4bee/live/c78713a0-b14a-11f0-a933-13cb73fc5e6a.jpg",
    "https://ichef.bbci.co.uk/ace/standard/3840/cpsprodpb/1af2/live/f0fb95b0-b138-11f0-b9fd-0922ae80984e.jpg",
    "https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/7334/live/6171b0e0-a5e5-11f0-b741-177e3e2c2fc7.jpg"
  ]
}