{
  "title": "Mother & Son Who Inspired Song Reunited",
  "link": "https://www.billboard.com/music/rb-hip-hop/2pac-brendas-got-a-baby-mother-son-reunited-1236097839/",
  "image": "https://www.billboard.com/wp-content/uploads/2025/10/2Pac-Brendas-Got-A-Baby-screenshot-billboard-1800.jpg?w=1024",
  "source": "Billboard",
  "category": "entertainment",
  "pubDate": "2025-10-25T00:36:25Z",
  "api": "GNews",
  "full_text": "Bestselling author Jeff Pearlman tells the wild story of how he was able to make the reunion happen.\n\nBy\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tAngel Diaz\n\n2Pac‘s classic song “Brenda’s Got a Baby” was inspired by a true story — and the story continues.\n\nThe rapper wrote the song addressing teen pregnancy in America’s ghettos while he was filming his star-turning role as Bishop in Juice after coming across a story in the news about a 12-year-old girl who threw her baby in a trash chute after being impregnated by her 21-year-old cousin. The track has since become one of the late entertainer’s most important records in his extensive catalog.\n\nEnter bestselling author Jeff Pearlman.\n\nSee latest videos, charts and news\n\nDuring a recent appearance on The Rich Eisen Show to promote his new book Only God Can Judge Me: The Many Lives of Tupac Shakur, Pearlman dropped a bombshell after being asked if he came across anybody that didn’t want to talk to him when he was trying to put the book together. “I didn’t get Dr. Dre or Snoop Dogg, but they’re hard to get anyway,” he said. “I did find most people. The vast majority. Classmates, people who worked with him in music, even Death Row employees were pretty open about talking.”\n\nHe then revealed that he “had a breakthrough very early on.”\n\nPearlman found the man who heard the baby crying in the trash chute and interviewed him, but it wasn’t until he spoke with Leila Steinberg, who the author referred to as a former associate manager/confidant. According to him, Steinberg made a comment about whether the story about the baby was true and wondered what eventually happened to the baby, which then sent him on a side mission to see what he could find.\n\nHe then reached out to genealogist Michele Soulli to see if she would be able to locate the baby. A few days later, she gave him the number to a Las Vegas resident named Davonn Hodge. They two met up, and Hodge told Pearlman that he found his relatives with the help of Ancestry.com and had a reunion but his mother wasn’t there. Pearlman again employed Soulli to help him find the mother and a few days later, she got in contact with a woman that was living in Newark, NJ.\n\nNow, this is where things get really weird.\n\nThe woman expressed shock and excitement and told Soulli that she had to go back home to New York City to reunite with her baby. When Soulli asked where she was at the moment, the woman said she was in Vegas for a Red Hot Chili Peppers concert.\n\nShe was reunited with her son Davonn later that night after 34 long years.\n\nYou can check out the full conversation below.\n\nGet weekly rundowns straight to your inbox\n\nA daily briefing on what matters in the music industry\n\nSend us a tip using our anonymous form.\n\nA daily briefing on what matters in the music industry\n\nSend us a tip using our anonymous form.\n\nBillboard is a part of Penske Media Corporation. © 2025 Billboard Media, LLC. All Rights Reserved.",
  "images": [
    "https://www.billboard.com/wp-content/uploads/2025/10/2Pac-Brendas-Got-A-Baby-screenshot-billboard-1800.jpg?w=942&h=628&crop=1",
    "https://cdn.shopify.com/s/files/1/0237/2843/products/2020_04_540x.jpg?v=1581608516"
  ]
}