{
  "title": "Murdoch Paper Flays Trump For ‘Stench’ of Crypto Pardon",
  "link": "https://www.thedailybeast.com/rupert-murdoch-paper-flays-donald-trump-for-stench-of-crypto-pardon/",
  "image": "https://www.thedailybeast.com/resizer/v2/DLYA2QRJUBEBNEDWRQFVJFFSGE.jpg?smart=true&auth=f8c462100064671138a451696f20ad7e23c4f18e2ae877f99279b206fcac5ea5&width=1200&height=630",
  "source": "The Daily Beast",
  "category": "general",
  "pubDate": "2025-10-25T07:43:00Z",
  "api": "GNews",
  "full_text": "Night Reporter\n\nThe Rupert Murdoch-owned Wall Street Journal has published a blistering editorial claiming that America’s Founding Fathers would be confounded by President Donald Trump’s decision to pardon a cryptocurrency kingpin.\n\n“It sure looks like a conflict of interest,” the WSJ wrote about the bombshell pardon Trump granted crypto billionaire Changpeng Zhao on Thursday.\n\n“A reasonable person would look at this and easily conclude that presidential leniency can be bought,” the paper wrote in a scathing rebuke of Trump’s decision.\n\nZhao, or “CZ,” is the founder of Binance, the world’s largest crypto exchange. In 2023, he pleaded guilty to violating anti-money laundering laws, and Binance paid $4 billion to settle. CZ was personally fined $50 million and handed a four-month sentence, which he completed in September.\n\n“President Trump exercised his constitutional authority by issuing a pardon for Mr. Zhao, who was prosecuted by the Biden administration in their war on cryptocurrency,” a White House statement said. “The war on crypto is over.”\n\nThe WSJ’s editorial highlights the link between CZ and the Trump family. Zhao’s company accepted a $2 billion transaction from an Emirati investment fund earlier this year in a cryptocurrency developed by the Trump family-owned World Liberty Financial—giving the coin legitimacy and the company significant revenue.\n\n“Readers can decide if they think the pardon had nothing to do with the investment,” the WSJ wrote, noting that Zhao applied for a pardon just days after facilitating the transaction.\n\n“I gave him a pardon at the request of a lot of very good people,” Trump claimed. “A lot of people say that he wasn’t guilty of anything.”\n\nZhao himself, in his plea deal, told the Justice Department that he turned a blind eye as terrorists, cybercriminals, and foreign adversaries used his platform to launder cash. At least $890 million was transacted through Binance between the U.S. and Iran.\n\nEven billionaire Joe Lonsdale, a venture capitalist and co-founder of the data-mining firm Palantir, said the pardon was a black mark on Trump’s record.\n\n“POTUS has been terribly advised on this; it makes it look like massive fraud is happening around him in this area,” Lonsdale wrote on X.\n\nI love President Trump; this is possibly the greatest admin of my lifetime - except for these pardons.If I’m calling balls and strikes, these are hit-by-pitches!!POTUS has been terribly advised on this; it makes it look like massive fraud is happening around him in this area. https://t.co/FPiNYJepGu\n\nFounding Fathers James Madison and Alexander Hamilton constructed the presidential pardon, the WSJ argues, because they “anticipated at least a modicum of presidential restraint.”\n\nThe paper claims the pardon “has the same stench” as Bill Clinton’s outgoing pardoning of fugitive financier Marc Rich.\n\nTrump is currently in the middle of a $10 billion legal dispute with The Wall Street Journal, which is owned by the 94-year-old Australian media baron. The WSJ’s editorials have been increasingly critical of the president in recent months.\n\nNight Reporter\n\njack.revell@thedailybeast.com\n\nGot a tip? Send it to The Daily Beast here.\n\nADVERTISEMENT\n\nADVERTISEMENT",
  "images": [
    "https://www.thedailybeast.com/pf/resources/images/obsessed-header-logo-h-2.png?d=337",
    "https://static.themebuilder.aws.arc.pub/thedailybeast/1741381130319.png",
    "https://author-service-images-prod-us-east-1.publishing.aws.arc.pub/thedailybeast/bc175dc5-2959-48d5-b427-b57bee25b59b.png",
    "https://www.thedailybeast.com/resizer/v2/DLYA2QRJUBEBNEDWRQFVJFFSGE.jpg?smart=true&auth=f8c462100064671138a451696f20ad7e23c4f18e2ae877f99279b206fcac5ea5&width=819&height=460",
    "https://www.thedailybeast.com/resizer/v2/3JFGY7V54VCEDAEGCV56FSIUF4.jpg?auth=f0038eb0dbfc1cface0edf4dd43f4d88d8071cafa8baffe0e13f33f53e3e5810&smart=true&width=300"
  ]
}