{
  "title": "NBA unveils all 30 team courts for Emirates NBA Cup 2025 - NBA",
  "link": "https://www.nba.com/news/emirates-nba-cup-2025-courts-unveiled",
  "image": "https://cdn.nba.com/manage/2025/10/All-Courts-Comms-and-Editorial-NBA-Cup-2025-v3-scaled.png",
  "source": "Heat.com",
  "category": "sports",
  "pubDate": "2025-10-24T16:02:14Z",
  "api": "NewsAPI",
  "full_text": "The Emirates NBA Cup 2025 tips off on Oct. 31 and will once again feature playing courts with a bold and distinctive style.\n\nJon Hartzell, NBA.com\n\n• Emirates NBA Cup 101| Emirates NBA Cup FAQ\n• Group Previews: East A | East B | East C | West A | West B | West C\n• Emirates NBA Cup: Complete coverage\n\nEach team has a new custom court for Emirates NBA Cup 2025.\n\nThe NBA unveiled today all 30 floor designs for the third edition of the tournament, which tips off Oct. 31, with an 8-game slate on Prime Video and NBA League Pass.\n\nDesigned by artist Victor Solomon, the courts feature fully-painted gradient designs, personalized overlays for each team, and hidden details for the two previous NBA Cup champions, in addition to other unique features. Solomon also created the courts for last season’s tournament and collaborated with Tiffany & Co. to design the NBA Cup trophy.\n\nHere are more details on the court designs for Emirates NBA Cup 2025:\n\nGroup Play action begins next week and runs through Nov. 28 with matchups every Friday. Then, eight teams advance to the Knockout Rounds, followed by the Semifinals and Finals in Las Vegas on December 13 and 16. Full details are available here.\n\nCheck out each team’s design before the Emirates NBA Cup 2025 tips off.\n\nThe Emirates NBA Cup 2025 will consist of Group Play and Knockout Rounds to crown the 2025 champion.\n\nThe higher-seeded team in each conference will host Emirates NBA Cup semifinal games for the 2026-27 season.\n\nThe Emirates NBA Cup 2025, the NBA’s third annual in-season competition, will crown a champion on Dec. 16 in Las Vegas.\n\nEverything you need to know about the Emirates NBA Cup 2025 which tips off on Friday, Oct. 31.\n\nThe Emirates NBA Cup 2025 will consist of Group Play and Knockout Rounds to crown the 2025 champion.\n\nThe higher-seeded team in each conference will host Emirates NBA Cup semifinal games for the 2026-27 season.\n\nThe Emirates NBA Cup 2025, the NBA’s third annual in-season competition, will crown a champion on Dec. 16 in Las Vegas.\n\nEverything you need to know about the Emirates NBA Cup 2025 which tips off on Friday, Oct. 31.\n\nHere are five things to know before watching the Suns and Nuggets renew their rivalry on Saturday.\n\nWith back-to-back 40+ point games to open the season, Luka Dončić put himself in a special class in NBA history.\n\nLuka Dončić shines in superstar battle, Deandre Ayton continues to improve and Marcus Smart shows his defensive value.\n\nJosh Hart opens his Kia Sixth Man campaign, Karl-Anthony Towns flashes high-post potential and Sam Hauser works free.\n\nArtist Victor Solomon talks designing the Emirates NBA Cup 2025 courts, collaborating with teams and evolution of the court designs.\n\nAll the action, top moments, stats and more from the 24 teams in action Friday on the NBA",
  "images": [
    "https://cdn.nba.com/manage/2025/10/All-Courts-Comms-and-Editorial-NBA-Cup-2025-v3-1-scaled.png",
    "https://cdn.nba.com/manage/2025/10/All-Courts-Comms-and-Editorial-NBA-Cup-2025-v3-1.png",
    "https://cdn.nba.com/manage/2025/10/NBA-Cup-Court_0000_atl-scaled.png",
    "https://cdn.nba.com/manage/2025/10/NBA-Cup-Court_0002_bos-scaled.png",
    "https://cdn.nba.com/manage/2025/10/NBA-Cup-Court_0001_bkn-scaled.png"
  ]
}