{
  "title": "Neanderthals could be brought back within 20 years — but is it a good idea? - Live Science",
  "link": "https://www.livescience.com/archaeology/human-evolution/neanderthals-could-be-brought-back-within-20-years-but-is-it-a-good-idea",
  "image": "https://cdn.mos.cms.futurecdn.net/WrMheJUpHJGcYKqr8DALjj-1920-80.jpg",
  "source": "Live Science",
  "category": "science",
  "pubDate": "2025-10-24T16:00:00Z",
  "api": "NewsAPI",
  "full_text": "With today's technology, we cannot bring back Neanderthals. But even if future advances allow it, should we?\n\nWhen you purchase through links on our site, we may earn an affiliate commission. Here’s how it works.\n\nWhen scientists sequenced the Neanderthal genome in 2010, they learned that Neanderthals interbred with human ancestors before mysteriously going extinct. As a result, many people alive today share up to 4% of their DNA with Neanderthals.\n\nThis genetic breakthrough yielded powerful new information about the evolutionary history of Neanderthals and Homo sapiens, but it also raised a new question: Could we bring back Neanderthals?\n\nGeorge Church, a Harvard University professor of genetics, answered this question in the affirmative in an interview with Der Spiegel in 2013. Church said that, by chopping the Neanderthal genome up into thousands of chunks and reassembling them in a human stem cell, this \"would enable you to finally create a Neanderthal clone,\" which would require an \"extremely adventurous female human\" to serve as a surrogate.\n\nIn 2025, the company that Church co-founded, Colossal Biosciences, made news for \"de-extincting\" the dire wolf through cloning and gene editing, creating genetically-engineered \"woolly mice\", and announcing plans to de-extinct the dodo. Their eventual goal is to de-extinct woolly mammoths.\n\nBut although Church was confident a decade ago that Neanderthal resurrection was a near-term possibility, other experts told Live Science that doing so is currently an insurmountably difficult task. Even if we could bring them back, there are many reasons we shouldn't, they argue.\n\n\"That is one of the most unethical things I can possibly think of to attempt — full stop,\" Jennifer Raff, a biological anthropologist at the University of Kansas, told Live Science of the idea of bringing them back.\n\nResurrecting a Neanderthal is not technologically simple. \"You can't just put a Neanderthal genome in a human egg,\" Raff said. \"It just wouldn't work.\"\n\nGet the world’s most fascinating discoveries delivered straight to your inbox.\n\nOne issue with this process is potential immune system incompatibility, which is often what dooms cross-species pregnancies, as the host uterus rejects the fetus. (It's still debated whether modern humans and Neanderthals can be called separate species.)\n\nAlthough humans and Neanderthals did successfully interbreed in the past, today there is at most 4% Neanderthal DNA remaining in some human groups. \"That other DNA might not have been beneficial and so it was slowly purged out of the genome,\" Raff said.\n\nAdditionally, experts have discovered that humans' Y chromosomes lack Neanderthal DNA, which may point to a fundamental immune system incompatibility between male Neanderthal fetuses and the female Homo sapiens carrying them, even in the past. And a genetic variant in red blood cells in Neanderthal-human hybrid mothers might have resulted in high rates of miscarriage, according to other research.\n\nReintroducing Neanderthal genes that were removed by natural selection over thousands of years into a modern human egg would likely have many unintended consequences, Raff said.\n\nAnother route would be cloning, but in order to clone one of our extinct cousins, \"we would need a live Neanderthal cell,\" Hank Greely, director of the Center for Law and the Biosciences at Stanford University, told Live Science, which we obviously don't have because Neanderthals died out more than 30,000 years ago.\n\nWith today's CRISPR technology — a form of genome editing — it is possible to modify a human cell's genome to make it more similar to a Neanderthal's. That's what Colossal did when it modified a handful of genes in gray wolves to make them look more like dire wolves. But those weren't actually dire wolves, just like a Homo sapiens with a handful of Neanderthal genes wouldn't be a Neanderthal.\n\nWhat's more, CRISPR isn't error proof, and it's difficult to incorporate many genetic changes at once.\n\n\"You might be able to make 20 to 50 changes now,\" Greely said, but \"at some point, you'll be able to change the entire thing.\"\n\nWhile CRISPR technology can be used to cut and modify DNA sequences, a new technique known as base editing, in which scientists change individual letters in DNA's code, may make it easier and faster to precisely edit genomes in the future.\n\n\"I think it's likely that, if you really wanted to do it, within 20 years or so, you could probably have a baby with a wholly Neanderthal genome born alive,\" Greely said. \"But I don't think we will do it, even if it is plausible, for both ethical and legal reasons.\"\n\nDe-extincting Neanderthals is ethically repugnant, experts told Live Science. \"It's morally abhorrent to even conceive of trying to create another kind of human based on DNA using uncertain technologies to which they could not consent,\" Raff said.\n\nBut human babies come into the world every day without consenting to being born, Greely said. To him, ensuring the safety of the process and the outcome is the more important ethical issue at hand.\n\nPatients undergoing in vitro fertilization can spare their children certain inherited diseases by selecting embryos without those gene mutations, or by mitochondrial donation, where IVF doctors transfer healthy mitochondria into an embryo to lower the risk of an inherited disease. Editing the genomes of human embryos, however, remains controversial, unproven and risky.\n\n\"We don't have experience in editing human embryos to show it's safe,\" Greely said, which means there is currently \"no evidence that transforming them into Neanderthal embryos would be safe.\"\n\nEven if the Neanderthal embryos could develop into an otherwise healthy Neanderthal, the life they would face once in our world would be unbearably bleak.\n\nBeing the only Neanderthal raised in a 21st-century world of humans would likely be lonely and isolating, possibly like the lives of the last Neanderthals in Europe. \"They wouldn't have prior generations or peers to learn from,\" Raff said.\n\nAnd that's the best-case scenario. The darker possibility is that we would keep any de-extincted Neanderthals in zoos like animals, Raff said, which is abhorrent because \"Neanderthals are human — they're just a different kind of human.\"\n\nHumans don't have a good track record over the centuries of treating other people well, Greely said, so \"I have no confidence that we wouldn't be nasty to Neanderthals.\"\n\nIt's also unclear what kind of information scientists would learn given the fact that the world has changed considerably in the 30,000 years since Neanderthals went extinct.\n\n\"A Neanderthal being reconstructed in this way wouldn't be living in the past — they would be living in the present and in an environment that's neither appropriate nor safe for them,\" Raff said. And since we don't know anything about how Neanderthals' genes interacted with their environment, we would have no idea how physically similar the reconstructed Neanderthal was to past Neanderthals.\n\n\"It would fail to answer virtually all of the interesting things that we would want to know about Neanderthals,\" Rebecca Wragg Sykes, an archaeologist and author of \"Kindred: Neanderthal Life, Love, Death and Art\" (Bloomsbury, 2020), told Live Science.\n\nFor example, many researchers are interested in understanding how sophisticated Neanderthal spoken language was. A combination of anatomical studies, genetic information and advanced tool technology suggests they communicated with one another, but possibly without metaphors or abstract words.\n\nStill, even if scientists could bring back a healthy Neanderthal and tried to teach him or her a modern human language, that wouldn't provide much insight into the language they actually used, Wragg Sykes said, just like reconstructing an ancient musical instrument wouldn't tell you what songs people played on it.\n\n\"Neanderthals were their own enormous range of different populations with cultural variations, culinary and very likely linguistic diversity,\" Wragg Sykes said. Since none of the natural context of Neanderthals' development is replicable, \"taking a shortcut by cloning or recreating Neanderthals isn't going to get you there.\"\n\nThe same logic holds for other abilities. Teaching one re-created Neanderthal how to read or solve an algebraic equation would only provide as much information about ancient Neanderthals as testing one living human would reveal about the abilities of all humans on the planet.\n\nWhile resurrecting Neanderthals is wildly unethical, the legality of making one is unclear, according to Greely. While human embryo editing of this nature is illegal in the U.S. and in the E.U., it's unlikely that every country in the world has relevant laws on the books.\n\n\"As far as I know, nobody has said it is illegal to make Neanderthals,\" Greely said. \"Theoretically, if a rich guy wanted to set up a lab in the Central African Republic that would be able to do this, it wouldn't be all that hard.\"\n\nOther scientists are worried about this exact possibility.\n\nIn a perspective essay published in the journal PLOS Biology in September, Arthur L. Caplan, a bioethicist at New York University, warned that \"the de-extinction of human predecessors could be undertaken at any time by private entities.\" Caplan exhorted scientists to start a conversation now, when de-extinction of Neanderthals and other human ancestors is only theoretical.\n\nColossal Biosciences' chief science officer, Beth Shapiro, was asked in 2024 if they will ever have a Neanderthal de-extinction team. Shapiro told Stat News that \"Neanderthals were people, and if you're going to work on people, you need to get informed consent. I don't know how you would get informed consent from a Neanderthal that you wanted to bring back to life.\"\n\nBut just because Colossal doesn't seem keen on the idea doesn't mean some other unscrupulous entity wouldn't do it if it were legal.\n\n\"Ancient hominid de-extinction should not be left in the hands of private, closely held, for-profit companies,\" Caplan wrote.\n\nInstead, finding a well-preserved Neanderthal body could be more valuable for understanding the culture and living conditions of our extinct cousins.\n\n—Gene that differs between humans and Neanderthals could shed light on the species' disappearance, mouse study suggests\n\n—78,000-year-old footprints from Neanderthal man, child and toddler discovered on beach in Portugal\n\n—Endurance athletes that carry Neanderthal genes could be held back from reaching their peak\n\nÖtzi the Iceman, for instance, was frozen in a glacier in the Alps for 5,300 years. Analyzing his remains has revealed that he sported an animal-skin wardrobe, that he used toxic ferns to wrap his food and that he had dozens of tattoos. And the low-oxygen conditions in a bog in Denmark revealed the exceptionally preserved body of \"Tollund Man,\" who lived 2,400 years ago. That analysis has shown that he had a tapeworm, that he ate porridge for his last meal, and that he was ritually murdered.\n\nSimilarly, \"if we found a Neanderthal in permafrost or a wetland context like a bog body, that would teach us a huge amount,\" Wragg Sykes said, \"probably more than you would get by having a cloned Neanderthal. That's what I would be more excited about.\"\n\nKristina Killgrove is a staff writer at Live Science with a focus on archaeology and paleoanthropology news. Her articles have also appeared in venues such as Forbes, Smithsonian, and Mental Floss. Kristina holds a Ph.D. in biological anthropology and an M.A. in classical archaeology from the University of North Carolina, as well as a B.A. in Latin from the University of Virginia, and she was formerly a university professor and researcher. She has received awards from the Society for American Archaeology and the American Anthropological Association for her science writing.\n\nYou must confirm your public display name before commenting\n\nPlease logout and then login again, you will then be prompted to enter your display name.\n\nLive Science is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site.\n\n©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036.\n\nPlease login or signup to comment\n\nPlease wait...",
  "images": [
    "https://cdn.mos.cms.futurecdn.net/fiZax4kLGWP2uWytvryqAT.png",
    "https://cdn.mos.cms.futurecdn.net/dREtjWx5cAhM4brRcw7BYm.png",
    "https://cdn.mos.cms.futurecdn.net/CKAWtGHCGvFFLXSqLm9J4a.jpg",
    "https://cdn.mos.cms.futurecdn.net/PzWCtxSEZrqbocNHWCSu9T.jpg",
    "https://cdn.mos.cms.futurecdn.net/sJVzuCWtpVFfgsACbu4iiE.png"
  ]
}