{
  "title": "Nelly Furtado says she's retiring from live performances for the \"forseeable future\"",
  "link": "https://www.nme.com/news/music/nelly-furtado-says-shes-retiring-from-live-performances-for-the-forseeable-future-3902155",
  "image": "https://www.nme.com/wp-content/uploads/2024/07/nelly-furtado-interview-credit-Sammy-Rawal.jpg",
  "source": "NME",
  "category": "entertainment",
  "pubDate": "2025-10-25T07:44:56Z",
  "api": "GNews",
  "full_text": "Furtado added that she still enjoyed writing music: \"I’ll identify as a songwriter forever\"\n\nNelly Furtado has announced her retirement from live performances for the “forseeable future”.\n\nThe ‘Maneater’ singer took to Instagram to reminisce about the 25th anniversary of her debut album ‘Whoa, Nelly!’ – and to explain why she was stepping away from the stage.\n\n“I have decided to step away from performance for the foreseeable future and pursue some other creative and personal endeavours that I feel would better suit this next phase of my life,” she wrote in the lengthy caption.\n\n“I have enjoyed my career immensely, and I still love writing music as I have always seen it as a hobby I was lucky enough to make into a career. I’ll identify as a songwriter forever”.\n\nShe went on to thank her fans and team for their support, addressing her recent resurgence in popularity on TikTok: “To have so many people rediscovering my music has been surreal and joyful. It’s been so fun embracing this opportunity, getting out on stages again and seeing up close, the true lasting power of good music. It’s made me really believe in magic.”\n\nFurtado closed out her post with a video of the crowd cheering for her at Citadel Music Festival in Berlin.\n\nA post shared by Nelly Furtado (@nellyfurtado)\n\nWe spoke to Furtado about her comeback in 2024, where the Canadian singer discussed her newest album ‘7’.\n\n“I knew I wanted to make an album that reminded me of the vibes and energy you get at a soundcheck when you hear your voice coming back at you loud from the speakers,” she told us.\n\nShe also explained how her 20-year-old daughter Nevis helped craft the record, adding: “She was discovering her passion for music as I was rediscovering my passion for music, so she kind of kept me in check”.\n\nSince then, Furtado has played numerous shows and festivals around the world, including Sziget Festival, Boardmasters, and at the Invictus Games Opening Ceremony in Vancouver.\n\nFurtado also teased to NME at the time that she and Timbaland should pursue a Las Vegas residency together for her best-selling album ‘Loose’. ‘Loose’ spawned numerous hits for Furtado and Timbaland, including songs like ‘Maneater’, ‘Promiscuous’, ‘Say It Right’, ‘In God’s Hands’ and ‘All Good Things (Come To An End)’.\n\n“I think it would be really fun for Timbaland and I to do a Vegas residency of ‘Loose’,” she told us. “We could play the album from beginning to end, because I do think it captures the world we were in at the time.”\n\nIn other news, Nelly Furtado has claimed magazines used to “lighten” her “olive skin”.\n\nThe world’s defining voice in music and pop culture: breaking what’s new and what’s next since 1952.\n\nWhen you purchase through affiliate links on NME.com, you may contribute to our site through commissions.\n    Learn more\n\n© 2025 NME is part of NME Networks.",
  "images": [
    "https://www.nme.com/wp-content/uploads/2024/07/nelly-furtado-interview-credit-Sammy-Rawal-696x442.jpg"
  ]
}