{
  "title": "Nelly Furtado ‘to Step Away’ From Performing ‘for the Foreseeable Future’",
  "link": "https://ca.news.yahoo.com/nelly-furtado-step-away-performing-054607515.html?guce_referrer=aHR0cHM6Ly9uZXdzLmdvb2dsZS5jb20vXy9Eb3RzU3BsYXNoVWkvZGF0YS9iYXRjaGV4ZWN1dGU&guce_referrer_sig=AQAAABO59wPTu-JqniVKn1zBj7amWJbc8Y3TDkANgPVJbFInNW12oh5dwSeJ8-Is2MuN6mzGPSmPx33mlOYlE5YG25Tp8eaPhAIEQfvMseEgirRThG15ygBXSmEZotwwtz258Nwd5OvRJoUak0sd8VcbXCFEE-yZ9c-7IPBa2jEUueni&_guc_consent_skip=1761414644",
  "image": "https://media.zenfs.com/en/thewrap.com/b866b76156ecbc4dc0062626d5d098c8",
  "source": "Yahoo News Canada",
  "category": "general",
  "pubDate": "2025-10-25T05:46:00Z",
  "api": "GNews",
  "full_text": "Manage your account\n\nNelly Furtado issued a major career update to her fans, sharing in a social media post that she plans “to step away” from performing for some time.\n\nThe “Maneater” singer shared the news on Instagram on Friday, where she looked back at her 25-year career with gratitude with a lengthy note.\n\nWhile Furtado noted that she “felt so actualized” early on in her career, she decided it was time to take a step back from performing after almost three decades.\n\n“25 years later, my music has reached a whole new generation of fans and I couldn’t be happier about that,” she wrote. “To have so many people rediscovering my music has been surreal and joyful. It’s been so fun embracing this opportunity, getting out on stages again and seeing up close, the true lasting power of good music. It’s made me really believe in magic.”\n\nShe added: “All this aside, I have decided to step away from performance for the foreseeable future and pursue some other creative and personal endeavors that I feel would better suit this next phase of my life. I have enjoyed my career immensely, and I still love writing music, as I have always seen it as a hobby I was lucky enough to make into a career. I’ll identify as a songwriter forever.”\n\nBefore concluding her note, Furtado thanked her fans, saying she had “endless gratitude to anyone who has ever listened and vibrated with my music and attended any of my shows.”\n\nShe also thanked those who helped her music dream become a reality, adding she hoped younger artists were able to experience the same “fruitful” collaborations.\n\nFurtado’s announcement notably came on the 25th anniversary of her first studio album, titled “Whoa, Nelly!” The songwriter is one of the most successful Canadian artists, having sold over 45 million records. She also won the Grammy award for Best Pop Collaboration for her 2007 song with Justin Timberlake and Timbaland, “Give It to Me.”\n\nHer other hit songs include 2000’s “I’m Like a Bird,” 2001’s “Turn Off the Light,” 2006’s “Promiscuous” and the aforementioned “Maneater,” also released in 2006.\n\nFurtado released her last album, titled “7,” in September last year. The release marked her seventh studio album and her first album in seven years.\n\nRead her full statement above.\n\nThe post Nelly Furtado ‘to Step Away’ From Performing ‘for the Foreseeable Future’ appeared first on TheWrap.",
  "images": []
}