{
  "title": "Officials investigating third Disney World death in last 10 days - MLive.com",
  "link": "https://www.mlive.com/news/us-world/2025/10/officials-investigating-third-disney-world-death-in-last-10-days.html",
  "image": "https://www.mlive.com/resizer/v2/CCLQT5BE7ZG6XAU4TY4ZXPMSRM.jpg?auth=0409c2cfca5ffdecc695d75fb36ab8f09a1b2e3fa6285a5eb5ae64b1a63a1c13&width=1280&smart=true&quality=90",
  "source": "mlive.com",
  "category": "general",
  "pubDate": "2025-10-24T17:18:00Z",
  "api": "NewsAPI",
  "full_text": "Another death has been reported at Walt Disney World.\n\nTMZ reported the latest death occurred at Disney’s Contemporary Resort on Thursday. Specific details were not immediately available, but Orange County officials are investigating.\n\nThe sad news comes two days after Entertainment Weekly reported that a man in his 60s died at a Florida hospital after experiencing a “medical episode” at Disney’s Fort Wilderness Resort & Campground on Tuesday.\n\nThe man’s wife found him unresponsive in bed, and there are no signs of foul play, EW reported.\n\nDisney’s Fort Wilderness Resort & Campground aims to evoke “the timeless beauty of the American frontier.” Deer, rabbits, ducks and armadillos roam the resort’s 750 acres of pine and cypress forest, which includes woodland trails and pool areas.\n\nThis is the third time someone has died on or near a Disney World property in the last 10 days. A guest died from an apparent suicide near the Contemporary Resort near the Magic Kingdom on Oct. 13.\n\nOn America’s other coast, a woman in her 60s died after riding the Haunted Mansion at the company’s smaller park, Disneyland, in Anaheim, on Oct. 7. Her cause of death has not been announced.\n\nIf you purchase a product or register for an account through a link on our site, we may receive compensation. By using this site, you consent to our User Agreement and agree that your clicks, interactions, and personal information may be collected, recorded, and/or stored by us and social media and other third-party partners in accordance with our Privacy Policy.\n\nUse of and/or registration on any portion of this site constitutes acceptance of our User Agreement, (updated 8/1/2024) and acknowledgement of our Privacy Policy,  and Your Privacy Choices and Rights  (updated 10/1/2025).\n\n© 2025 Advance Local Media LLC. All rights reserved (About Us). The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Advance Local.\n\nCommunity Rules apply to all content you upload or otherwise submit to this site.\n\nYouTube's privacy policy is available here and YouTube's terms of service is available here.\n\nAd Choices",
  "images": [
    "https://www.mlive.com/pf/resources/images/common/weather/small/02.png?d=1664",
    "https://www.mlive.com/pf/resources/images/common/weather/small/02.png?d=1664",
    "https://www.mlive.com/pf/resources/images/common/weather/small/02.png?d=1664",
    "https://www.mlive.com/resizer/v2/CCLQT5BE7ZG6XAU4TY4ZXPMSRM.jpg?auth=0409c2cfca5ffdecc695d75fb36ab8f09a1b2e3fa6285a5eb5ae64b1a63a1c13&width=1280&smart=true&quality=90",
    "https://www.mlive.com/resizer/v2/https%3A%2F%2Fauthor-service-images-prod-us-east-1.publishing.aws.arc.pub%2Fadvancelocal%2F8e908aad-39b8-44c8-aeae-afc832707ff0.jpg?auth=17631a84e8d0b326afc22bf96c3d66f0059537229efe5a7baf8d55c45479f752&width=180&smart=true&quality=90"
  ]
}