{
  "title": "Paramount Ahead, But Are There Other Suitors?",
  "link": "https://deadline.com/2025/10/warner-bros-discovery-deal-suitors-1236596524/",
  "image": "https://deadline.com/wp-content/uploads/2025/10/warner-bros_fb8120.jpg?w=1024",
  "source": "Deadline",
  "category": "business",
  "pubDate": "2025-10-24T23:06:00Z",
  "api": "GNews",
  "full_text": "By Jill Goldsmith, Ted Johnson\n\nEven in an industry increasingly accustomed to head-snapping change, this has been quite a week.\n\nAfter Paramount Skydance made the third in an escalating series of acquisition offers for Warner Bros. Discovery, the parent of Warner Bros., HBO and CNN officially declared it was for sale. Netflix’s co-CEOs then confused Wall Street by not slamming the door on a possible bid. Sources tell Deadline that Amazon may be interested and Comcast will be taking a look, while Apple will likely pass (or so its investors hope).\n\nIt may not be a coincidence that Comcast and Amazon were revealed Thursday as donors to President Donald Trump’s beloved new 90,000-square-foot White House ballroom (for which he has been razing the East Wing).\n\nThe cascade of events promises to dramatically reshape the U.S. media business, with a fabled Hollywood studio, a top purveyor of prestige TV and a cable news mainstay all poised to change hands. The roster of major studios would shrink to four. The disorienting quality of the past few days owes a lot to the fact that Paramount itself finally completed its merger with Skydance just two months ago. During the 18-month saga leading up to the close of that transaction, there were times when it looked like the century-old studio might cease to exist.\n\nThe latest in the trio of bids by David Ellison‘s Paramount, first reported by the New York Times and later confirmed by Deadline, was on October 13 for $23.50 a share. WBD rejected all three and the board declared publicly that it was launching a “strategic review” after receiving interest from multiple parties, carefully referring to “interest” vs actual offers. As other potential suitors circle, the prevailing opinion is that WBD is PSKY’s to lose, especially given that a key financial backer of Paramount is Larry Ellison, the Oracle co-founder who is currently the second richest person on the planet.\n\nThe WBD board couldn’t “ignore the escalating sorties to acquire the company or they would have problems. If they were saying they weren’t interested, they’d have a problem. Of course they’d be interested,” says Eric Schiffer, head of Beverly Hills-based family office Patriarch Organization.\n\nBofA Securities analyst Jessica Reif Ehrlich estimated WBD’s consolidated takeout value at about $30 a share – some $26 per share for Warner Bros. and $4+ for Discovery Global. Others Wall Streeters, at least initially, found that number much too high. The stock price, which foundered since Discovery acquired WarnerMedia from AT&T in April 2022, hit a three-year high Wednesday after the company announced its formal auction process. It closed Friday at $21.15, tripled in value from a $52-week low of $7.49.\n\nOverlaying any WBD auction is a separate process the company previously announced to split in two by mid-2026. In preparation, last December it restructured into two operating units, one for the Warner Bros. studio and HBO Max streaming, and the other for linear TV networks. Post-split, the stand-alone companies, to be called Warner Bros. and Discovery Global, would be run by WBD CEO David Zaslav and WBD CFO Gunnar Wiedenfels, respectively.\n\nWBD has said it will entertain offers for all of the company or either of its two segments as it continues to pursue a separation. But it will also consider an “alternative separation structure” that would enable a merger of Warner Bros., the more in-demand asset, and a spinoff of Discovery Global to shareholders.\n\nZaslav has expressed a preference for the split scenario, according to people in his camp, believing it can unlock more value. Even so, he has a legal fiduciary duty to shareholders not to slow-walk the bidding process for the whole company while working to finalize the split. Announcing a formal auction, as WBD did, acknowledges that obligation and also allows it to take control of the process.\n\nAt this stage of the M&A sequence, a company hires financial advisors and, generally, prepares financial information to share with potential bidders. Once they sign a non-disclosure agreement, bidders are welcomed to submit non-binding preliminary offers, or indications of interest.\n\nSerious bidders are invited to examine its books in more detail in a date room and submit second-round bids, or letters of intent, before progressing to a “best and final,” non-binding offer. The company then picks one suitor to conduct due diligence during an exclusive period, when final negotiations are held before either a binding offer is inked or the parties move on.\n\nWBD said Allen & Company, J.P. Morgan and Evercore are serving as its financial advisors, and Wachtell Lipton, Rosen & Katz and Debevoise & Plimpton are serving as legal counsel. It’s early days still and there are variations on the process, which depends in part on multiple suitors showing up. WBD declined to comment on where things stand or give a timeline. But the auction provides a framework for any party to step up.\n\nIn its pursuit of Paramount, the home of CBS and the former Viacom controlled by Shari Redstone, Skydance sweetened and refined its offer multiple times over months of drama. The bidding process featured some exclusive windows for Skydance but also periods when offers came in from Sony and Apollo or consortiums led by Barry Diller and Edgar Bronfman Jr. In an SEC filing Thursday, Paramount Skydance reported $138 million of merger-related costs incurred by Paramount and $3 million by Skydance, consisting mainly of banking, legal, advisory and other professional fees.\n\nA person familiar with PSKY’s thinking said the David Ellison company is looking to engage in a fair process for WBD.\n\nOne of PSKY’s bids, the Times first reported, offered Zaslav a top role in the company as co-chairman and co-CEO, which stymied many observers. Ellison is the chairman-CEO of Paramount Skydance with seasoned executive Jeff Shell, former head of NBCUniversal, reporting to him as president. It’s not clear if that concession (which came in the second offer) to Zaslav, a two-decade veteran of the corner office since his time running Discovery, will still be operative.\n\nComments by Netflix co-CEOs Ted Sarandos and Greg Peters during the company’s quarterly earnings interview this week signaled to some on Wall Street that the giant streamer may make a play for WBD. At the very least, they did not vanquish speculation that it has a degree of interest in exploring a bid.\n\n“We view it as notable that [Netflix] did not rule out prospective M&A” when asked about industry consolidation on a webcast after reporting quarterly earnings,” BofA’s Ehrlicgh wrote in a note to clients. “To be clear, the company reiterated there is no interest in acquiring cable linear networks, however they could be interested in buying IP that can strengthen their entertainment offering/existing capabilities and accelerate their strategy.”\n\nSpecifically, Sarandos said Netflix has been “very clear in the past that we have no interest in owning legacy media networks, so there is no change there.” And he talked a lot about IP.\n\n“When it comes to M&A opportunities, we look at them, and we look at all of them,” he said, with the bar being, first, “Is it a big opportunity? Second, if it’s IP, does it strengthen our entertainment offering?” he said.\n\n“We believe the potential combination of Warner Bros.’ best-in-class IP and library matched with NFLX’s best in class distribution would be a strong combination,” Reif Ehrlich said.\n\nIs there a gap between the two CEOs on this strategic question?\n\nAt a Bloomberg conference the week before earnings, Peters called the chance of a bid for WBD “unlikely.” He throws shade on big media deals at every opportunity, this week calling them a lazy and probably doomed way for the industry to address its many challenges. “You have to do that by the hard work of developing those capabilities in the trenches day to day,” he said on the earnings call. “You don’t get there simply by buying another company that is also still developing those same capabilities.”\n\nMichael Morris of Guggenheim wrote that Netflix management stopped “short of denying potential M&A interest on the back of the recent WBD announcement,” while emphasizing “the ability to be ‘choosy’ on investments and citing a clear framework to evaluate opportunities.”\n\nAlicia Reese of Wedbush Securities sees a path for the streamer to swoop in. “Netflix clearly has no intent to acquire any legacy media properties,” she wrote in a client note. “But for the right price, Netflix may find value in leveraging its massive global user base against WB’s deep catalog. Netflix has partnered with WB to license its content with a major content deal after its merger with Discovery. While Netflix could benefit from owning a vast array of this catalog, it may be more fruitful to continue to license selectively from the subsequent owner.\n\n“Of course, the various media companies vying for WBD or parts of it are likely to push the price higher, which we think pushes Netflix out of the ring as it has made clear that it does not require M&A to meet its growth targets,” she said.\n\nTo some, however, a Netflix deal seems nuts given the company’s stated disdain for theatrical.\n\n“Why Would Netflix Spend $75 Billion to Shutter Most of Warner Bros?” asked Lightshed Partners’ Richard Greenfield in the headline of an emphatic note, which featured a catalog of assets that would be divested. “So, we are to believe Netflix is seriously considering a $75 billion acquisition so it can shutter most of the cashflow of the acquired company in hopes of mining the library to create new content and using the increased library content to attract more subscribers and increase engagement to drive pricing power and reduce churn? Anything is possible, obviously, but this feels like a stretch.”\n\nThe $75 billion implies a $60 billion acquisition and the assumption of $15 billion in debt, assuming WBD’s current approximate $30 billion debt load is split 50-50 between Warner Bros. and Discovery Global.\n\n“Knowing the way they have always talked about theatrical, and knowing that they want IP, I see a contradiction there,” says one former studio executive. Netflix has so much capital given its muscular share price that it could afford to unload assets it doesn’t desire for a fraction of the value because it wants that IP.\n\nAmong big tech players, “Amazon for sure is a possibility, more so than Apple, because they get it on the efficiency side and can infuse those assets in way that benefits the overall company,” meaning mostly subscriptions to its flagship Prime loyalty program, says Schiffer of Patriarch.\n\nPatriarch has a position in Apple. Schiffer says CEO Tim Cook is a great leader but notes as have other investors that the company has struggled to gain momentum with its AI strategy. Apple has the advantage of a “tremendous installed base,” but challenges loom. In May, OpenAI acquired io, the startup of Apple’s former design chief Jony Ive, to develop a new family of products integrated with generative AI technologies. Ive was crucial to Apple, designing the original colorful iMac, the iPhone, iPad and Apple Watch. He left the company in 2019 to start his own design collective, LoveFrom.\n\nSo a massive entertainment deal is a “hard ask” for Apple right now, he said. It’s worth noting that despite its massively deep pockets, the company’s largest acquisition to date is a $3 billion deal for Beats in 2014.\n\nAt Comcast, Brian Roberts has actively pursued studio deals in the past. He made a play for Disney with a hostile takeover offer in 2004 that was rejected by shareholders. He also went after Fox, getting outbid by Disney but pushing up the price. Closing the $71.3 billion deal for most of 21st Century Fox saddled the Mouse with more debt that it would have liked, and six years later the transaction is widely viewed as an expensive miss for Disney’s Bob Iger.\n\nComcast also has its own corporate maneuvers to attend to, chief among them spinning off most of NBCUniversal’s cable networks into a stand-alone public company called Versant. The parent’s core broadband business has been wobbly and it’s in the midst of a fix there. Roberts, along with MSNBC and NBC, has been a frequent punching bag for Trump. There is an ongoing DEI inquiry at the Brendan Carr-led FCC, which would have to approve a WBD merger given the NBC broadcast licenses involved. Wall Street just doesn’t see how the company could prevail in the current regulatory regime – ballroom or not.\n\n“Given past commentary against all-things-Comcast from both the White House and the FCC over the past year,” MoffettNathanson’s Craig Moffett noted, “a successful Comcast acquisition of almost anything seems nearly unthinkable.”\n\nAlphabet, parent of Google and YouTube, gets floated in some conversations about the pool of would-be WBD acquirers but it is a definite wild card. “They don’t need to do it. But that’s the company I keep wondering about,” says one media investor.\n\nSony would probably be interested. It took a stab at Paramount with Apollo, bowing out as Skydance increasingly claimed the inside track. But financially it would be a really heavy lift. And this time around, the private equity giant is said to be working with the Ellisons on their bid.\n\n“My guess is it’s David Ellison’s to lose,” is a commonly expressed opinion – that Paramount will ultimately end up with WBD since it has both the cash and the approving eye of the president.\n\n“I think it’s the only realistic bidder for the whole thing. They have a lot of advantages that make them the best bidder. And WBD’s going public was in response to the likelihood that Paramount was going to go hostile,” says one industry insider. “They are in the driver’s seat.”\n\nWBD stock has risen 17% this week alone, giving hope to investors long dismayed by it languishing in single digits for years. Shares would fall if Paramount walks. “There’s a known offer out there. Take the win. Take the bird in hand,” said one fund manager.\n\n“I think Donald Trump would be delighted to see the family win it,” says Schiffer.\n\nLarry Ellison, father of David Ellison, is a Trump donor and friendly with the president, appearing in the Oval Office as part of a major U.S. AI initiative. Trump in recent weeks has confirmed the relationship, calling the Ellisons “friends” and “supporters.” And while getting Paramount-Skydance over the FCC’s finish line was no cake walk, things have changed. Paramount settled a dubious lawsuit with Trump. Ellison agreed with the FCC to rein in DEI, name an ombudsman for CBS and hire Bari Weiss to run it.\n\nRELATED: ‘CBS Evening News’ Only Broadcast Network To Say Nothing On-Air About Trump Pardon Of Money-Laundering Crypto CEO With Biz Connections To POTUS Family\n\n“They cater to what he wants. They donate to his causes, and Trump loves that,” says one Wall Streeter. “It was hard getting Paramount past the finish line … but it’s a completely different landscape.”\n\nThat said, even if Paramount succeeds in clinching a deal for WBD and gets the greenlight from the Trump administration, it will for sure face political blowback from Democrats, even though Congress does not have the power to block a merger.\n\nSen. Elizabeth Warren (D-MA), who is still seeking answers from Paramount on how the FCC approval went down and whether the Ellisons made a “side deal” with Trump, this week seized on the WBD news. “One of Trump’s billionaire buddies just bought Paramount,” she wrote in a post on X. “Now, he wants to buy Warner Bros. That means one giant company could control almost everything you watch on TV: HBO CNN CBS News Showtime TBS Comedy Central TNT Paramount+ TLC HGTV Nickelodeon Cartoon Network Animal Planet CBS Sports Adult Swim TeenNick Boomerang Cinemax Cooking Channel Discovery Channel Food Network Science Channel The CW Network Travel Channel BET MTV VH1.”\n\nAnd Senate Minority Leader Chuck Schumer (D-NY) appeared to allude to Paramount when he spoke on the floor about what he called the Trump administration’s descent into authoritarianism, saying, “They’re getting some of their friends to take over some of our media companies.”\n\nA merger would come before the Justice Department’s Antitrust Division, which is led by Abigail Slater. A former aide to JD Vance and staff attorney at the FTC, Slater actually drew bipartisan support in her confirmation, with a Senate vote of 78-19 in March. She gave indications that she would pursue aggressive antitrust enforcement against areas like big tech, but the settlement of a Hewlett Packard Enterprise merger with Juniper Networks last summer raised eyebrows. After reports that Slater opposed the settlement but was overruled by Attorney General Pam Bondi, Democrats seized on it as an example of political interference from Trump-supporting lobbyists.\n\nCoupled with the way that the Skydance-Paramount went down, the HP episode has rattled Washington’s antitrust community, reinforcing the idea that transactions won’t survive if they don’t have the approval of the president and his allies. Paramount, in a notable move last month, appointed Makan Delrahim as Chief Legal Officer. He preceded Slater as head of the DOJ antitrust unit and spearheaded the legal assault on AT&T’s proposal to acquire Time Warner, a lawsuit fueled by the animus against CNN that helped define Trump’s first presidential term.\n\nAny conditions regulators place on a merger, whether they involve CNN or DEI, would still have to survive a court review. That is because the Tunney Act requires a court review of civil antitrust cases, which would be triggered.\n\nThere’s also the matter of state attorneys general, who can challenge mergers, even those that have otherwise received a greenlight from the Justice Department. A group of attorneys general from states including Colorado, California and New York have filed a court challenge of the HPE-Juniper settlement, arguing that it is “reportedly the product of undue influence by well-connected lobbyists.”\n\nDiana Moss, vice president and director of competition policy at the Progressive Policy Institute, said that concerns over the politicization of federal merger reviews put “way more focus on state and private antitrust enforcement.” Although not many states have sought to challenge entertainment mergers, they have on consolidation of hospitals and supermarkets, among other things. Challenging a major media merger “is entirely possible,” though, she said, and states may band together. “We are absolutely seeing more state activism given the big concerns about consolidation,” she said.\n\n“Media and communications has got an enormous bullseye on it for the current administration to weaponize antitrust enforcement,” she said.\n\nShe said that while the media market “has been very hyper competitive,” there is concern over the “bottleneck” of ISP distribution. And with legacy media companies looking to combine, “My concern is then we will see a building up of potential dominant companies with a higher level of concentration,” leading to higher prices and “the kiss of death for the consumer.”\n\nThe impact of a Paramount-WBD merger on Hollywood may not be much better. Moving from six studio owners in 2022 to five, and now perhaps to four, is a trend the town is dreading. Even Wall Street types who generally don’t focus on such things are calling another studio merger combined with advancing AI “catastrophic,” “a total disaster” and a “bloodbath” in terms of jobs. Paramount, which last year shed 15% of U.S. employees ahead of the Skydance merger, is set to start another steep round of job cuts next week.\n\nDade Hayes contributed to this report.\n\nGet our Breaking News Alerts and Keep your inbox happy.\n\nComments On Deadline Hollywood are monitored. So don't go off topic, don't impersonate anyone, and don't get your facts wrong.\n\nComment\n\nName\n\nEmail\n\nWebsite\n\nΔ\n\nWhatever the outcome, you can be sure it will never benefit the rank and file worker that got those corps the money. It’s only “more more more for me me me”\n\nAnother example of Zaslav trying to fail up.\n\nNo one expects a Paramount acquisition. It’s a publicity stunt, or more likely market manipulation.\n\nSkydance will do to Paramount exactly what Zaslav has done to Warner Bros. – ameliorate the company so it’s sellable. Warner Bros will be sold to Comcast. It’s the only merger which preserves the historic Warner Bros. lot, as Universal will move its production next door so they can turn Universal City into a profitable theme park – the Universal Hollywood Resort. Universal filed permits for two resort hotels in Universal City in January. Does the current Universal Studios Hollywood park seem like it’s big enough to warrant two resort hotels? Of course not. But it will be when the park stretches from Lankershim to Barham Blvd.\n\nYou are dead wrong.\n\nWait what about Trump admin threat to any other bidder saying it won’t go through if it’s not paramount\n\nThis is the same Paramount that broadcasts a successful show depicting Trump as Satan’s micropenised lover?\n\nSignup for Breaking News Alerts & Newsletters\n\nBy providing your information, you agree to our Terms of Use and our Privacy Policy.\n\t\t\t\tWe use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply.\n\nGet our latest storiesin the feed of your favorite networks\n\nWe want to hear from you! Send us a tip using our annonymous form.\n\nSign up for our breaking news alerts\n\nBy providing your information, you agree to our Terms of Use and our Privacy Policy.\n\t\t\t\tWe use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply.\n\nDeadline is a part of Penske Media Corporation. © 2025 Deadline Hollywood, LLC. All Rights Reserved.\n\nBy providing your information, you agree to our Terms of Use and our Privacy Policy.\n\t\t\t\tWe use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply.",
  "images": [
    "https://deadline.com/wp-content/uploads/2025/10/warner-bros_fb8120.jpg?w=681&h=383&crop=1",
    "https://deadline.com/wp-content/themes/pmc-deadline-2019/assets/public/lazyload-fallback.jpg",
    "https://deadline.com/wp-content/themes/pmc-deadline-2019/assets/public/lazyload-fallback.jpg",
    "https://deadline.com/wp-content/themes/pmc-deadline-2019/assets/public/lazyload-fallback.jpg",
    "https://deadline.com/wp-content/themes/pmc-deadline-2019/assets/public/lazyload-fallback.jpg"
  ]
}