{
  "title": "Sabrina Carpenter Hilariously 'Arrests' Gigi Hadid at Pittsburgh Concert - TMZ",
  "link": "https://www.tmz.com/2025/10/24/gigi-hadid-sabrina-carpenter-tour-arrest/",
  "image": "https://imagez.tmz.com/image/33/16by9/2025/10/24/33dd3ad9f65f45f0af09579d5ccc7d84_xl.jpg",
  "source": "TMZ",
  "category": "entertainment",
  "pubDate": "2025-10-24T14:14:45Z",
  "api": "NewsAPI",
  "full_text": "Gigi Hadid got cuffed by none other than Sabrina Carpenter ... and let’s just say, the pop star was burning up over the supermodel.\n\nCheck out the clip -- Sabrina had her sights set on Gigi during her \"Short n' Sweet\" tour in Pittsburgh Thursday evening, playfully asking the model in the crowd where she's from ... and when Gigi said Bucks County, Sabrina fired back with a flirty, \"Wow, maybe we're soulmates!\"\n\nWaiting for your permission to load the Instagram Media.\n\nSabrina confessed she was \"hot and flustered\" over Gigi before slapping her with some furry pink handcuffs ... bold doesn’t even cover it!\n\nCue \"Juno\" blasting as SC hypes the crowd to get louder, because Gigi was feeling \"beautiful and nervous.\"\n\nSabrina’s been running this cheeky \"celebrity arrest\" bit all tour ... and she’s already bagged Millie Bobby Brown and Margaret Qualley, and the list goes on.\n\nSo when a literal Victoria’s Secret Angel like Gigi shows up? Yeah, no chance she was slipping past Sabrina’s sirens!\n\nYes! Send me email updates and offers from TMZ and its Affiliates. By subscribing, I agree to the Privacy Policy and Terms of Use",
  "images": [
    "https://imagez.tmz.com/image/a7/16by9/2025/10/25/a7df55e1ebc749ef9c818896480008b6_xs.jpg",
    "https://imagez.tmz.com/image/e2/16by9/2025/10/24/e240443125b04c43a417f4378a2db129_xs.jpg",
    "https://imagez.tmz.com/image/c3/16by9/2025/10/25/c3405b63a9b344d5b134b645fa33037c_xs.png",
    "https://imagez.tmz.com/image/35/16by9/2025/10/24/353c4e70101440e1b49787e1031b5278_xs.jpg",
    "https://imagez.tmz.com/image/56/16by9/2025/10/25/56b8e2f972254baeb26b22a4a415005e_xs.png"
  ]
}