{
  "title": "S&P 500 Tops 6,800 as CPI Gives Fed the Go-Ahead: Markets Wrap - Yahoo Finance",
  "link": "https://finance.yahoo.com/news/asia-join-global-equity-rally-231917469.html",
  "image": "https://s.yimg.com/ny/api/res/1.2/axTuLtfueGc66SzsOYGkCA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04NzM-/https://media.zenfs.com/en/bloomberg_holding_pen_162/9aa50cdf61acb45da89cf9717a46e589",
  "source": "Yahoo Entertainment",
  "category": "general",
  "pubDate": "2025-10-24T18:00:02Z",
  "api": "NewsAPI",
  "full_text": "Oops, something went wrong\n\n(Bloomberg) -- Wall Street saw a relief rally as cooler-than-estimated inflation data reinforced trader conviction on Federal Reserve interest-rate cuts.\n\nStocks extended their October advance, with the S&P 500 hitting fresh all-time highs amid speculation that policy easing will keep powering corporate earnings. An initial jump in Treasuries waned after manufacturing and service surveys underscored resilience in the world’s largest economy.\n\nMost Read from Bloomberg\n\nWhat a 1970s Commune in Arizona Got Right About Desert Urbanism\n\nChicago Bears Leave Behind $356 Million Stadium Debt as They Ditch City\n\nPritzker Slams Chicago Mayor’s Plan for Tax on Big Payrolls\n\nAmerican Roads Are Paved With Inefficiency\n\nThe Eternal Reinvention of the American Downtown\n\nThe slowest pace in three months for underlying inflation was welcomed by traders, who’ve been flying almost blind amid the dearth of data since the start of the government shutdown. The September core consumer price index increased 0.2% from August. On an annual basis, it rose 3%.\n\nWhile the central bank was already expected to lower rates next week, the report may help convince officials they can do so again in December. There was little in the benign CPI data to “spook” the Fed, noted Lindsay Rosner at Goldman Sachs Asset Management.\n\n“Investors are grabbing the bull by the horns after this morning’s lighter-than-anticipated CPI bolstered the case for a series of rate cuts this year and next,” said Jose Torres at Interactive Brokers.\n\nThe US government will probably be unable to release inflation data for October, the White House said Friday, citing the ongoing government shutdown.\n\nThe S&P 500 rose almost 1%, briefly topping 6,800. Treasury two-year yields slid one basis point to 3.48%. The dollar wavered.\n\nAs long as incoming data signal more risk to employment than to inflation, the Fed’s policy path likely points toward additional easing, said Jason Pride at Glenmede.\n\n“The Fed has been clear that they are more focused on the softening labor data and will continue to defend their full employment mandate” even with inflation running above target, said Art Hogan at B. Riley Wealth.\n\nThe CPI report confirms what we’ve seen overall from private data during the government shutdown — little indication that inflation is surging or that the labor market is falling off a cliff, according to Ellen Zentner at Morgan Stanley Wealth Management.\n\n“For a Fed focused on prudent ‘risk management,’ that should translate into another rate cut next week, and likely more to follow,” she said.\n\nTo Bret Kenwell at eToro, it would have taken a shockingly bad report to derail an October rate cut, but at a time when economic data is a bit sparse, investors will take any clarity they can get.\n\nKenwell also noted that while we may in fact get two more rate cuts this year, the Fed will struggle to justify a more aggressive rate-cutting approach in the face of stubbornly high inflation — unless there’s persistent and notable weakness in the labor market.\n\n“Regardless, stocks can do well in a mild inflationary environment, as we have seen over the past few years. For that to continue, we’ll need to see strong earnings, and so far this earnings season, that’s been the case,” he said.\n\n“Much like a Sherlock Holmes’ story, inflation is the dog that didn’t bark,” said Chris Zaccarelli at Northlight Asset Management.\n\n“So many people have been expecting a sharp increase in inflation and have positioned bearishly as a result, but the market is likely to keep squeezing the shorts until they realize that the economy – and Corporate America – is more resilient than many expected,” he said.\n\nZaccarelli also noted that while equity valuations are high and there are risks in the market, with the Fed cutting rates and corporate profits continuing to increase, it’s hard to see an interruption of this year’s bull market.\n\n“Next year will bring new challenges, but we wouldn’t advise getting in the way of the upward trend between now and year-end,” he said.\n\nAn alignment of seasonal strength, renewed corporate buybacks, and surging demand from individual investors is setting up US stocks for a powerful year-end rally that’s likely to kick off in the days ahead, according to Citadel Securities’ Scott Rubner.\n\n“The best seasonal window of the year begins next week,” Rubner wrote. At the same time, “persistent retail equity demand continues to act as a price setter of equities.”\n\nInterest-rate swaps signaled traders have all but fully priced in quarter-point rate cuts by the Fed at its meetings next week and in December.\n\nOverall, the inflation figures locked in a 25 basis-point cut next week and will likely result in a “dovish cut” tone, according to Ian Lyngen at BMO Capital Markets.\n\n“The CPI report leaves an October Fed rate cut a done deal with a December cut also highly likely,” said Oscar Munoz and Gennadiy Goldberg at TD Securities. “However, given that this is priced in, further bullish momentum in rates is likely to be contained.”\n\nWith the October cut fully priced in, markets will remain focused on guidance around future rate cuts and the end of quantitative tightening, which the TD Securities strategists expect to be announced at the October meeting.\n\nWhen Fed officials meet next week to decide whether to cut rates again, they’ll face another question that’s becoming increasingly urgent — how soon they should stop shrinking the bank’s $6.6 trillion portfolio of securities.\n\nMoney markets have been flashing warnings for several weeks that the process, known as quantitative tightening, may have run its course. Now, Wall Street strategists say, stress signals have gathered such momentum that the Fed may be forced to end QT as soon as this month.\n\nAt JPMorgan Chase & Co., Michael Feroli says he expects the Fed to decide next week to end balance-sheet reduction, or QT.\n\nFeroli also says the case for expecting a cut next week is a simple one: Fed speakers, even some of the more hawkish ones, have done little to push back on the market’s firmly held view that a cut is coming.\n\nHe expects the post-meeting statement will be little-changed relative to the September statement. At the press conference, Feroli believes that Chair Jerome Powell will continue to characterize the easing as a risk-management move.\n\n“We don’t anticipate he will signal any bias regarding the December meeting; with potentially three months’ worth of data to be released between now and then, we see little upside from any signaling that could end up being quite improvident,” he said.\n\nTraders are betting on about 120 basis points of easing over the next 12 months to around 2.9% — below the 3% level viewed as neutral, neither stimulating nor restricting the economy.\n\n“The data confirms that US inflation remains sticky, but is gradually fading, reinforcing the case for multiple Fed rate cuts into next year,” said Florian Ielpo at Lombard Odier Asset Management.\n\nWhile signs of tariff-induced inflation are apparent in select categories such as apparel and furniture, goods prices increased at a slower pace in September than August broadly, according to Josh Jamner at ClearBridge Investments.\n\n“This suggests that the pass-through of higher tariffs to consumers has continued to undershoot expectations, which in turn has opened the door for the Fed to lower rates to support a cooling labor market,” he said.\n\nJeffrey Roach at LPL Financial noted that while tariffs were likely the culprit for rising apparel prices in September, inflation metrics will likely improve by December, setting the Fed up to continue easing throughout 2026.\n\n“Inflation is staying contained at this point,” said Eric Teal at Comerica Wealth Management. “The impact from tariffs has been mostly felt in lower end consumption imports. The current inflation report combined with a weaker job market provides cover for additional rate cuts in 2025 and into next year.”\n\nOverall, this report shows tariff-related price adjustments are more modest because competitive pressures within the retail industry are pushing companies to find other ways to offset the additional costs, according to Tiffany Wilding at Pacific Investment Management Co.\n\n“With inflation expectations still looking anchored, we are not too worried about runaway inflation here despite lingering tariff effects,” said Don Rissmiller at Strategas.\n\nTo Scott Helfstein at Global X, the delayed inflation report was not great, but not bad enough to stop the Fed from cutting. Prices have been reasonably stable outside utilities and used cars despite tariffs.\n\n“Yes, prices are higher, but not enough to keep them from helping the economy,” he said. “US consumers do not like higher prices, but are still eating out.”\n\nSeparate data showed US consumer sentiment fell in October to a five-month low, as worries persisted about stubbornly high prices and the impact on their finances.\n\n“Today’s numbers help the Fed’s narrative that at least inflation is mostly moving in the right direction,” said John Kerschner at Janus Henderson. “Right now, the markets are seemingly giving the Fed a pass to cut rates through the end of 2025.”\n\nCorporate Highlights:\n\nInvesco Ltd.’s proxy vote to decide the future of famed tech fund QQQ was postponed.\n\nAn Intel Corp. stock rally faded on Friday after investors looked past an upbeat forecast and focused on the many lingering challenges at the embattled chipmaker.\n\nFord Motor Co. signaled it will largely bounce back next year from a devastating fire that hobbled a key supplier to its top-selling F-150 pickup, sending shares up the most in more than five years while assuaging concerns over one of the automaker’s biggest money-makers.\n\nProcter & Gamble Co. reported better-than-expected sales for its first quarter as consumers brushed off price increases and snapped up its Gillette razors and Secret deodorant. The company also cut its projected impact from tariffs in half.\n\nGeneral Motors Co. cut hundreds of jobs on Friday, just days after raising its profit guidance for the year in a move that sent the shares soaring.\n\nTarget Corp. is eliminating about 8% of corporate roles in its first major restructuring in years, according to a memo viewed by Bloomberg News, as the retailer seeks to reduce complexity and regain its footing.\n\nAlaska Air Group Inc. executives planned to use its earnings update to showcase the carrier’s plans to cash in on rebounding travel demand, and a return to stability after an IT outage disrupted travel early in the summer. Instead, they are once again working to defuse the fallout from a fresh tech glitch with disruption that’s expected to last for days.\n\nNewmont Corp. is starting to reap the benefits of cost-cutting measures, with the world’s largest gold miner delivering stronger-than-expected quarterly earnings.\n\nNewmont is studying a potential deal to gain control of Canadian rival Barrick Mining Corp.’s prized Nevada gold assets, people with knowledge of the matter said.\n\nEli Lilly & Co. agreed to buy Adverum Biotechnologies Inc., a company working to treat blindness, in a deal that ultimately could be worth $261.7 million as it continues a push into gene therapies.\n\nJPMorgan Chase & Co. plans to allow institutional clients to use their holdings of Bitcoin and Ether as collateral for loans by the end of the year in a significant deepening of Wall Street’s crypto integration.\n\nCrypto.com became the latest cryptocurrency firm to pursue a US bank charter as it seeks to further its custody-service business for products such as digital-asset treasuries and exchange-traded funds.\n\nDeckers Outdoor Corp., the owner of Hoka running shoes and Ugg boots, forecast 2026 revenue that falls short of analyst expectations, reflecting pressured consumer spending.\n\nBayer AG won support from US regulators for a menopause drug that’s expected to hit the market in November under the name of Lynkuet.\n\nPorsche AG suffered its first quarterly loss as a listed company, with the luxury-car manufacturer taking a €3.1 billion ($3.6 billion) hit this year from scaling back its electric ambitions and US tariffs.\n\nLet us know\n\nWhat Bloomberg Strategists say...\n\n“The 3% CPI print has changed little because the market expects inflation to be around this sort of level for a while as the Fed removes its foot from the brakes. In other words, the market anticipates a Fed that’s turning its attention to the labor-market part of its dual mandate.”\n\n— Sebastian Boyd, Macro Strategist, Markets Live. For the full analysis, click here.\n\nSome of the main moves in markets:\n\nStocks\n\nThe S&P 500 rose 0.8% as of 4 p.m. New York time\n\nThe Nasdaq 100 rose 1%\n\nThe Dow Jones Industrial Average rose 1%\n\nThe MSCI World Index rose 0.7%\n\nBloomberg Magnificent 7 Total Return Index rose 0.6%\n\nThe Russell 2000 Index rose 1.2%\n\nCurrencies\n\nThe Bloomberg Dollar Spot Index was little changed\n\nThe euro rose 0.1% to $1.1633\n\nThe British pound was little changed at $1.3315\n\nThe Japanese yen fell 0.2% to 152.80 per dollar\n\nCryptocurrencies\n\nBitcoin rose 1% to $110,654.56\n\nEther rose 2.8% to $3,936.79\n\nBonds\n\nThe yield on 10-year Treasuries was little changed at 4.00%\n\nGermany’s 10-year yield advanced four basis points to 2.63%\n\nBritain’s 10-year yield was little changed at 4.43%\n\nThe yield on 2-year Treasuries declined one basis point to 3.48%\n\nThe yield on 30-year Treasuries was little changed at 4.59%\n\nCommodities\n\nWest Texas Intermediate crude fell 0.6% to $61.45 a barrel\n\nSpot gold fell 0.7% to $4,097.75 an ounce\n\n--With assistance from Molly Smith.\n\nMost Read from Bloomberg Businessweek\n\nTrump’s Unlikely ICE Detention Giant Is an Alaska Native Company\n\nChinese Caviar and Foie Gras Shake Up Global Gourmet Dining\n\n‘I Want to Win’: Inside Gavin Newsom’s Plan for Taking On Trump\n\nSPACs Are Back, and MAGA Is Fueling Their Growth\n\nAI Data Center Boom Threatens Trump’s Manufacturing Revival\n\n©2025 Bloomberg L.P.\n\nSign in to access your portfolio",
  "images": [
    "https://s.yimg.com/dv/static/siteApp/img/privacy-choice-control.png",
    "https://s.yimg.com/dv/static/siteApp/img/privacy-choice-control.png",
    "https://s.yimg.com/dv/static/siteApp/img/privacy-choice-control.png",
    "https://s.yimg.com/dv/static/siteApp/img/privacy-choice-control.png"
  ]
}