{
  "title": "Takeaways: Lakers flatten Timberwolves in ‘embarrassing’ defensive performance as Luka Doncic scores 49 points",
  "link": "https://www.startribune.com/takeaways-lakers-flatten-timberwolves-as-luka-doncic-scores-49-points/601461891",
  "image": "https://arc.stimg.co/startribunemedia/ZY7FC5SNFNAN3D7RFVFHGRTGCA.jpg?&w=1200&ar=1.91:1&fit=crop",
  "source": "Star Tribune",
  "category": "general",
  "pubDate": "2025-10-25T06:24:50Z",
  "api": "GNews",
  "full_text": "Wolves\n\nThe Wolves defense could not get stops, as LeBron James-less Los Angeles shot 59.2% from the floor.\n\nBy Chris Hine\n\nLOS ANGELES – Donte DiVincenzo didn’t mince words when discussing the Timberwolves’ defensive performance in a 128-110 loss to the Lakers on Friday night.\n\n“That was embarrassing,” he said. “I think everybody here knows it. We have a higher standard than that. It’s Game 2, but we’ll ready to go on Sunday [against Indiana] for sure.”\n\nThe Lakers were without LeBron James, as the 40-year-old is sidelined by a nerve injury that could also keep him out for Wednesday’s game at Target Center. But James’ absence was no issue Friday for Luka Doncic, who sliced and diced the Wolves all night for 49 points, 11 rebounds and eight assists.\n\nThe Wolves were a step late to shooters; indecisive on how to handle screens, especially with Doncic; and fouled too much in an out-of-character performance for a defense that has been among the league’s best the past two seasons. They had one good quarter of defense on Wednesday at Portland, but the other seven quarters have not been up to their standard.\n\n“Defense is certainly not where it needs to be,” coach Chris Finch said after Los Angeles shot 59.2% from the floor. “Just nothing. Not dictating on the point of attack. No aggressiveness to it at all, and the fly around mentality behind it is just not quite there.”\n\nThe night started fine for the Wolves, who built a double digit-lead early. They led 28-17 by hitting 11 of their first 14 shots, and they scored 40 points in the first quarter. Anthony Edwards finished the night with 31 points while Julius Randle had 26. But that’s where the good news ended for the Wolves.\n\nOn Wednesday, the Wolves allowed the Trail Blazers to score 95 points by the end of three quarters. The Lakers outdid that by reaching 108 through three. They had 40 in the third. DiVincenzo, who had 13 points, said the team’s effort wasn’t there.\n\n“First and foremost is effort. You fix the effort and then you can tweak all the little things,” DiVincenzo said. “But you can’t tweak all the little things unless you’re giving 100 percent effort.”\n\nOne of the keys to the Wolves beating the Lakers in the playoffs last season was their ability to limit Austin Reaves. But Reaves played well Friday in scoring 25 points and dishing out 11 assists. Rui Hachimura also had a good night, with 23 points on 10-for-13 shooting.\n\n“Guys started getting open ones, and it just felt like target practice for them,” DiVincenzo said. “It goes back to the effort. We can do multiple things on the defensive end, be in different coverages, we can get back if our energy is high and our competitive spirit is high. It wasn’t where we know it should be and where it needed to be tonight.”\n\nFor most of the night, Finch again went 10 deep into his bench and second-year guard Rob Dillingham was not in that rotation. Finch again opted for Bones Hyland for backup point guard minutes when Mike Conley picked up three fouls in the first half.\n\nWolves\n\nWolves\n\nDillingham, the No. 8 pick in the 2024 draft, came into the game for his first minutes of the season when the Wolves were down 117-98 with 8:06 to play.\n\nBut after two possessions, he had to exit because of a bloody nose, ending his night after just 59 seconds. His bloodied jersey was lying on the floor of the locker room when reporters walked in and said doctors told him he had suffered a fracture. It’s unclear how much time, if any, he will miss.\n\nBOXSCORE: L.A. Lakers 128, Wolves 110\n\nDoncic frustrated the Wolves all night. No matter who the Wolves put on him – Jaden McDaniels, Jaylen Clark or Edwards, he found open looks, drew fouls or found open teammates. He was masterful and the Wolves were powerless to stop him.\n\n“Luka was making some tough shots,” McDaniels said. “That’s what happens when you play people like that. You just can’t let the other people affect the game. We’ve got to treat it like we did in the playoffs.”\n\nBut the Lakers had that playoff intensity. The Wolves didn’t.\n\nAfter going 1-1 on the season-opening West Coast trip, the Wolves return to Minnesota for Sunday’s home opener vs. the defending Eastern Conference champion Pacers.\n\nChris Hine is the Timberwolves reporter at the Minnesota Star Tribune.\n\nWolves\n\nWolves\n\nThe Wolves defense could not get stops, as LeBron James-less Los Angeles shot 59.2% from the floor.\n\nWolves\n\nWolves\n\nAll the preseason speculation evaporated in the opening game when Donte DiVincenzo started and Rob Dillingham didn’t play.\n\nWolves\n\nWolves\n\nThe All-Star guard scored 41 points in the season-opening victory in Portland.\n\nWolves\n\nWolves\n\nThe Wolves defense could not get stops, as LeBron James-less Los Angeles shot 59.2% from the floor.\n\n© 2025 StarTribune.All rights reserved.",
  "images": [
    "https://arc.stimg.co/startribunemedia/ZY7FC5SNFNAN3D7RFVFHGRTGCA.jpg?&w=1080",
    "https://arc.stimg.co/startribunemedia/ZY7FC5SNFNAN3D7RFVFHGRTGCA.jpg?&w=436&ar=3:2&fit=crop",
    "https://arc.stimg.co/startribunemedia/ZY7FC5SNFNAN3D7RFVFHGRTGCA.jpg?&w=436&ar=3:2&fit=crop"
  ]
}