{
  "title": "The New Miss USA Is Miss Nebraska Audrey Eckert",
  "link": "https://www.businessinsider.com/miss-usa-winner-miss-nebraska-audrey-eckert-2025-10",
  "image": "https://i.insider.com/68fc3eaa0be9845f2dc519d9?width=1200&format=jpeg",
  "source": "businessinsider.com",
  "category": "entertainment",
  "pubDate": "2025-10-25T03:20:00Z",
  "api": "GNews",
  "full_text": "Every time Anneta publishes a story, you’ll get an alert straight to your inbox!\n\nEnter your email\n\nBy clicking “Sign up”, you agree to receive emails from Business Insider. In addition, you accept Insider’s\n                                          Terms of Service and\n                                          Privacy Policy.\n\nThere's a new Miss USA in town.\n\nMiss Nebraska Audrey Eckert was named the winner of the 74th annual Miss USA pageant on Friday night at the Grand Sierra Resort in Reno, Nevada. She was crowned by the current Miss Universe, Victoria Kjær Theilvig.\n\nMiss USA 2024 Alma Cooper shared in an Instagram post on Friday that she had declined to participate in the 2025 pageant, though they paid tribute to her reign during the finals.\n\nEckert studied business administration at the University of Nebraska-Lincoln, where she was a member of the Husker cheer squad, according to her Miss USA bio. Now, she's a social media and marketing coordinator for the Thai handbag brand Sapahn.\n\nThe 23-year-old will go on to represent the United States at the Miss Universe pageant in November.\n\nFifty-one women competed for the Miss USA crown, taking part in swimsuit, evening gown, and interview rounds during the preliminary competition earlier this week in Reno.\n\nIn past years at Miss USA, the top 15 to 20 contestants were picked by a selection committee. The new CEO, Thom Brodeur, told Business Insider in September that he was eliminating the committee to bring more transparency to the competition.\n\n\"For many, many years, young women have come into this organization competing with a rule — it's very clearly stated, you know what you're signing up for in your contestant contract — that the leadership team, management, and others can be part of the selection process,\" Brodeur said. \"So the process for selecting a new Miss USA and Miss Teen USA isn't just left up to the judges. That's how it has historically been.\"\n\n\"Part of what my team and I intend to do is to remove that selection committee rule out of contestant contracts,\" he added. \"What that means, very simply, is who the judges pick is the winner of Miss USA and Miss Teen USA. And what that means to the competitors — the young women who compete in this sport — is that they are going to have a 100% fair shot where nobody else's voice or influence affects their ability to place in the competition.\"\n\nThis year's judges were Miss USA 2014 and current \"The Valley\" star Nia Sanchez, \"Dancing With the Stars\" pro Sasha Farber, former \"Bachelor in Paradise\" star Jade Roper Tolbert, model scout Hannah Edwards, and fashion designer Kenneth Barlis.\n\nBrodeur also brought back interview questions about current events, which had been off-limits under former Miss USA CEO Laylah Rose.\n\n\"We're not just all talking about our favorite colors, movies, or songs,\" Brodeur told Business Insider in September. \"So I think it's important that we allow the intelligence of the women in the Miss USA and Teen USA communities to shine.\"\n\nDuring the final question round, the contestants were asked about artificial intelligence, barriers women may face when building lasting wealth, and more.\n\nMiss Nebraska's question was: \"When people look back on our generation 100 years from now, what do you hope they say about us, and what are you doing to help make that happen?\"\n\n\"Our generation is, without a doubt, adaptable,\" Eckert said. \"We have learned to grow and change through so many things.\"\n\n\"I work in digital media every single day, and I teach 500 athletes on a weekly basis how to stay safe online, and being safe online, and learning to grow up in a digital world requires you to be adaptable, just like the job of Miss USA,\" she continued. \"She's heading to Miss Universe very shortly, and she needs to be adaptable, she needs to roll with the punches, and she needs to lead our great nation with pride.\"\n\nMiss USA hasn't had a scandal-free year since 2020. In the half-decade since, there have been rigging accusations, sexual harassment allegations, three different CEOs, two resigned queens, and one bombshell lawsuit.\n\nBrodeur hopes to usher in a new era with the new Miss USA, who will kick off her reign with a flight to Thailand for the weekslong Miss Universe 2025 competition. The televised finals will air on November 21.\n\nBrodeur told Business Insider in September that the new Miss USA will have a \"pretty aggressive appearance roster\" when she returns.\n\n\"Time is going to prove this out, and we have to do the work to prove it, but my goal is to reestablish Miss USA and Miss Teen USA as America's It Girls,\" he said.\n\nLet the reign begin.\n\nYour daily guide to what's moving markets — straight to your inbox.\n          \n            Sign up \n      chevron down icon\n      An icon in the shape of an angle pointing down.\n\nJump to",
  "images": []
}