{
  "title": "Tracking bats as they hunt birds in the skies above Europe - Ars Technica",
  "link": "https://arstechnica.com/science/2025/10/tracking-bats-as-they-hunt-birds-in-the-skies-above-europe/",
  "image": "https://cdn.arstechnica.net/wp-content/uploads/2025/10/image-4-1152x648.jpeg",
  "source": "Ars Technica",
  "category": "science",
  "pubDate": "2025-10-24T16:16:55Z",
  "api": "NewsAPI",
  "full_text": "A handful of bat species hunt birds, and new sensor data tells us how.\n\nThere are three species of bats that eat birds. We know that because we have found feathers and other avian remains in their feces. What we didn’t know was how exactly they hunt birds, which are quite a bit heavier, faster, and stronger than the insects bats usually dine on.\n\nTo find out, Elena Tena, a biologist at Doñana Biological Station in Seville, Spain, and her colleagues attached ultra-light sensors to Nyctalus Iasiopterus, the largest bats in Europe. What they found was jaw-droppingly brutal.\n\nNyctalus Iasiopterus, otherwise known as greater noctule bats, have a wingspan of about 45 centimeters. They have reddish-brown or chestnut fur with a slightly paler underside, and usually weigh around 40 to 60 grams. Despite that minimal weight, they are the largest of the three bat species known to eat birds, so the key challenge in getting a glimpse into the way they hunt was finding sensors light enough to not impede the bats’ flight.\n\nCameras, which are the usual go-to sensor, were out of the question. “Bats hunt at night, so you’d need night vision cameras, which together with batteries are too heavy for a bat to carry. Our sensors had to weigh below 10 percent of the weight of the bat—four to six grams,” Tena explained.\n\nTena and her team explored several alternative approaches throughout the last decade, including watching the bats from the ground or using military-grade radars. But even then, catching the hunting bats red-handed remained impossible.\n\nIn recent years, the technology and miniaturization finally caught up with Tena’s needs, and the team found the right sensors for the job and attached them to 14 greater noctule bats over the course of two years. The tags used in the study weighed around four grams, could run for several hours, and registered sound, altitude, and acceleration. This gave Tena and her colleagues a detailed picture of the bats’ behavior in the night sky. The recordings included both ambient environmental sounds and the ultra-frequency bursts bats use for echolocation. Combining altitude with accelerometer readouts enabled scientists to trace the bats’ movements through all their fast-paced turns, dives, and maneuvers.\n\nA study from 2000 hypothesized that greater noctule bats most likely attack birds at their roosts, where they’re most vulnerable. When Tena recovered the sensors and downloaded the data, she learned the bats did no such thing. Instead, they engaged the birds at high altitudes, like World War II interceptors attacking formations of bombers—think Steven Spielberg’s Masters of the Air drama. And it wasn’t pretty.\n\nThe Masters of the Air comparisons are justified in that the bats used similar tactics. But because they’re solitary hunters, they performed them individually, not in larger groups. Their attacks on birds, which the team later identified as European robins, began with the bats climbing very high—up to 1.2 kilometers into the night sky over Spain, where the study took place.\n\nThe bats then started diving down, issuing bursts of echolocation buzzes to find their prey and lock onto a single target. The pursuit was significantly longer than the roughly 10 seconds that other bat species need to catch significantly weaker and lighter insects. It took a half a minute to nearly three minutes from the beginning of the dive to the last registered distress calls of an unlucky bird. “They most likely kill the birds with a bite,” Tena said.\n\nBut even more surprising than the hunt itself was the way bats handled their prey after a successful attack. Tena’s team found severed avian wings on the ground beneath the location of the aerial battles between birds and bats. “That was another thing we learned,” Tena said. “Bats that managed to catch a bird did not land—their altitude did not change. They were consuming those birds mid-air.” Tena thinks the bats bite off the wings to reduce drag and the weight of the bird.\n\nThe bats were eating their catches in the sky, as evidenced by registered chewing sounds, which lasted for 23 minutes. “At this point, it is unclear why they don’t land to eat. They hunt at high altitudes, so perhaps the energy expenditure to land, eat, and climb back up again would be too high go through it,” Tena suggested. “Overall, the way they handle birds is quite similar to the way they handle insects.”\n\nTena thinks passerine birds flying at high altitudes at night are a food source that very few predators have managed to tap into. Falcons, which can also hunt migrating birds in flight, usually do so during the day. Nocturnal avian predators like owls, on the other hand, typically do not fly that high and hunt closer to the ground. Greater noctule bats can likely feed on night-flying passerine birds without any formidable competition.\n\nStill, there are a few questions that remain unanswered. The first is how effective the bats are in targeting birds.\n\n“We don’t have enough data to say what is their success rate,” Tena said. Most of the data her team collected focused on greater noctule bats doing something else they normally do: hunting insects. Attacks on birds were an exception rather than the norm for them. “We confirmed two cases of such attacks in our data. One was successful, the other one was not, so based on what we have, you could say they are 50 percent effective. But that’s hardly conclusive, and the truth is we don’t know,” Tena explained.\n\nAnother unknown is the extent to which the bats’ diet relies on birds, which are likely harder to catch than insects. “What we also want to investigate is anti-predator behavior in those birds. We know they can’t hear ultra-frequency sounds bats use for echolocation so perhaps they rely on listening for wing beats, but we can’t be sure,” Tena said.\n\nFor now, though, her team wants to focus on analyzing the data they already collected. “We published the portion about birds because it was the most impressive, but we also have huge amounts of data on bats hunting insects,” Tena explained.\n\nGreater noctule bats are considered an endangered species in Spain, and understating their habitats and foraging behaviors, Tena thinks, should help inform future conservation efforts. “Still, at some point we want to tag the bats again, perhaps with even better sensors,” Tena said. “There’s a lot we are still missing for what’s happening above our heads.”\n\nScience, 2025. DOI: 10.1126/science.adr2475\n\nArs Technica has been separating the signal from\n          the noise for over 25 years. With our unique combination of\n          technical savvy and wide-ranging interest in the technological arts\n          and sciences, Ars is the trusted source in a sea of information. After\n          all, you don’t need to know everything, only what’s important.",
  "images": [
    "https://cdn.arstechnica.net/wp-content/uploads/2024/03/jacek_krywko.jpg",
    "https://cdn.arstechnica.net/civis/data/avatars/m/502/502263.jpg?1669176803",
    "https://cdn.arstechnica.net/wp-content/uploads/2025/10/network-outage-768x432.jpg"
  ]
}