{
  "title": "Tropical Storm Melissa stationary in the Caribbean as forecasters warn it will quickly intensify - AP News",
  "link": "https://apnews.com/article/storm-melissa-caribbean-jamaica-haiti-dominican-republic-5532dedc71d40c74a88679ee899ffc5d",
  "image": "https://dims.apnews.com/dims4/default/2ac639b/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F92%2F07%2F6b7de3753aa7ccc12f3b0ed04f77%2F5c7d33f9082a426995a028f7e6f7b06f",
  "source": "Associated Press",
  "category": "general",
  "pubDate": "2025-10-24T17:26:00Z",
  "api": "NewsAPI",
  "full_text": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nTropical Storm Melissa lumbered through the Caribbean Sea on Thursday, bringing a risk of dangerous landslides and life-threatening flooding to Jamaica and southern Hispaniola — an island shared by the Dominican Republic and Haiti. Officials urged residents in flood-prone areas to seek higher ground. (AP/Martin Adames and Raphael Simon)\n\nPeople place plastic tarps over their tents ahead of expected rain at a shelter for families displaced by gang violence in Port-au-Prince, Haiti, Thursday, Oct. 23, 2025. (AP Photo/Odelyn Joseph)\n\nPeople wade through a street flooded by rains caused by Tropical Storm Melissa in Santo Domingo, Dominican Republic, Friday, Oct. 24, 2025. (AP Photo/Ricardo Hernandez)\n\nPeople walk in a street flooded by rains caused by Tropical Storm Melissa in Santo Domingo, Dominican Republic, Friday, Oct. 24, 2025. (AP Photo/Ricardo Hernandez)\n\nA woman holds a girl with an umbrella’s hand during light rain in Port-au-Prince, Haiti, Thursday, Oct. 23, 2025. (AP Photo/Odelyn Joseph)\n\nThis NOAA satellite image taken at 11:40 a.m. EST on Tuesday, Oct. 21, 2025, shows Tropical Storm Melissa in the Central Caribbean Sea. (NOAA via AP)\n\nSAN JUAN, Puerto Rico (AP) — Tropical Storm Melissa was nearly stationary in the central Caribbean on Friday as forecasters warned it could strengthen and swipe Jamaica as a powerful hurricane and dump a staggering amount of rain — up to 35 inches (89 centimeters) — on southwest Haiti, where they warned of catastrophic flooding and landslides.\n\nThe erratic storm was expected to drop copious rain on Jamaica and the southern regions of Haiti and the Dominican Republic. At least three people were killed in Haiti, and one person was killed and one reported missing in Dominican Republic.\n\n“These heavy rains are just going to sit over one area for several days,” said Jamie Rhome, deputy director at the U.S. National Hurricane Center.\n\nThe storm was located about 180 miles (290 kilometers) southeast of Kingston, Jamaica, and about 245 miles (390 kilometers) southwest of Port-au-Prince, Haiti. It had maximum sustained winds of 65 mph (100 kph) and was moving northwest at 3 mph (6 kph), the U.S. center said.\n\nA hurricane watch and a tropical storm warning were in effect for Jamaica and Haiti’s southwest peninsula.\n\nThe center of Melissa is expected to move near or over Jamaica early next week, forecasters said.\n\nUp to 25 inches (64 centimeters) of rain is forecast for parts of Jamaica, southern Haiti and the southern Dominican Republic through Tuesday. Up to 35 inches of rain is possible across Haiti’s Tiburon Peninsula, the center said. That was considered an unusually high amount even for a slow-moving storm.\n\nThe storm is then forecast to hit eastern Cuba as a major hurricane early Wednesday, where up to 12 inches (30 centimeters) could fall in some areas.\n\nThe National Hurricane Center warned that “heavy rainfall will result in catastrophic flash flooding and landslides across southwestern Haiti into early next week.”\n\nIt noted that strong winds could also last for a day or more over Haiti’s Tiburon peninsula.\n\nHaiti’s Civil Protection Agency said a landslide in Port-au-Prince killed two people and injured another, with the death toll rising to three. Earlier this week, a large tree fell on an elderly man in southern Haiti and killed him, while five other people in the country’s central region were injured in flooding,\n\nThe U.N. said it has prepared more than 100 emergency shelters in Haiti’s southern region.\n\nWilgar Joseph said he and his family were leaving their home in Les Cayes out of safety because it has a zinc roof.\n\n“I’ll stay with a friend whose home is on higher ground so I can protect myself in case it gets out of control,” he said.\n\nMeanwhile, thousands of people living in makeshift shelters across Port-au-Prince after gangs forced them to flee their homes worried about the storm.\n\n“The message on the radio is to protect ourselves,” said Dina Georges. “How can I protect myself if I don’t have a home? I’m on the streets. And on top of that, I have two kids to protect.”\n\nNephtali Johnson Pierre, 35, echoed those sentiments: “I’m dealing with two storms: the gangs and the weather.”\n\nMelissa was expected to move toward Jamaica over the weekend. It was forecast to strengthen into a hurricane by Saturday and become a major hurricane by Sunday, possibly reaching Category 4 status before dawn on Monday.\n\nForecasters said that Jamaica could see life-threatening flooding and landslides because the ground is already saturated from recent heavy rains unrelated to the storm.\n\nThe storm is moving so slowly that parts of Jamaica could experience hurricane conditions for 72 hours or longer, said Alex DaSilva, AccuWeather’s lead hurricane expert.\n\n“Melissa is evolving into a slow-motion disaster,” he said. “Millions of people are at risk of catastrophic impacts. We are increasingly concerned about the threat of a humanitarian disaster unfolding, especially if this storm stalls.”\n\nMarcus Thompson, who lives in Kingston, said he covered his windows and stocked up on water and canned food.\n\n“We’ve been through storms before, but it’s better to be prepared early this time,” he said.\n\nOthers checked their roofs, cleaned gutters and charged electrical devices.\n\n“I moved my car to higher ground and gathered all essential documents just in case,” said Alton Williams, who lives in Mandeville.\n\nIn eastern Kingston, Veronica James said she was following updates and keeping her children informed.\n\n“If officials decide evacuation is necessary, we have a small bag ready with medicine and important papers,” she said.\n\nSchools, health centers and government offices closed across Jamaica on Thursday, with authorities warning that all airports would close within 24 hours if a hurricane warning is issued. More than 650 shelters were activated.\n\nJamaican Prime Minister Andrew Holness said the storm’s slow movement posed planning difficulties but noted the public sector would close by Friday afternoon.\n\n“Jamaica is at risk,” he said. “There is a threat.”\n\nThe Bahamas’ Foreign Affairs Ministry announced it would evacuate Bahamian students out of Jamaica on Friday ahead of the storm.\n\nThe storm has damaged nearly 200 homes in the Dominican Republic and knocked out water supply systems, affecting more than half a million customers. It also downed trees and traffic lights and unleashed a couple of small landslides.\n\nAll public schools across the Dominican Republic were closed Friday, as were government offices in 12 provinces under alert. More than two dozen communities were cut off by floodwaters.\n\n“This is an event that we should be following minute by minute,” said Juan Manuel Méndez García, emergency operations director in the Dominican Republic.\n\nOfficials noted that evacuations in areas under alert were mandatory.\n\n“The main thing here is to save lives. The risk is the enormous amount of rain,” said Dominican President Luis Abinader.\n\nMelissa is the 13th named storm of the Atlantic hurricane season, which runs from June 1 to Nov. 30.\n\nThe U.S. National Oceanic and Atmospheric Administration had predicted an above-normal season with 13 to 18 named storms.\n\n___\n\nMyers Jr. reported from Kingston, Jamaica and Sanon from Port-au-Prince, Haiti.\n\nCopyright 2025 The Associated Press. All Rights Reserved.",
  "images": [
    "https://dims.apnews.com/dims4/default/94c503b/2147483647/strip/true/crop/640x236+0+0/resize/320x118!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc3%2F4c%2F65482a7b452db66043542c093eaf%2Fpromo-2x.png",
    "https://dims.apnews.com/dims4/default/94c503b/2147483647/strip/true/crop/640x236+0+0/resize/320x118!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc3%2F4c%2F65482a7b452db66043542c093eaf%2Fpromo-2x.png",
    "https://dims.apnews.com/dims4/default/bc1ddbf/2147483647/strip/true/crop/2851x1534+0+0/resize/240x129!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F22%2F25%2F9576fafb4e768552fed602a60238%2Fap-pri-wordmarktagline-rgb-dbg.png"
  ]
}