{
  "title": "‘Victorious’ Trina Vega Spinoff ‘Hollywood Arts’ Starring Daniella Monet Moves To Netflix With Series Order & Cast Set; Nick & P+ Get Second Window - Deadline",
  "link": "http://deadline.com/2025/10/victorious-trina-vega-spinoff-hollywood-arts-daniella-monet-netflix-1236596090/",
  "image": "https://deadline.com/wp-content/uploads/2025/10/Trina-Vega-victorious.jpg?w=1024",
  "source": "Deadline",
  "category": "entertainment",
  "pubDate": "2025-10-24T15:00:00Z",
  "api": "NewsAPI",
  "full_text": "By Nellie Andreeva\n\nCo-Editor-in-Chief, TV\n\nThe Victorious spinoff Hollywood Arts starring Daniella Monet, reprising her role as Trina Vega, is moving forward — and moving to a new home. The multi-camera sitcom, which was developed at Nickelodeon, where it was put on fast track in early 2025, has been licensed to Netflix, which has ordered 26 episodes.\n\nHollywood Arts will premiere on the global streamer in 2026 before a second-window release on Nickelodeon and sibling Paramount+ (likely day and date).\n\nThe sale to Netflix is believed to be a recent development after the August completion of the Skydance-Paramount merger, which resulted in the departure of longtime Nickelodeon chief Brian Robbins among other top executive exits.\n\nAs Deadline reported in February, Victorious creator Dan Schneider, who parted ways with Nickelodeon in 2018, has no involvement in Hollywood Arts. The followup to the popular 2010 sitcom, which ran on Nickelodeon for four seasons, comes from writers/showrunners Jake Farrow — who was a writer-producer on both Victorious and offshoot Sam & Cat and also voiced Robbie’s puppet Rex Powers on Victorious — and Samantha Martin (Nick’s Henry Danger and The Fairly OddParents: Fairly Odder).\n\nBy February, casting on Hollywood Arts had already started, and Nickelodeon assembled the cast before the series was taken to Netflix, I hear. In addition to Monet, who also executive produces, it includes Alyssa Miles (Hanging out with Alyssa and Xavier), Emmy Liu-Wang (Raven’s Home), Peyton Jackson (Young Dylan), Erika Swayze (School Spirits), and Martin Kamm (Unsung Hero). Yvette Nicole Brown (Community) is set to guest star.\n\nIt is unclear yet whether other original cast members, notably lead Victoria Justice and Wicked star Ariana Grande, would appear on Hollywood Arts. It would make sense for Justice to reprise her role as Tori Vega, Trina’s younger sister.\n\nIn the new series, struggling actress Trina Vega (Daniella Monet) returns to her former high school, Hollywood Arts, as an unqualified substitute teacher, quickly finding herself both clashing with and unexpectedly inspiring a new generation of ambitious and talented students as they learn to find their true path at Hollywood’s most elite performing arts school.\n\nHollywood Arts held its first table read Oct. 14 with production underway in Vancouver, Canada. You can see photos from the table read above.\n\nOriginally developed and produced by Nickelodeon, Hollywood Arts will now be produced by Paramount Television Studios. The newly revived post-merger TV studio encompasses the slates of Skydance Television and Showtime/MTV Entertainment Studios as well as Awesomeness series and Nickelodeon’s live-action shows.\n\nTaking in Hollywood Arts makes sense for Netflix. The platform currently carries Seasons 1-3 of Victorious, which Netflix says has amassed over 45M views on the streamer since the beginning of 2024.\n\nLaunching a successful original teen sitcom has been a challenge for Netflix amid an overall struggle for original multi-camera comedies on streaming. Netflix got some traction with Alexa & Katie while other efforts, such as No Good Nick and Team Kaylie, faced quick cancellation. The streamer does have hits in the tween and teen space, including movie juggernaut KPop Demon Hunters and ongoing series XO, Kitty, produced by Paramount TV Studios, Geek Girl, My Life With the Walter Boys and A Good Girl’s Guide to Murder.\n\nNetflix has had a string of collaborations with Nickelodeon over the past decade through different regimes on both sides, including a major 2019 output deal for original films and TV series based on Nickelodeon IP. The streamer has Avatar: The Last Airbender, a live-action show based on the beloved Nick animated series.\n\nAnd, as part of Paramount’s windowing strategy, Nick sitcoms That Girl Lay Lay and Erin & Aaron got a second run on Netflix in the U.S., with the streamer debuting the shows internationally.\n\nA revival of another Dan Schneider sitcom for Nickelodeon, iCarly, recently ran on Paramount+ for three seasons. New Paramount leadership’s motives to license Hollywood Arts to Netflix instead of keeping it in-house on Nickelodeon and Paramount+ — or taking the first run and offering Netflix second window — are not entirely clear but the strategy shift will bring in sizable revenue. Additionally, comedy is not a priority as Paramount+’s original slate is being rebuilt under the new leadership.\n\nHollywood Arts is executive produced by Monet, Farrow, Martin and director Jonathan Judge (The Really Loud House, My Weird School). The first episode is written by Farrow and Martin and will be directed by Judge. Production of the series is overseen by Nickelodeon’s Shauna Phelan, EVP, Live Action Series, and Brian Banks, Executive in Charge of Production.“Coming back as Trina alongside such a dynamic, powerful cast of newcomers is something I feel very lucky and grateful to do,” Monet said. “Victorious was in a lot of ways life changing for all of us, our cast is forever bonded by that experience, and to think that I have an opportunity to steward anything close to that is a feeling I can’t begin to describe. As an actress, producer, and mom, I am so eager to create something we can all be proud to share with the world.”\n\nVictorious follows teenager Tori Vega (Justice), as she navigates her way through the prestigious performing arts high school Hollywood Arts, alongside her older sister Trina (Monet) and other talented students, Andre Harris (Leon Thomas III), Robbie Shapiro (Matt Bennett), Jade West (Elizabeth Gillies), Cat Valentine (Grande) and Beck Oliver (Avan Jogia). The comedy scored solid ratings and earned two Emmy nominations for Outstanding Children’s Program.\n\nThis is the second Victorious spinoff series following the Victorious/iCarly mashup Sam & Cat, which starred Victorious’ Grande as Cat and iCarly‘s Jennette McCurdy as Sam.\n\nGet our Breaking News Alerts and Keep your inbox happy.\n\nComments On Deadline Hollywood are monitored. So don't go off topic, don't impersonate anyone, and don't get your facts wrong.\n\nComment\n\nName\n\nEmail\n\nWebsite\n\nΔ\n\nCongratulations! But… please bring production back to LA!  Like diversity and inclusion- shows should film in their location whenever possible…i.e. Hollywood!\n\nSignup for Breaking News Alerts & Newsletters\n\nBy providing your information, you agree to our Terms of Use and our Privacy Policy.\n\t\t\t\tWe use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply.\n\nGet our latest storiesin the feed of your favorite networks\n\nWe want to hear from you! Send us a tip using our annonymous form.\n\nSign up for our breaking news alerts\n\nBy providing your information, you agree to our Terms of Use and our Privacy Policy.\n\t\t\t\tWe use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply.\n\nDeadline is a part of Penske Media Corporation. © 2025 Deadline Hollywood, LLC. All Rights Reserved.\n\nBy providing your information, you agree to our Terms of Use and our Privacy Policy.\n\t\t\t\tWe use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply.",
  "images": [
    "https://deadline.com/wp-content/uploads/2025/10/Trina.jpg?w=681&h=383&crop=1",
    "https://deadline.com/wp-content/themes/pmc-deadline-2019/assets/public/lazyload-fallback.jpg",
    "https://deadline.com/wp-content/themes/pmc-deadline-2019/assets/public/lazyload-fallback.jpg",
    "https://deadline.com/wp-content/themes/pmc-deadline-2019/assets/public/lazyload-fallback.jpg",
    "https://deadline.com/wp-content/themes/pmc-deadline-2019/assets/public/lazyload-fallback.jpg"
  ]
}