{
  "title": "What you need to know about Saturday's BYU-Iowa State game - Deseret News",
  "link": "https://www.deseret.com/sports/2025/10/24/byu-cougars-football-iowa-state-big-12-how-to-watch-2025/",
  "image": "https://www.deseret.com/resizer/v2/MSVIG2THQFGUVORXCULLDVPWIQ.JPG?focal=0%2C0&auth=f68e18935f9a153a5ccd44c4f1c441e6335189b9c2ca44dd168b1b28c2af779a&width=1200&height=630",
  "source": "Deseret News",
  "category": "sports",
  "pubDate": "2025-10-24T16:00:00Z",
  "api": "NewsAPI",
  "full_text": "For BYU: The Cougars are 7-0 for the second consecutive season, standing as the only unbeaten team remaining in the Big 12 after defeating rival Utah this past week.\n\nBYU last faced Iowa State in November 2023, where the Cougars were blown out in 45-13 fashion. Since that loss, Kalani Sitake’s crew is 18-4.\n\nFor Iowa State: The Cyclones have lost two straight contests but had a bye last week to regroup, now looking to bounce back against BYU.\n\nIowa State reached 2024’s Big 12 title game, but with two losses already this season, getting back to Arlington this year will likely require a perfect stretch run.\n\nThe Cyclones have been rather sloppy offensively during their two-game losing skid, being flagged 12 times on offense against Cincinnati and Colorado. If the discipline doesn’t improve against BYU — which took advantage of 12 Utah penalties last week — Iowa State’s path to victory will become much more complicated.\n\nAdditionally, injuries have ravaged the Cyclones’ depth in their secondary, so watch how Bear Bachmeier and BYU try to attack through the air — and how Iowa State’s remaining secondary personnel responds.\n\nConversely, BYU’s secondary has played well this year, but Rocco Becht is a terrific passer and won’t be afraid to challenge the Cougars downfield. Keep an eye on that matchup.\n\nThe Cougars’ pass rush hasn’t set the world on fire this season but may have had a breakthrough against Utah, getting three sacks on the Utes’ highly-touted offensive line. Iowa State’s pass blocking has been suspect at times, and Becht is on pace to take the most sacks of his career, so watch to see if BYU’s defense can continue its positive pass-rushing momentum in an advantageous matchup.\n\nParker Kingston, junior, wide receiver, BYU. With Iowa State’s secondary in shambles, Kingston’s elite speed will surely come in handy Saturday.\n\nKingston is currently BYU’s team leader in catches with 27, but he’s also logged 12 carries on fly sweeps and other unique designs as well, accounting for 449 yards of total offense and four touchdowns.\n\nThe Cougars have done a good job finding creative ways to get Kingston the ball this year, and against Iowa State, they should force-feed him as much as possible. He’s explosive on screens. He can go over the middle or deep downfield. He’s a true Swiss army knife of a receiver, and facing the Cyclones’ thin secondary could allow him to shine once again.\n\n“Iowa State is a really well-coached team with a lot of athletes and great players in all three phases. And we’re going to be in (front of) their home crowd, so that’s always going to be a good challenge.\n\n“But I’m looking forward to it. I want our guys to embrace the opportunity and have fun with it. It is gonna be a really cool environment.” — BYU coach Kalani Sitake\n\n“They play for each other. They play really great complementary football, and they play great team football. So much respect for them, and across the board, they’re playing really good football right now.\n\n“It starts with the toughness of their quarterback. I love their running back, tough, physical football player. And then when you look at those five offensive linemen, man, those guys are really talented players, guys that play a lot of football. So I think when you start with this BYU team, you talk about physicality and their ability to run the football.\n\n“And then on top of that, they’ve got playmakers on the perimeter. You see it in their special teams game, you see it offensively. All those guys are doing great things in all phases of the game. So they’re a complete offense and can really attack you in all facets of it.”\n\n— Iowa State coach Matt Campbell",
  "images": [
    "https://www.deseret.com/resizer/v2/https%3A%2F%2Fauthor-service-images-prod-us-east-1.publishing.aws.arc.pub%2Fdeseretnews%2F34636f19-840b-423f-a69d-44e085e5fb67.png?auth=3ac1cfd106ae6cf4529f2cfc69e12674ac2c7ed15d3c443aad9968fe4ca7ed8f&focal=0%2C0&width=96&height=96",
    "https://www.deseret.com/resizer/v2/UHKGP77IT5E3JLPDLCGEIU5ZBI.jpg?auth=d58d6a687825dbcea900eae34347fd2f8912acd79ed453d1c152648d070b624a&width=300",
    "https://www.deseret.com/resizer/v2/SIXHX6U3UWPUPJAYLHE4LTROQU.jpg?auth=0971d05e31bed1518b643f86b7d724b87ef4c46373bb65961f25b4a9506ccdfd&focal=0%2C0&width=800&height=533"
  ]
}